const industries = [
    {
        'id': 10,
        'name': '农、林、牧、渔业',
        'children': [
            {
                'id': 1010,
                'name': '农业',
                'children': [
                    {
                        'id': 101010,
                        'name': '谷物种植'
                    },
                    {
                        'id': 101011,
                        'name': '豆类、油料和薯类种植'
                    },
                    {
                        'id': 101012,
                        'name': '棉、麻、糖、烟草种植'
                    },
                    {
                        'id': 101013,
                        'name': '蔬菜、食用菌及园艺作物种植'
                    },
                    {
                        'id': 101014,
                        'name': '水果种植'
                    },
                    {
                        'id': 101015,
                        'name': '坚果、含油果、香料和饮料作物种植'
                    },
                    {
                        'id': 101016,
                        'name': '中药材种植'
                    },
                    {
                        'id': 101017,
                        'name': '草种植及割草'
                    },
                    {
                        'id': 101018,
                        'name': '其他农业'
                    }
                ]
            },
            {
                'id': 1011,
                'name': '林业',
                'children': [
                    {
                        'id': 101110,
                        'name': '林木育种和育苗'
                    },
                    {
                        'id': 101111,
                        'name': '造林和更新'
                    },
                    {
                        'id': 101112,
                        'name': '森林经营、管护和改培'
                    },
                    {
                        'id': 101113,
                        'name': '木材和竹材采运'
                    },
                    {
                        'id': 101114,
                        'name': '林产品采集'
                    }
                ]
            },
            {
                'id': 1012,
                'name': '畜牧业',
                'children': [
                    {
                        'id': 101210,
                        'name': '牲畜饲养'
                    },
                    {
                        'id': 101211,
                        'name': '家禽饲养'
                    },
                    {
                        'id': 101212,
                        'name': '狩猎和捕捉动物'
                    },
                    {
                        'id': 101213,
                        'name': '其他畜牧业'
                    }
                ]
            },
            {
                'id': 1013,
                'name': '渔业',
                'children': [
                    {
                        'id': 101310,
                        'name': '水产养殖'
                    },
                    {
                        'id': 101311,
                        'name': '水产捕捞'
                    }
                ]
            },
            {
                'id': 1014,
                'name': '农、林、牧、渔专业及辅助性活动',
                'children': [
                    {
                        'id': 101410,
                        'name': '农业专业及辅助性活动'
                    },
                    {
                        'id': 101411,
                        'name': '林业专业及辅助性活动'
                    },
                    {
                        'id': 101412,
                        'name': '畜牧专业及辅助性活动'
                    },
                    {
                        'id': 101413,
                        'name': '渔业专业及辅助性活动'
                    }
                ]
            }
        ]
    },
    {
        'id': 11,
        'name': '采矿业',
        'children': [
            {
                'id': 1110,
                'name': '煤炭开采和洗选业',
                'children': [
                    {
                        'id': 111010,
                        'name': '烟煤和无烟煤开采洗选'
                    },
                    {
                        'id': 111011,
                        'name': '褐煤开采洗选'
                    },
                    {
                        'id': 111012,
                        'name': '其他煤炭采选'
                    }
                ]
            },
            {
                'id': 1111,
                'name': '石油和天然气开采业',
                'children': [
                    {
                        'id': 111110,
                        'name': '石油开采'
                    },
                    {
                        'id': 111111,
                        'name': '天然气开采'
                    }
                ]
            },
            {
                'id': 1112,
                'name': '黑色金属矿采选业',
                'children': [
                    {
                        'id': 111210,
                        'name': '铁矿采选'
                    },
                    {
                        'id': 111211,
                        'name': '锰矿、铬矿采选'
                    },
                    {
                        'id': 111212,
                        'name': '其他黑色金属矿采选'
                    }
                ]
            },
            {
                'id': 1113,
                'name': '有色金属矿采选业',
                'children': [
                    {
                        'id': 111310,
                        'name': '常用有色金属矿采选'
                    },
                    {
                        'id': 111311,
                        'name': '贵金属矿采选'
                    },
                    {
                        'id': 111312,
                        'name': '稀有稀土金属矿采选'
                    }
                ]
            },
            {
                'id': 1114,
                'name': '非金属矿采选业',
                'children': [
                    {
                        'id': 111410,
                        'name': '土砂石开采'
                    },
                    {
                        'id': 111411,
                        'name': '化学矿开采'
                    },
                    {
                        'id': 111412,
                        'name': '采盐'
                    },
                    {
                        'id': 111413,
                        'name': '石棉及其他非金属矿采选'
                    }
                ]
            },
            {
                'id': 1115,
                'name': '开采专业及辅助性活动',
                'children': [
                    {
                        'id': 111510,
                        'name': '煤炭开采和洗选专业及辅助性活动'
                    },
                    {
                        'id': 111511,
                        'name': '石油和天然气开采专业及辅助性活动'
                    },
                    {
                        'id': 111512,
                        'name': '其他开采专业及辅助性活动'
                    }
                ]
            },
            {
                'id': 1116,
                'name': '其他采矿业',
                'children': [
                    {
                        'id': 111610,
                        'name': '其他采矿业'
                    }
                ]
            }
        ]
    },
    {
        'id': 12,
        'name': '制造业',
        'children': [
            {
                'id': 1210,
                'name': '农副食品加工业',
                'children': [
                    {
                        'id': 121010,
                        'name': '谷物磨制'
                    },
                    {
                        'id': 121011,
                        'name': '饲料加工'
                    },
                    {
                        'id': 121012,
                        'name': '植物油加工'
                    },
                    {
                        'id': 121013,
                        'name': '制糖业'
                    },
                    {
                        'id': 121014,
                        'name': '屠宰及肉类加工'
                    },
                    {
                        'id': 121015,
                        'name': '水产品加工'
                    },
                    {
                        'id': 121016,
                        'name': '蔬菜、菌类、水果和坚果加工'
                    },
                    {
                        'id': 121017,
                        'name': '其他农副食品加工'
                    }
                ]
            },
            {
                'id': 1211,
                'name': '食品制造业',
                'children': [
                    {
                        'id': 121110,
                        'name': '焙烤食品制造'
                    },
                    {
                        'id': 121111,
                        'name': '糖果、巧克力及蜜饯制造'
                    },
                    {
                        'id': 121112,
                        'name': '方便食品制造'
                    },
                    {
                        'id': 121113,
                        'name': '乳制品制造'
                    },
                    {
                        'id': 121114,
                        'name': '罐头食品制造'
                    },
                    {
                        'id': 121115,
                        'name': '调味品、发酵制品制造'
                    },
                    {
                        'id': 121116,
                        'name': '其他食品制造'
                    }
                ]
            },
            {
                'id': 1212,
                'name': '酒、饮料和精制茶制造业',
                'children': [
                    {
                        'id': 121210,
                        'name': '酒的制造'
                    },
                    {
                        'id': 121211,
                        'name': '饮料制造'
                    },
                    {
                        'id': 121212,
                        'name': '精制茶加工'
                    }
                ]
            },
            {
                'id': 1213,
                'name': '烟草制品业',
                'children': [
                    {
                        'id': 121310,
                        'name': '烟叶复烤'
                    },
                    {
                        'id': 121311,
                        'name': '卷烟制造'
                    },
                    {
                        'id': 121312,
                        'name': '其他烟草制品制造'
                    }
                ]
            },
            {
                'id': 1214,
                'name': '纺织业',
                'children': [
                    {
                        'id': 121410,
                        'name': '棉纺织及印染精加工'
                    },
                    {
                        'id': 121411,
                        'name': '毛纺织及染整精加工'
                    },
                    {
                        'id': 121412,
                        'name': '麻纺织及染整精加工'
                    },
                    {
                        'id': 121413,
                        'name': '丝绢纺织及印染精加工'
                    },
                    {
                        'id': 121414,
                        'name': '化纤织造及印染精加工'
                    },
                    {
                        'id': 121415,
                        'name': '针织或钩针编织物及其制品制造'
                    },
                    {
                        'id': 121416,
                        'name': '家用纺织制成品制造'
                    },
                    {
                        'id': 121417,
                        'name': '产业用纺织制成品制造'
                    }
                ]
            },
            {
                'id': 1215,
                'name': '纺织服装、服饰业',
                'children': [
                    {
                        'id': 121510,
                        'name': '机织服装制造'
                    },
                    {
                        'id': 121511,
                        'name': '针织或钩针编织服装制造'
                    },
                    {
                        'id': 121512,
                        'name': '服饰制造'
                    }
                ]
            },
            {
                'id': 1216,
                'name': '皮革、毛皮、羽毛及其制品和制鞋业',
                'children': [
                    {
                        'id': 121610,
                        'name': '皮革鞣制加工'
                    },
                    {
                        'id': 121611,
                        'name': '皮革制品制造'
                    },
                    {
                        'id': 121612,
                        'name': '毛皮鞣制及制品加工'
                    },
                    {
                        'id': 121613,
                        'name': '羽毛(绒)加工及制品制造'
                    },
                    {
                        'id': 121614,
                        'name': '制鞋业'
                    }
                ]
            },
            {
                'id': 1217,
                'name': '木材加工和木、竹、藤、棕、草制品业',
                'children': [
                    {
                        'id': 121710,
                        'name': '木材加工'
                    },
                    {
                        'id': 121711,
                        'name': '人造板制造'
                    },
                    {
                        'id': 121712,
                        'name': '木质制品制造'
                    },
                    {
                        'id': 121713,
                        'name': '竹、藤、棕、草等制品制造'
                    }
                ]
            },
            {
                'id': 1218,
                'name': '家具制造业',
                'children': [
                    {
                        'id': 121810,
                        'name': '木质家具制造'
                    },
                    {
                        'id': 121811,
                        'name': '竹、藤家具制造'
                    },
                    {
                        'id': 121812,
                        'name': '金属家具制造'
                    },
                    {
                        'id': 121813,
                        'name': '塑料家具制造'
                    },
                    {
                        'id': 121814,
                        'name': '其他家具制造'
                    }
                ]
            },
            {
                'id': 1219,
                'name': '造纸和纸制品业',
                'children': [
                    {
                        'id': 121910,
                        'name': '纸浆制造'
                    },
                    {
                        'id': 121911,
                        'name': '造纸'
                    },
                    {
                        'id': 121912,
                        'name': '纸制品制造'
                    }
                ]
            },
            {
                'id': 1220,
                'name': '印刷和记录媒介复制业',
                'children': [
                    {
                        'id': 122010,
                        'name': '印刷'
                    },
                    {
                        'id': 122011,
                        'name': '装订及印刷相关服务'
                    },
                    {
                        'id': 122012,
                        'name': '记录媒介复制'
                    }
                ]
            },
            {
                'id': 1221,
                'name': '文教、工美、体育和娱乐用品制造业',
                'children': [
                    {
                        'id': 122110,
                        'name': '文教办公用品制造'
                    },
                    {
                        'id': 122111,
                        'name': '乐器制造'
                    },
                    {
                        'id': 122112,
                        'name': '工艺美术及礼仪用品制造'
                    },
                    {
                        'id': 122113,
                        'name': '体育用品制造'
                    },
                    {
                        'id': 122114,
                        'name': '玩具制造'
                    },
                    {
                        'id': 122115,
                        'name': '游艺器材及娱乐用品制造'
                    }
                ]
            },
            {
                'id': 1222,
                'name': '石油、煤炭及其他燃料加工业',
                'children': [
                    {
                        'id': 122210,
                        'name': '精炼石油产品制造'
                    },
                    {
                        'id': 122211,
                        'name': '煤炭加工'
                    },
                    {
                        'id': 122212,
                        'name': '核燃料加工'
                    },
                    {
                        'id': 122213,
                        'name': '生物质燃料加工'
                    }
                ]
            },
            {
                'id': 1223,
                'name': '化学原料和化学制品制造业',
                'children': [
                    {
                        'id': 122310,
                        'name': '基础化学原料制造'
                    },
                    {
                        'id': 122311,
                        'name': '肥料制造'
                    },
                    {
                        'id': 122312,
                        'name': '农药制造'
                    },
                    {
                        'id': 122313,
                        'name': '涂料、油墨、颜料及类似产品制造'
                    },
                    {
                        'id': 122314,
                        'name': '合成材料制造'
                    },
                    {
                        'id': 122315,
                        'name': '专用化学产品制造'
                    },
                    {
                        'id': 122316,
                        'name': '炸药、火工及焰火产品制造'
                    },
                    {
                        'id': 122317,
                        'name': '日用化学产品制造'
                    }
                ]
            },
            {
                'id': 1224,
                'name': '医药制造业',
                'children': [
                    {
                        'id': 122410,
                        'name': '化学药品原料药制造'
                    },
                    {
                        'id': 122411,
                        'name': '化学药品制剂制造'
                    },
                    {
                        'id': 122412,
                        'name': '中药饮片加工'
                    },
                    {
                        'id': 122413,
                        'name': '中成药生产'
                    },
                    {
                        'id': 122414,
                        'name': '兽用药品制造'
                    },
                    {
                        'id': 122415,
                        'name': '生物药品制品制造'
                    }
                ]
            },
            {
                'id': 1225,
                'name': '化学纤维制造业',
                'children': [
                    {
                        'id': 122510,
                        'name': '纤维素纤维原料及纤维制造'
                    },
                    {
                        'id': 122511,
                        'name': '合成纤维制造'
                    },
                    {
                        'id': 122512,
                        'name': '生物基材料制造'
                    }
                ]
            },
            {
                'id': 1226,
                'name': '橡胶和塑料制品业',
                'children': [
                    {
                        'id': 122610,
                        'name': '橡胶制品业'
                    },
                    {
                        'id': 122611,
                        'name': '塑料制品业'
                    }
                ]
            },
            {
                'id': 1227,
                'name': '非金属矿物制品业',
                'children': [
                    {
                        'id': 122710,
                        'name': '水泥、石灰和石膏制造'
                    },
                    {
                        'id': 122711,
                        'name': '石膏、水泥制品及类似制品制造'
                    },
                    {
                        'id': 122712,
                        'name': '砖瓦、石材等建筑材料制造'
                    },
                    {
                        'id': 122713,
                        'name': '玻璃制造'
                    },
                    {
                        'id': 122714,
                        'name': '玻璃制品制造'
                    },
                    {
                        'id': 122715,
                        'name': '玻璃纤维和玻璃纤维增强塑料制品制造'
                    },
                    {
                        'id': 122716,
                        'name': '陶瓷制品制造'
                    },
                    {
                        'id': 122717,
                        'name': '耐火材料制品制造'
                    },
                    {
                        'id': 122718,
                        'name': '石墨及其他非金属矿物制品制造'
                    }
                ]
            },
            {
                'id': 1228,
                'name': '黑色金属冶炼和压延加工业',
                'children': [
                    {
                        'id': 122810,
                        'name': '炼铁'
                    },
                    {
                        'id': 122811,
                        'name': '炼钢'
                    },
                    {
                        'id': 122812,
                        'name': '钢压延加工'
                    },
                    {
                        'id': 122813,
                        'name': '铁合金冶炼'
                    }
                ]
            },
            {
                'id': 1229,
                'name': '有色金属冶炼和压延加工业',
                'children': [
                    {
                        'id': 122910,
                        'name': '常用有色金属冶炼'
                    },
                    {
                        'id': 122911,
                        'name': '贵金属冶炼'
                    },
                    {
                        'id': 122912,
                        'name': '稀有稀土金属冶炼'
                    },
                    {
                        'id': 122913,
                        'name': '有色金属合金制造'
                    },
                    {
                        'id': 122914,
                        'name': '有色金属压延加工'
                    }
                ]
            },
            {
                'id': 1230,
                'name': '金属制品业',
                'children': [
                    {
                        'id': 123010,
                        'name': '结构性金属制品制造'
                    },
                    {
                        'id': 123011,
                        'name': '金属工具制造'
                    },
                    {
                        'id': 123012,
                        'name': '集装箱及金属包装容器制造'
                    },
                    {
                        'id': 123013,
                        'name': '金属丝绳及其制品制造'
                    },
                    {
                        'id': 123014,
                        'name': '建筑、安全用金属制品制造'
                    },
                    {
                        'id': 123015,
                        'name': '金属表面处理及热处理加工'
                    },
                    {
                        'id': 123016,
                        'name': '搪瓷制品制造'
                    },
                    {
                        'id': 123017,
                        'name': '金属制日用品制造'
                    },
                    {
                        'id': 123018,
                        'name': '铸造及其他金属制品制造'
                    }
                ]
            },
            {
                'id': 1231,
                'name': '通用设备制造业',
                'children': [
                    {
                        'id': 123110,
                        'name': '锅炉及原动设备制造'
                    },
                    {
                        'id': 123111,
                        'name': '金属加工机械制造'
                    },
                    {
                        'id': 123112,
                        'name': '物料搬运设备制造'
                    },
                    {
                        'id': 123113,
                        'name': '泵、阀门、压缩机及类似机械制造'
                    },
                    {
                        'id': 123114,
                        'name': '轴承、齿轮和传动部件制造'
                    },
                    {
                        'id': 123115,
                        'name': '烘炉、风机、包装等设备制造'
                    },
                    {
                        'id': 123116,
                        'name': '文化、办公用机械制造'
                    },
                    {
                        'id': 123117,
                        'name': '通用零部件制造'
                    },
                    {
                        'id': 123118,
                        'name': '其他通用设备制造业'
                    }
                ]
            },
            {
                'id': 1232,
                'name': '专用设备制造业',
                'children': [
                    {
                        'id': 123210,
                        'name': '采矿、冶金、建筑专用设备制造'
                    },
                    {
                        'id': 123211,
                        'name': '化工、木材、非金属加工专用设备制造'
                    },
                    {
                        'id': 123212,
                        'name': '食品、饮料、烟草及饲料生产专用设备制造'
                    },
                    {
                        'id': 123213,
                        'name': '印刷、制药、日化及日用品生产专用设备制造'
                    },
                    {
                        'id': 123214,
                        'name': '纺织、服装和皮革加工专用设备制造'
                    },
                    {
                        'id': 123215,
                        'name': '电子和电工机械专用设备制造'
                    },
                    {
                        'id': 123216,
                        'name': '农、林、牧、渔专用机械制造'
                    },
                    {
                        'id': 123217,
                        'name': '医疗仪器设备及器械制造'
                    },
                    {
                        'id': 123218,
                        'name': '环保、邮政、社会公共服务及其他专用设备制造代码类别'
                    }
                ]
            },
            {
                'id': 1233,
                'name': '汽车制造业',
                'children': [
                    {
                        'id': 123310,
                        'name': '汽车整车制造'
                    },
                    {
                        'id': 123311,
                        'name': '汽车用发动机制造'
                    },
                    {
                        'id': 123312,
                        'name': '改装汽车制造'
                    },
                    {
                        'id': 123313,
                        'name': '低速汽车制造'
                    },
                    {
                        'id': 123314,
                        'name': '电车制造'
                    },
                    {
                        'id': 123315,
                        'name': '汽车车身、挂车制造'
                    },
                    {
                        'id': 123316,
                        'name': '汽车零部件及配件制造'
                    }
                ]
            },
            {
                'id': 1234,
                'name': '铁路、船舶、航空航天和其他运输设备制造业',
                'children': [
                    {
                        'id': 123410,
                        'name': '铁路运输设备制造'
                    },
                    {
                        'id': 123411,
                        'name': '城市轨道交通设备制造'
                    },
                    {
                        'id': 123412,
                        'name': '船舶及相关装置制造'
                    },
                    {
                        'id': 123413,
                        'name': '航空、航天器及设备制造'
                    },
                    {
                        'id': 123414,
                        'name': '摩托车制造'
                    },
                    {
                        'id': 123415,
                        'name': '自行车和残疾人座车制造'
                    },
                    {
                        'id': 123416,
                        'name': '助动车制造'
                    },
                    {
                        'id': 123417,
                        'name': '非公路休闲车及零配件制造'
                    },
                    {
                        'id': 123418,
                        'name': '潜水救捞及其他未列明运输设备制造'
                    }
                ]
            },
            {
                'id': 1235,
                'name': '电气机械和器材制造业',
                'children': [
                    {
                        'id': 123510,
                        'name': '电机制造'
                    },
                    {
                        'id': 123511,
                        'name': '输配电及控制设备制造'
                    },
                    {
                        'id': 123512,
                        'name': '电线、电缆、光缆及电工器材制造'
                    },
                    {
                        'id': 123513,
                        'name': '电池制造'
                    },
                    {
                        'id': 123514,
                        'name': '家用电力器具制造'
                    },
                    {
                        'id': 123515,
                        'name': '非电力家用器具制造'
                    },
                    {
                        'id': 123516,
                        'name': '照明器具制造'
                    },
                    {
                        'id': 123517,
                        'name': '其他电气机械及器材制造'
                    }
                ]
            },
            {
                'id': 1236,
                'name': '计算机、通信和其他电子设备制造业',
                'children': [
                    {
                        'id': 123610,
                        'name': '计算机制造'
                    },
                    {
                        'id': 123611,
                        'name': '通信设备制造'
                    },
                    {
                        'id': 123612,
                        'name': '广播电视设备制造'
                    },
                    {
                        'id': 123613,
                        'name': '雷达及配套设备制造'
                    },
                    {
                        'id': 123614,
                        'name': '非专业视听设备制造'
                    },
                    {
                        'id': 123615,
                        'name': '智能消费设备制造'
                    },
                    {
                        'id': 123616,
                        'name': '电子器件制造'
                    },
                    {
                        'id': 123617,
                        'name': '电子元件及电子专用材料制造'
                    },
                    {
                        'id': 123618,
                        'name': '其他电子设备制造'
                    }
                ]
            },
            {
                'id': 1237,
                'name': '仪器仪表制造业',
                'children': [
                    {
                        'id': 123710,
                        'name': '通用仪器仪表制造'
                    },
                    {
                        'id': 123711,
                        'name': '专用仪器仪表制造'
                    },
                    {
                        'id': 123712,
                        'name': '钟表与计时仪器制造'
                    },
                    {
                        'id': 123713,
                        'name': '光学仪器制造'
                    },
                    {
                        'id': 123714,
                        'name': '衡器制造'
                    },
                    {
                        'id': 123715,
                        'name': '其他仪器仪表制造业'
                    }
                ]
            },
            {
                'id': 1238,
                'name': '其他制造业',
                'children': [
                    {
                        'id': 123810,
                        'name': '日用杂品制造'
                    },
                    {
                        'id': 123811,
                        'name': '核辐射加工'
                    },
                    {
                        'id': 123812,
                        'name': '其他未列明制造业'
                    }
                ]
            },
            {
                'id': 1239,
                'name': '废弃资源综合利用业',
                'children': [
                    {
                        'id': 123910,
                        'name': '金属废料和碎屑加工处理'
                    },
                    {
                        'id': 123911,
                        'name': '非金属废料和碎屑加工处理'
                    }
                ]
            },
            {
                'id': 1240,
                'name': '金属制品、机械和设备修理业',
                'children': [
                    {
                        'id': 124010,
                        'name': '金属制品修理'
                    },
                    {
                        'id': 124011,
                        'name': '通用设备修理'
                    },
                    {
                        'id': 124012,
                        'name': '专用设备修理'
                    },
                    {
                        'id': 124013,
                        'name': '铁路、船舶、航空航天等运输设备修理'
                    },
                    {
                        'id': 124014,
                        'name': '电气设备修理'
                    },
                    {
                        'id': 124015,
                        'name': '仪器仪表修理'
                    },
                    {
                        'id': 124016,
                        'name': '其他机械和设备修理业DD'
                    }
                ]
            }
        ]
    },
    {
        'id': 13,
        'name': '电力、热力、燃气及水生产和供应业',
        'children': [
            {
                'id': 1310,
                'name': '电力、热力生产和供应业',
                'children': [
                    {
                        'id': 131010,
                        'name': '电力生产'
                    },
                    {
                        'id': 131011,
                        'name': '电力供应'
                    },
                    {
                        'id': 131012,
                        'name': '热力生产和供应'
                    }
                ]
            },
            {
                'id': 1311,
                'name': '燃气生产和供应业',
                'children': [
                    {
                        'id': 131110,
                        'name': '燃气生产和供应业'
                    },
                    {
                        'id': 131111,
                        'name': '生物质燃气生产和供应业'
                    }
                ]
            },
            {
                'id': 1312,
                'name': '水的生产和供应业',
                'children': [
                    {
                        'id': 131210,
                        'name': '自来水生产和供应'
                    },
                    {
                        'id': 131211,
                        'name': '污水处理及其再生利用'
                    },
                    {
                        'id': 131212,
                        'name': '海水淡化处理'
                    },
                    {
                        'id': 131213,
                        'name': '其他水的处理、利用与分配'
                    }
                ]
            }
        ]
    },
    {
        'id': 14,
        'name': '建筑业',
        'children': [
            {
                'id': 1410,
                'name': '房屋建筑业',
                'children': [
                    {
                        'id': 141010,
                        'name': '住宅房屋建筑'
                    },
                    {
                        'id': 141011,
                        'name': '体育场馆建筑'
                    },
                    {
                        'id': 141012,
                        'name': '其他房屋建筑业'
                    }
                ]
            },
            {
                'id': 1411,
                'name': '土木工程建筑业',
                'children': [
                    {
                        'id': 141110,
                        'name': '铁路、道路、隧道和桥梁工程建筑'
                    },
                    {
                        'id': 141111,
                        'name': '水利和水运工程建筑'
                    },
                    {
                        'id': 141112,
                        'name': '海洋工程建筑'
                    },
                    {
                        'id': 141113,
                        'name': '工矿工程建筑'
                    },
                    {
                        'id': 141114,
                        'name': '架线和管道工程建筑'
                    },
                    {
                        'id': 141115,
                        'name': '节能环保工程施工代码类别'
                    },
                    {
                        'id': 141116,
                        'name': '电力工程施工'
                    },
                    {
                        'id': 141117,
                        'name': '其他土木工程建筑'
                    }
                ]
            },
            {
                'id': 1412,
                'name': '建筑安装业',
                'children': [
                    {
                        'id': 141210,
                        'name': '电气安装'
                    },
                    {
                        'id': 141211,
                        'name': '管道和设备安装'
                    },
                    {
                        'id': 141212,
                        'name': '其他建筑安装业'
                    }
                ]
            },
            {
                'id': 1413,
                'name': '建筑装饰、装修和其他建筑业',
                'children': [
                    {
                        'id': 141310,
                        'name': '建筑装饰和装修业'
                    },
                    {
                        'id': 141311,
                        'name': '建筑物拆除和场地准备活动'
                    },
                    {
                        'id': 141312,
                        'name': '提供施工设备服务'
                    },
                    {
                        'id': 141313,
                        'name': '其他未列明建筑业'
                    }
                ]
            }
        ]
    },
    {
        'id': 15,
        'name': '批发和零售业',
        'children': [
            {
                'id': 1510,
                'name': '批发业',
                'children': [
                    {
                        'id': 151010,
                        'name': '农、林、牧、渔产品批发'
                    },
                    {
                        'id': 151011,
                        'name': '食品、饮料及烟草制品批发'
                    },
                    {
                        'id': 151012,
                        'name': '纺织、服装及家庭用品批发'
                    },
                    {
                        'id': 151013,
                        'name': '文化、体育用品及器材批发'
                    },
                    {
                        'id': 151014,
                        'name': '医药及医疗器材批发'
                    },
                    {
                        'id': 151015,
                        'name': '矿产品、建材及化工产品批发'
                    },
                    {
                        'id': 151016,
                        'name': '机械设备、五金产品及电子产品批发'
                    },
                    {
                        'id': 151017,
                        'name': '贸易经纪与代理'
                    },
                    {
                        'id': 151018,
                        'name': '其他批发业'
                    }
                ]
            },
            {
                'id': 1511,
                'name': '零售业',
                'children': [
                    {
                        'id': 151110,
                        'name': '综合零售'
                    },
                    {
                        'id': 151111,
                        'name': '食品、饮料及烟草制品专门零售'
                    },
                    {
                        'id': 151112,
                        'name': '纺织、服装及日用品专门零售'
                    },
                    {
                        'id': 151113,
                        'name': '文化、体育用品及器材专门零售'
                    },
                    {
                        'id': 151114,
                        'name': '医药及医疗器材专门零售'
                    },
                    {
                        'id': 151115,
                        'name': '汽车、摩托车、零配件和燃料及其他动力销售指专门经营汽车、摩托车、汽车部件、汽车零配件及燃料、燃气的零售活动以及汽车充电桩服务'
                    },
                    {
                        'id': 151116,
                        'name': '家用电器及电子产品专门零售'
                    },
                    {
                        'id': 151117,
                        'name': '五金、家具及室内装饰材料专门零售'
                    },
                    {
                        'id': 151118,
                        'name': '货摊、无店铺及其他零售业'
                    }
                ]
            }
        ]
    },
    {
        'id': 16,
        'name': '交通运输、仓储和邮政业',
        'children': [
            {
                'id': 1610,
                'name': '铁路运输业',
                'children': [
                    {
                        'id': 161010,
                        'name': '铁路旅客运输'
                    },
                    {
                        'id': 161011,
                        'name': '铁路货物运输'
                    },
                    {
                        'id': 161012,
                        'name': '铁路运输辅助活动'
                    }
                ]
            },
            {
                'id': 1611,
                'name': '道路运输业',
                'children': [
                    {
                        'id': 161110,
                        'name': '城市公共交通运输'
                    },
                    {
                        'id': 161111,
                        'name': '公路旅客运输'
                    },
                    {
                        'id': 161112,
                        'name': '道路货物运输'
                    },
                    {
                        'id': 161113,
                        'name': '道路运输辅助活动'
                    }
                ]
            },
            {
                'id': 1612,
                'name': '水上运输业',
                'children': [
                    {
                        'id': 161210,
                        'name': '水上旅客运输'
                    },
                    {
                        'id': 161211,
                        'name': '水上货物运输'
                    },
                    {
                        'id': 161212,
                        'name': '水上运输辅助活动'
                    }
                ]
            },
            {
                'id': 1613,
                'name': '航空运输业',
                'children': [
                    {
                        'id': 161310,
                        'name': '航空客货运输'
                    },
                    {
                        'id': 161311,
                        'name': '通用航空服务'
                    },
                    {
                        'id': 161312,
                        'name': '航空运输辅助活动'
                    }
                ]
            },
            {
                'id': 1614,
                'name': '管道运输业',
                'children': [
                    {
                        'id': 161410,
                        'name': '海底管道运输'
                    },
                    {
                        'id': 161411,
                        'name': '陆地管道运输'
                    }
                ]
            },
            {
                'id': 1615,
                'name': '多式联运和运输代理业',
                'children': [
                    {
                        'id': 161510,
                        'name': '多式联运'
                    },
                    {
                        'id': 161511,
                        'name': '运输代理业'
                    }
                ]
            },
            {
                'id': 1616,
                'name': '装卸搬运和仓储业',
                'children': [
                    {
                        'id': 161610,
                        'name': '装卸搬运'
                    },
                    {
                        'id': 161611,
                        'name': '通用仓储'
                    },
                    {
                        'id': 161612,
                        'name': '低温仓储'
                    },
                    {
                        'id': 161613,
                        'name': '危险品仓储'
                    },
                    {
                        'id': 161614,
                        'name': '谷物、棉花等农产品仓储'
                    },
                    {
                        'id': 161615,
                        'name': '中药材仓储'
                    },
                    {
                        'id': 161616,
                        'name': '其他仓储业'
                    }
                ]
            },
            {
                'id': 1617,
                'name': '邮政业',
                'children': [
                    {
                        'id': 161710,
                        'name': '邮政基本服务'
                    },
                    {
                        'id': 161711,
                        'name': '快递服务'
                    },
                    {
                        'id': 161712,
                        'name': '其他寄递服务'
                    }
                ]
            }
        ]
    },
    {
        'id': 17,
        'name': '住宿和餐饮业',
        'children': [
            {
                'id': 1710,
                'name': '住宿业',
                'children': [
                    {
                        'id': 171010,
                        'name': '旅游饭店'
                    },
                    {
                        'id': 171011,
                        'name': '一般旅馆'
                    },
                    {
                        'id': 171012,
                        'name': '民宿服务'
                    },
                    {
                        'id': 171013,
                        'name': '露营地服务'
                    },
                    {
                        'id': 171014,
                        'name': '其他住宿业'
                    }
                ]
            },
            {
                'id': 1711,
                'name': '餐饮业',
                'children': [
                    {
                        'id': 171110,
                        'name': '正餐服务'
                    },
                    {
                        'id': 171111,
                        'name': '快餐服务'
                    },
                    {
                        'id': 171112,
                        'name': '饮料及冷饮服务'
                    },
                    {
                        'id': 171113,
                        'name': '餐饮配送及外卖送餐服务代码类别'
                    },
                    {
                        'id': 171114,
                        'name': '其他餐饮业'
                    }
                ]
            }
        ]
    },
    {
        'id': 18,
        'name': '信息传输、软件和信息技术服务业',
        'children': [
            {
                'id': 1810,
                'name': '电信、广播电视和卫星传输服务',
                'children': [
                    {
                        'id': 181010,
                        'name': '电信'
                    },
                    {
                        'id': 181011,
                        'name': '广播电视传输服务'
                    },
                    {
                        'id': 181012,
                        'name': '卫星传输服务'
                    }
                ]
            },
            {
                'id': 1811,
                'name': '互联网和相关服务',
                'children': [
                    {
                        'id': 181110,
                        'name': '互联网接入及相关服务'
                    },
                    {
                        'id': 181111,
                        'name': '互联网信息服务'
                    },
                    {
                        'id': 181112,
                        'name': '互联网平台'
                    },
                    {
                        'id': 181113,
                        'name': '互联网安全服务'
                    },
                    {
                        'id': 181114,
                        'name': '互联网数据服务'
                    },
                    {
                        'id': 181115,
                        'name': '其他互联网服务'
                    }
                ]
            },
            {
                'id': 1812,
                'name': '软件和信息技术服务业',
                'children': [
                    {
                        'id': 181210,
                        'name': '软件开发'
                    },
                    {
                        'id': 181211,
                        'name': '集成电路设计'
                    },
                    {
                        'id': 181212,
                        'name': '信息系统集成和物联网技术服务'
                    },
                    {
                        'id': 181213,
                        'name': '运行维护服务'
                    },
                    {
                        'id': 181214,
                        'name': '信息处理和存储支持服务'
                    },
                    {
                        'id': 181215,
                        'name': '信息技术咨询服务'
                    },
                    {
                        'id': 181216,
                        'name': '数字内容服务'
                    },
                    {
                        'id': 181217,
                        'name': '其他信息技术服务业'
                    }
                ]
            }
        ]
    },
    {
        'id': 19,
        'name': '金融业',
        'children': [
            {
                'id': 1910,
                'name': '货币金融服务',
                'children': [
                    {
                        'id': 191010,
                        'name': '中央银行服务'
                    },
                    {
                        'id': 191011,
                        'name': '货币银行服务'
                    },
                    {
                        'id': 191012,
                        'name': '非货币银行服务'
                    },
                    {
                        'id': 191013,
                        'name': '银行理财服务'
                    },
                    {
                        'id': 191014,
                        'name': '银行监管服务'
                    }
                ]
            },
            {
                'id': 1911,
                'name': '资本市场服务',
                'children': [
                    {
                        'id': 191110,
                        'name': '证券市场服务'
                    },
                    {
                        'id': 191111,
                        'name': '公开募集证券投资基金'
                    },
                    {
                        'id': 191112,
                        'name': '非公开募集证券投资基金'
                    },
                    {
                        'id': 191113,
                        'name': '期货市场服务'
                    },
                    {
                        'id': 191114,
                        'name': '证券期货监管服务'
                    },
                    {
                        'id': 191115,
                        'name': '资本投资服务'
                    },
                    {
                        'id': 191116,
                        'name': '其他资本市场服务'
                    }
                ]
            },
            {
                'id': 1912,
                'name': '保险业',
                'children': [
                    {
                        'id': 191210,
                        'name': '人身保险'
                    },
                    {
                        'id': 191211,
                        'name': '财产保险'
                    },
                    {
                        'id': 191212,
                        'name': '再保险'
                    },
                    {
                        'id': 191213,
                        'name': '商业养老金'
                    },
                    {
                        'id': 191214,
                        'name': '保险中介服务'
                    },
                    {
                        'id': 191215,
                        'name': '保险资产管理'
                    },
                    {
                        'id': 191216,
                        'name': '保险监管服务'
                    },
                    {
                        'id': 191217,
                        'name': '其他保险活动'
                    }
                ]
            },
            {
                'id': 1913,
                'name': '其他金融业',
                'children': [
                    {
                        'id': 191310,
                        'name': '金融信托与管理服务'
                    },
                    {
                        'id': 191311,
                        'name': '控股公司服务'
                    },
                    {
                        'id': 191312,
                        'name': '非金融机构支付服务'
                    },
                    {
                        'id': 191313,
                        'name': '金融信息服务'
                    },
                    {
                        'id': 191314,
                        'name': '金融资产管理公司'
                    },
                    {
                        'id': 191315,
                        'name': '其他未列明金融业'
                    }
                ]
            }
        ]
    },
    {
        'id': 20,
        'name': '房地产业',
        'children': [
            {
                'id': 2010,
                'name': '房地产业',
                'children': [
                    {
                        'id': 201010,
                        'name': '房地产开发经营'
                    },
                    {
                        'id': 201011,
                        'name': '物业管理'
                    },
                    {
                        'id': 201012,
                        'name': '房地产中介服务'
                    },
                    {
                        'id': 201013,
                        'name': '房地产租赁经营'
                    },
                    {
                        'id': 201014,
                        'name': '其他房地产业'
                    }
                ]
            }
        ]
    },
    {
        'id': 21,
        'name': '租赁和商务服务业',
        'children': [
            {
                'id': 2110,
                'name': '租赁业',
                'children': [
                    {
                        'id': 211010,
                        'name': '机械设备经营租赁'
                    },
                    {
                        'id': 211011,
                        'name': '文体设备和用品出租'
                    },
                    {
                        'id': 211012,
                        'name': '日用品出租'
                    }
                ]
            },
            {
                'id': 2111,
                'name': '商务服务业',
                'children': [
                    {
                        'id': 211110,
                        'name': '组织管理服务'
                    },
                    {
                        'id': 211111,
                        'name': '综合管理服务'
                    },
                    {
                        'id': 211112,
                        'name': '法律服务'
                    },
                    {
                        'id': 211113,
                        'name': '咨询与调查'
                    },
                    {
                        'id': 211114,
                        'name': '广告业'
                    },
                    {
                        'id': 211115,
                        'name': '人力资源服务'
                    },
                    {
                        'id': 211116,
                        'name': '安全保护服务'
                    },
                    {
                        'id': 211117,
                        'name': '会议、展览及相关服务'
                    },
                    {
                        'id': 211118,
                        'name': '其他商务服务业'
                    }
                ]
            }
        ]
    },
    {
        'id': 22,
        'name': '科学研究和技术服务业',
        'children': [
            {
                'id': 2210,
                'name': '研究和试验发展',
                'children': [
                    {
                        'id': 221010,
                        'name': '自然科学研究和试验发展'
                    },
                    {
                        'id': 221011,
                        'name': '工程和技术研究和试验发展'
                    },
                    {
                        'id': 221012,
                        'name': '农业科学研究和试验发展'
                    },
                    {
                        'id': 221013,
                        'name': '医学研究和试验发展'
                    },
                    {
                        'id': 221014,
                        'name': '社会人文科学研究'
                    }
                ]
            },
            {
                'id': 2211,
                'name': '专业技术服务业',
                'children': [
                    {
                        'id': 221110,
                        'name': '气象服务'
                    },
                    {
                        'id': 221111,
                        'name': '地震服务'
                    },
                    {
                        'id': 221112,
                        'name': '海洋服务'
                    },
                    {
                        'id': 221113,
                        'name': '测绘地理信息服务'
                    },
                    {
                        'id': 221114,
                        'name': '质检技术服务'
                    },
                    {
                        'id': 221115,
                        'name': '环境与生态监测检测服务'
                    },
                    {
                        'id': 221116,
                        'name': '地质勘查'
                    },
                    {
                        'id': 221117,
                        'name': '工程技术与设计服务'
                    },
                    {
                        'id': 221118,
                        'name': '工业与专业设计及其他专业技术服务'
                    }
                ]
            },
            {
                'id': 2212,
                'name': '科技推广和应用服务业',
                'children': [
                    {
                        'id': 221210,
                        'name': '技术推广服务'
                    },
                    {
                        'id': 221211,
                        'name': '知识产权服务'
                    },
                    {
                        'id': 221212,
                        'name': '科技中介服务'
                    },
                    {
                        'id': 221213,
                        'name': '创业空间服务'
                    },
                    {
                        'id': 221214,
                        'name': '其他科技推广服务业'
                    }
                ]
            }
        ]
    },
    {
        'id': 23,
        'name': '水利、环境和公共设施管理业',
        'children': [
            {
                'id': 2310,
                'name': '水利管理业',
                'children': [
                    {
                        'id': 231010,
                        'name': '防洪除涝设施管理'
                    },
                    {
                        'id': 231011,
                        'name': '水资源管理'
                    },
                    {
                        'id': 231012,
                        'name': '天然水收集与分配'
                    },
                    {
                        'id': 231013,
                        'name': '水文服务'
                    },
                    {
                        'id': 231014,
                        'name': '其他水利管理业'
                    }
                ]
            },
            {
                'id': 2311,
                'name': '生态保护和环境治理业',
                'children': [
                    {
                        'id': 231110,
                        'name': '生态保护'
                    },
                    {
                        'id': 231111,
                        'name': '环境治理业'
                    }
                ]
            },
            {
                'id': 2312,
                'name': '公共设施管理业',
                'children': [
                    {
                        'id': 231210,
                        'name': '市政设施管理'
                    },
                    {
                        'id': 231211,
                        'name': '环境卫生管理'
                    },
                    {
                        'id': 231212,
                        'name': '城乡市容管理'
                    },
                    {
                        'id': 231213,
                        'name': '绿化管理'
                    },
                    {
                        'id': 231214,
                        'name': '城市公园管理'
                    },
                    {
                        'id': 231215,
                        'name': '游览景区管理'
                    }
                ]
            },
            {
                'id': 2313,
                'name': '土地管理业',
                'children': [
                    {
                        'id': 231310,
                        'name': '土地整治服务'
                    },
                    {
                        'id': 231311,
                        'name': '土地调查评估服务'
                    },
                    {
                        'id': 231312,
                        'name': '土地登记服务'
                    },
                    {
                        'id': 231313,
                        'name': '土地登记代理服务'
                    },
                    {
                        'id': 231314,
                        'name': '其他土地管理服务'
                    }
                ]
            }
        ]
    },
    {
        'id': 24,
        'name': '居民服务、修理和其他服务业',
        'children': [
            {
                'id': 2410,
                'name': '居民服务业',
                'children': [
                    {
                        'id': 241010,
                        'name': '家庭服务'
                    },
                    {
                        'id': 241011,
                        'name': '托儿所服务'
                    },
                    {
                        'id': 241012,
                        'name': '洗染服务'
                    },
                    {
                        'id': 241013,
                        'name': '理发及美容服务'
                    },
                    {
                        'id': 241014,
                        'name': '洗浴和保健养生服务'
                    },
                    {
                        'id': 241015,
                        'name': '摄影扩印服务'
                    },
                    {
                        'id': 241016,
                        'name': '婚姻服务'
                    },
                    {
                        'id': 241017,
                        'name': '殡葬服务'
                    },
                    {
                        'id': 241018,
                        'name': '其他居民服务业'
                    }
                ]
            },
            {
                'id': 2411,
                'name': '机动车、电子产品和日用产品修理业',
                'children': [
                    {
                        'id': 241110,
                        'name': '汽车、摩托车等修理与维护'
                    },
                    {
                        'id': 241111,
                        'name': '计算机和办公设备维修'
                    },
                    {
                        'id': 241112,
                        'name': '家用电器修理'
                    },
                    {
                        'id': 241113,
                        'name': '其他日用产品修理业'
                    }
                ]
            },
            {
                'id': 2412,
                'name': '其他服务业',
                'children': [
                    {
                        'id': 241210,
                        'name': '清洁服务'
                    },
                    {
                        'id': 241211,
                        'name': '宠物服务'
                    },
                    {
                        'id': 241212,
                        'name': '其他未列明服务业PP'
                    }
                ]
            }
        ]
    },
    {
        'id': 25,
        'name': '教育',
        'children': [
            {
                'id': 2510,
                'name': '教育',
                'children': [
                    {
                        'id': 251010,
                        'name': '学前教育'
                    },
                    {
                        'id': 251011,
                        'name': '初等教育'
                    },
                    {
                        'id': 251012,
                        'name': '中等教育'
                    },
                    {
                        'id': 251013,
                        'name': '高等教育'
                    },
                    {
                        'id': 251014,
                        'name': '特殊教育'
                    },
                    {
                        'id': 251015,
                        'name': '技能培训、教育辅助及其他教育'
                    }
                ]
            }
        ]
    },
    {
        'id': 26,
        'name': '卫生和社会工作',
        'children': [
            {
                'id': 2610,
                'name': '卫生',
                'children': [
                    {
                        'id': 261010,
                        'name': '医院'
                    },
                    {
                        'id': 261011,
                        'name': '基层医疗卫生服务'
                    },
                    {
                        'id': 261012,
                        'name': '专业公共卫生服务'
                    },
                    {
                        'id': 261013,
                        'name': '其他卫生活动'
                    }
                ]
            },
            {
                'id': 2611,
                'name': '社会工作',
                'children': [
                    {
                        'id': 261110,
                        'name': '提供住宿社会工作'
                    },
                    {
                        'id': 261111,
                        'name': '不提供住宿社会工作'
                    }
                ]
            }
        ]
    },
    {
        'id': 27,
        'name': '文化、体育和娱乐业',
        'children': [
            {
                'id': 2710,
                'name': '新闻和出版业',
                'children': [
                    {
                        'id': 271010,
                        'name': '新闻业'
                    },
                    {
                        'id': 271011,
                        'name': '出版业'
                    }
                ]
            },
            {
                'id': 2711,
                'name': '广播、电视、电影和录音制作业',
                'children': [
                    {
                        'id': 271110,
                        'name': '广播'
                    },
                    {
                        'id': 271111,
                        'name': '电视'
                    },
                    {
                        'id': 271112,
                        'name': '影视节目制作'
                    },
                    {
                        'id': 271113,
                        'name': '广播电视集成播控'
                    },
                    {
                        'id': 271114,
                        'name': '电影和广播电视节目发行'
                    },
                    {
                        'id': 271115,
                        'name': '电影放映'
                    },
                    {
                        'id': 271116,
                        'name': '录音制作'
                    }
                ]
            },
            {
                'id': 2712,
                'name': '文化艺术业',
                'children': [
                    {
                        'id': 271210,
                        'name': '文艺创作与表演'
                    },
                    {
                        'id': 271211,
                        'name': '艺术表演场馆'
                    },
                    {
                        'id': 271212,
                        'name': '图书馆与档案馆'
                    },
                    {
                        'id': 271213,
                        'name': '文物及非物质文化遗产保护'
                    },
                    {
                        'id': 271214,
                        'name': '博物馆'
                    },
                    {
                        'id': 271215,
                        'name': '烈士陵园、纪念馆'
                    },
                    {
                        'id': 271216,
                        'name': '群众文体活动'
                    },
                    {
                        'id': 271217,
                        'name': '其他文化艺术业'
                    }
                ]
            },
            {
                'id': 2713,
                'name': '体育',
                'children': [
                    {
                        'id': 271310,
                        'name': '体育组织'
                    },
                    {
                        'id': 271311,
                        'name': '体育场地设施管理'
                    },
                    {
                        'id': 271312,
                        'name': '健身休闲活动'
                    },
                    {
                        'id': 271313,
                        'name': '其他体育'
                    }
                ]
            },
            {
                'id': 2714,
                'name': '娱乐业',
                'children': [
                    {
                        'id': 271410,
                        'name': '室内娱乐活动'
                    },
                    {
                        'id': 271411,
                        'name': '游乐园'
                    },
                    {
                        'id': 271412,
                        'name': '休闲观光活动'
                    },
                    {
                        'id': 271413,
                        'name': '彩票活动'
                    },
                    {
                        'id': 271414,
                        'name': '其他娱乐业'
                    }
                ]
            }
        ]
    },
    {
        'id': 28,
        'name': '公共管理、社会保障和社会组织',
        'children': [
            {
                'id': 2810,
                'name': '中国共产党机关',
                'children': [
                    {
                        'id': 281010,
                        'name': '中国共产党机关'
                    }
                ]
            },
            {
                'id': 2811,
                'name': '国家机构',
                'children': [
                    {
                        'id': 281110,
                        'name': '国家权力机构'
                    },
                    {
                        'id': 281111,
                        'name': '国家行政机构'
                    },
                    {
                        'id': 281112,
                        'name': '人民法院和人民检察院'
                    },
                    {
                        'id': 281113,
                        'name': '其他国家机构'
                    }
                ]
            },
            {
                'id': 2812,
                'name': '人民政协、民主党派',
                'children': [
                    {
                        'id': 281210,
                        'name': '人民政协'
                    },
                    {
                        'id': 281211,
                        'name': '民主党派'
                    }
                ]
            },
            {
                'id': 2813,
                'name': '社会保障',
                'children': [
                    {
                        'id': 281310,
                        'name': '基本保险'
                    },
                    {
                        'id': 281311,
                        'name': '补充保险'
                    },
                    {
                        'id': 281312,
                        'name': '其他社会保障'
                    }
                ]
            },
            {
                'id': 2814,
                'name': '群众团体、社会团体和其他成员组织',
                'children': [
                    {
                        'id': 281410,
                        'name': '群众团体'
                    },
                    {
                        'id': 281411,
                        'name': '社会团体'
                    },
                    {
                        'id': 281412,
                        'name': '基金会'
                    },
                    {
                        'id': 281413,
                        'name': '宗教组织'
                    }
                ]
            },
            {
                'id': 2815,
                'name': '基层群众自治组织及其他组织',
                'children': [
                    {
                        'id': 281510,
                        'name': '社区居民自治组织'
                    },
                    {
                        'id': 281511,
                        'name': '村民自治组织'
                    }
                ]
            }
        ]
    },
    {
        'id': 29,
        'name': '国际组织',
        'children': [
            {
                'id': 2910,
                'name': '国际组织',
                'children': [
                    {
                        'id': 291010,
                        'name': '国际组织'
                    }
                ]
            }
        ]
    }
];

export default industries;
