export default {
    license: {
        title: '知识共享协议',
        header1: '知识共享协议（Creative Commons license，下称“CC协议”）是一种公共著作权许可协议，zfoo所使用的为最新版本的',
        header2: 'CC协议4.0版本。',
        header3: '在CC协议下，作者主动放弃部分或者全部权利，允许任何人在特定条件下自由传播，复制，使用作品，并以此增加互联网文化乃至世界文化的创造性。',

        titlePart1: '1. CC协议背景',
        part11: '信息时代高速发展，我们经历过3G，4G和5G的时代，每一个时代都产生了巨大的数据量。根据',
        part12: 'IDC',
        part13: '在2018年发布的白皮书',
        part14: '《Data Age 2025》',
        part15: '，到2025年，每年将产生175ZB的数据，其中：',
        part16: '1TB（Terabyte）= 1024GB',
        part17: '1PB（Petabyte）= 1024TB',
        part18: '1EB（Exabyte）= 1024PB',
        part19: '1ZB（Zettabyte）= 1024EB',
        part110: '算下来大约1750亿TB的数据量，可以装满1750亿张1TB硬盘，普通人终其一生也看不完这一天。这么多的数据量使信息严重过载，' +
            '而著作权并不能保证如此之多的数据量，从而导致',
        part111: '著作权滥用，',
        part112: '著作权错误使用',
        part113: '的现象频频发生。在天量数据面前，著作权所保护的东西可谓是杯水车薪，所以我们越来越需要适合这个时代的CC协议。',

        titlePart2: '2. CC协议简介',
        part21: 'CC协议可以分为以下四个条款，每个条款对使用者有不同程度的限定。',
        part22: '如果用比较简洁的话来介绍如下：',
        part23: '署名（BY，Attribution） – 如果你使用了包含BY条款的作品，你必须在你的作品中的著名原作者，或者提供原作相关的链接，或者采用恰当的形式将原作的相关信息表述出来。',
        part24: '非商业使用（NC，Non-commercial） – 如果你使用了包含NC条款的作品，你不得将原作品或者你在原作品上再创作（二次开发）的作品用于商业目的。',
        part25: '禁止演绎（ND，No Derivative Works） –  如果你使用了包含ND条款的作品，你不得公开发布在原作品上再创作（二次开发）的作品，你只能全文转载或部分摘抄原作品的内容，不能对原作品作出任何改动。',
        part26: '相同方式共享（SA，Share-alike） – 如果你使用了包含SA条款的作品，并且你对原作品进行了再创作（二次开发），你必须以原作品相同的条款来发布你的创作。',

        titlePart3: '3. CC协议使用',
        part31: 'CC协议目前有以下7中组合使用方式，用户在zfoo所发表的时间片必须使用CC协议中的一种。',
        part32: '如果用比较简洁的话来介绍如下：',
        part33: 'CC0 – 放弃原作品的所有权，任何人都可以随意使用。',
        part34: 'BY – 放弃原作品的所有权，在署名（BY）的情况下，任何人都可以随意使用。',
        part35: 'BY-SA – 放弃原作品的所有权，在署名（BY）和相同方式共享（SA）的情况下，任何人都可以随意使用。',
        part36: 'BY-NC – 保留原作品的所有权，其他人有条件的使用，既必须署名（BY）和非商业使用（NC）。',
        part37: 'BY-NC-SA – 保留原作品的所有权，其他人有条件的使用，既必须署名（BY），非商业使用（NC）和相同方式共享（SA）。',
        part38: 'BY-ND – 保留原作品的所有权，其他人有条件的使用，既必须署名（BY）和禁止演绎（ND）。',
        part39: 'BY-NC-ND – 保留原作品的所有权，其他人有条件的使用，既必须署名（BY），非商业使用（NC）和禁止演绎（ND）。',
        part310: '需要注意CC协议是不可撤销的。这就意味着原作者即使停止对原作品使用CC协议，但是这不会对已流通的作品所关联的权利产生影响。' +
            '任何人在其违反原作品协议时将会丧失其拥有的权利，但是这不影响其他受权人继续使用原作品。当然，你也可以出于对许可人的尊重，遵循原作者的意愿停止使用原作品。',

        titlePart4: '4. CC协议在zfoo中的使用',
        part41: '为了方便，zfoo约定CC协议使用中的简称，CC0依然叫CC0，BY叫CC1，BY-SA叫CC2，BY-NC叫CC6，BY-NC-SA叫CC7，BY-ND叫CC8，BY-NC-ND叫CC9。',
        part42: '这些简称只是为了方便称呼和传播，其中CC0，CC1，CC2更有利于知识的自由创造和传播，zfoo鼓励并推荐这些协议。'
    }
};
