// 原始数据
const locations = [
    {
        'id': 100,
        'name': '中国',
        'children': [
            {
                'id': 10000,
                'name': '安徽省',
                'children': [
                    {
                        'id': 1000000,
                        'name': '合肥市'
                    },
                    {
                        'id': 1000001,
                        'name': '芜湖市'
                    },
                    {
                        'id': 1000002,
                        'name': '蚌埠市'
                    },
                    {
                        'id': 1000003,
                        'name': '淮南市'
                    },
                    {
                        'id': 1000004,
                        'name': '马鞍山市'
                    },
                    {
                        'id': 1000005,
                        'name': '淮北市'
                    },
                    {
                        'id': 1000006,
                        'name': '铜陵市'
                    },
                    {
                        'id': 1000007,
                        'name': '安庆市'
                    },
                    {
                        'id': 1000008,
                        'name': '黄山市'
                    },
                    {
                        'id': 1000009,
                        'name': '滁州市'
                    },
                    {
                        'id': 1000010,
                        'name': '阜阳市'
                    },
                    {
                        'id': 1000011,
                        'name': '宿州市'
                    },
                    {
                        'id': 1000012,
                        'name': '六安市'
                    },
                    {
                        'id': 1000013,
                        'name': '亳州市'
                    },
                    {
                        'id': 1000014,
                        'name': '池州市'
                    },
                    {
                        'id': 1000015,
                        'name': '宣城市'
                    }
                ]
            },
            {
                'id': 10001,
                'name': '北京市',
                'children': [
                    {
                        'id': 1000100,
                        'name': '东城区'
                    },
                    {
                        'id': 1000101,
                        'name': '西城区'
                    },
                    {
                        'id': 1000102,
                        'name': '朝阳区'
                    },
                    {
                        'id': 1000103,
                        'name': '丰台区'
                    },
                    {
                        'id': 1000104,
                        'name': '石景山区'
                    },
                    {
                        'id': 1000105,
                        'name': '海淀区'
                    },
                    {
                        'id': 1000106,
                        'name': '门头沟区'
                    },
                    {
                        'id': 1000107,
                        'name': '房山区'
                    },
                    {
                        'id': 1000108,
                        'name': '通州区'
                    },
                    {
                        'id': 1000109,
                        'name': '顺义区'
                    },
                    {
                        'id': 1000110,
                        'name': '昌平区'
                    },
                    {
                        'id': 1000111,
                        'name': '大兴区'
                    },
                    {
                        'id': 1000112,
                        'name': '怀柔区'
                    },
                    {
                        'id': 1000113,
                        'name': '平谷区'
                    },
                    {
                        'id': 1000114,
                        'name': '密云区'
                    },
                    {
                        'id': 1000115,
                        'name': '延庆区'
                    }
                ]
            },
            {
                'id': 10002,
                'name': '重庆市',
                'children': [
                    {
                        'id': 1000200,
                        'name': '万州区'
                    },
                    {
                        'id': 1000201,
                        'name': '涪陵区'
                    },
                    {
                        'id': 1000202,
                        'name': '渝中区'
                    },
                    {
                        'id': 1000203,
                        'name': '大渡口区'
                    },
                    {
                        'id': 1000204,
                        'name': '江北区'
                    },
                    {
                        'id': 1000205,
                        'name': '沙坪坝区'
                    },
                    {
                        'id': 1000206,
                        'name': '九龙坡区'
                    },
                    {
                        'id': 1000207,
                        'name': '南岸区'
                    },
                    {
                        'id': 1000208,
                        'name': '北碚区'
                    },
                    {
                        'id': 1000209,
                        'name': '綦江区'
                    },
                    {
                        'id': 1000210,
                        'name': '大足区'
                    },
                    {
                        'id': 1000211,
                        'name': '渝北区'
                    },
                    {
                        'id': 1000212,
                        'name': '巴南区'
                    },
                    {
                        'id': 1000213,
                        'name': '黔江区'
                    },
                    {
                        'id': 1000214,
                        'name': '长寿区'
                    },
                    {
                        'id': 1000215,
                        'name': '江津区'
                    },
                    {
                        'id': 1000216,
                        'name': '合川区'
                    },
                    {
                        'id': 1000217,
                        'name': '永川区'
                    },
                    {
                        'id': 1000218,
                        'name': '南川区'
                    },
                    {
                        'id': 1000219,
                        'name': '璧山区'
                    },
                    {
                        'id': 1000220,
                        'name': '铜梁区'
                    },
                    {
                        'id': 1000221,
                        'name': '潼南区'
                    },
                    {
                        'id': 1000222,
                        'name': '荣昌区'
                    },
                    {
                        'id': 1000223,
                        'name': '梁平区'
                    },
                    {
                        'id': 1000224,
                        'name': '武隆区'
                    },
                    {
                        'id': 1000225,
                        'name': '开州区'
                    },
                    {
                        'id': 1000226,
                        'name': '城口县'
                    },
                    {
                        'id': 1000227,
                        'name': '丰都县'
                    },
                    {
                        'id': 1000228,
                        'name': '垫江县'
                    },
                    {
                        'id': 1000229,
                        'name': '忠县'
                    },
                    {
                        'id': 1000230,
                        'name': '云阳县'
                    },
                    {
                        'id': 1000231,
                        'name': '奉节县'
                    },
                    {
                        'id': 1000232,
                        'name': '巫山县'
                    },
                    {
                        'id': 1000233,
                        'name': '巫溪县'
                    },
                    {
                        'id': 1000234,
                        'name': '石柱土家族自治县'
                    },
                    {
                        'id': 1000235,
                        'name': '秀山土家族苗族自治县'
                    },
                    {
                        'id': 1000236,
                        'name': '酉阳土家族苗族自治县'
                    },
                    {
                        'id': 1000237,
                        'name': '彭水苗族土家族自治县'
                    }
                ]
            },
            {
                'id': 10003,
                'name': '福建省',
                'children': [
                    {
                        'id': 1000300,
                        'name': '福州市'
                    },
                    {
                        'id': 1000301,
                        'name': '厦门市'
                    },
                    {
                        'id': 1000302,
                        'name': '莆田市'
                    },
                    {
                        'id': 1000303,
                        'name': '三明市'
                    },
                    {
                        'id': 1000304,
                        'name': '泉州市'
                    },
                    {
                        'id': 1000305,
                        'name': '漳州市'
                    },
                    {
                        'id': 1000306,
                        'name': '南平市'
                    },
                    {
                        'id': 1000307,
                        'name': '龙岩市'
                    },
                    {
                        'id': 1000308,
                        'name': '宁德市'
                    },
                    {
                        'id': 1000309,
                        'name': '平潭综合实验区'
                    }
                ]
            },
            {
                'id': 10004,
                'name': '甘肃省',
                'children': [
                    {
                        'id': 1000400,
                        'name': '兰州市'
                    },
                    {
                        'id': 1000401,
                        'name': '嘉峪关市'
                    },
                    {
                        'id': 1000402,
                        'name': '金昌市'
                    },
                    {
                        'id': 1000403,
                        'name': '白银市'
                    },
                    {
                        'id': 1000404,
                        'name': '天水市'
                    },
                    {
                        'id': 1000405,
                        'name': '武威市'
                    },
                    {
                        'id': 1000406,
                        'name': '张掖市'
                    },
                    {
                        'id': 1000407,
                        'name': '平凉市'
                    },
                    {
                        'id': 1000408,
                        'name': '酒泉市'
                    },
                    {
                        'id': 1000409,
                        'name': '庆阳市'
                    },
                    {
                        'id': 1000410,
                        'name': '定西市'
                    },
                    {
                        'id': 1000411,
                        'name': '陇南市'
                    },
                    {
                        'id': 1000412,
                        'name': '临夏回族自治州'
                    },
                    {
                        'id': 1000413,
                        'name': '甘南藏族自治州'
                    }
                ]
            },
            {
                'id': 10005,
                'name': '广东省',
                'children': [
                    {
                        'id': 1000500,
                        'name': '广州市'
                    },
                    {
                        'id': 1000501,
                        'name': '韶关市'
                    },
                    {
                        'id': 1000502,
                        'name': '珠海市'
                    },
                    {
                        'id': 1000503,
                        'name': '汕头市'
                    },
                    {
                        'id': 1000504,
                        'name': '佛山市'
                    },
                    {
                        'id': 1000505,
                        'name': '江门市'
                    },
                    {
                        'id': 1000506,
                        'name': '湛江市'
                    },
                    {
                        'id': 1000507,
                        'name': '茂名市'
                    },
                    {
                        'id': 1000508,
                        'name': '肇庆市'
                    },
                    {
                        'id': 1000509,
                        'name': '惠州市'
                    },
                    {
                        'id': 1000510,
                        'name': '梅州市'
                    },
                    {
                        'id': 1000511,
                        'name': '汕尾市'
                    },
                    {
                        'id': 1000512,
                        'name': '河源市'
                    },
                    {
                        'id': 1000513,
                        'name': '阳江市'
                    },
                    {
                        'id': 1000514,
                        'name': '清远市'
                    },
                    {
                        'id': 1000515,
                        'name': '东莞市'
                    },
                    {
                        'id': 1000516,
                        'name': '中山市'
                    },
                    {
                        'id': 1000517,
                        'name': '潮州市'
                    },
                    {
                        'id': 1000518,
                        'name': '揭阳市'
                    },
                    {
                        'id': 1000519,
                        'name': '云浮市'
                    }
                ]
            },
            {
                'id': 10006,
                'name': '广西省',
                'children': [
                    {
                        'id': 1000600,
                        'name': '南宁市'
                    },
                    {
                        'id': 1000601,
                        'name': '柳州市'
                    },
                    {
                        'id': 1000602,
                        'name': '桂林市'
                    },
                    {
                        'id': 1000603,
                        'name': '梧州市'
                    },
                    {
                        'id': 1000604,
                        'name': '北海市'
                    },
                    {
                        'id': 1000605,
                        'name': '防城港市'
                    },
                    {
                        'id': 1000606,
                        'name': '钦州市'
                    },
                    {
                        'id': 1000607,
                        'name': '贵港市'
                    },
                    {
                        'id': 1000608,
                        'name': '玉林市'
                    },
                    {
                        'id': 1000609,
                        'name': '百色市'
                    },
                    {
                        'id': 1000610,
                        'name': '贺州市'
                    },
                    {
                        'id': 1000611,
                        'name': '河池市'
                    },
                    {
                        'id': 1000612,
                        'name': '来宾市'
                    },
                    {
                        'id': 1000613,
                        'name': '崇左市'
                    }
                ]
            },
            {
                'id': 10007,
                'name': '贵州省',
                'children': [
                    {
                        'id': 1000700,
                        'name': '贵阳市'
                    },
                    {
                        'id': 1000701,
                        'name': '六盘水市'
                    },
                    {
                        'id': 1000702,
                        'name': '遵义市'
                    },
                    {
                        'id': 1000703,
                        'name': '安顺市'
                    },
                    {
                        'id': 1000704,
                        'name': '毕节市'
                    },
                    {
                        'id': 1000705,
                        'name': '铜仁市'
                    },
                    {
                        'id': 1000706,
                        'name': '黔西南布依族苗族自治州'
                    },
                    {
                        'id': 1000707,
                        'name': '黔东南苗族侗族自治州'
                    },
                    {
                        'id': 1000708,
                        'name': '黔南布依族苗族自治州'
                    }
                ]
            },
            {
                'id': 10008,
                'name': '海南省',
                'children': [
                    {
                        'id': 1000800,
                        'name': '海口市'
                    },
                    {
                        'id': 1000801,
                        'name': '三亚市'
                    },
                    {
                        'id': 1000802,
                        'name': '三沙市'
                    },
                    {
                        'id': 1000803,
                        'name': '儋州市'
                    },
                    {
                        'id': 1000804,
                        'name': '洋浦经济开发区'
                    },
                    {
                        'id': 1000805,
                        'name': '海南省直辖县级行政区划'
                    }
                ]
            },
            {
                'id': 10009,
                'name': '河北省',
                'children': [
                    {
                        'id': 1000900,
                        'name': '石家庄市'
                    },
                    {
                        'id': 1000901,
                        'name': '唐山市'
                    },
                    {
                        'id': 1000902,
                        'name': '秦皇岛市'
                    },
                    {
                        'id': 1000903,
                        'name': '邯郸市'
                    },
                    {
                        'id': 1000904,
                        'name': '邢台市'
                    },
                    {
                        'id': 1000905,
                        'name': '保定市'
                    },
                    {
                        'id': 1000906,
                        'name': '张家口市'
                    },
                    {
                        'id': 1000907,
                        'name': '承德市'
                    },
                    {
                        'id': 1000908,
                        'name': '沧州市'
                    },
                    {
                        'id': 1000909,
                        'name': '廊坊市'
                    },
                    {
                        'id': 1000910,
                        'name': '衡水市'
                    }
                ]
            },
            {
                'id': 10010,
                'name': '河南省',
                'children': [
                    {
                        'id': 1001000,
                        'name': '郑州市'
                    },
                    {
                        'id': 1001001,
                        'name': '开封市'
                    },
                    {
                        'id': 1001002,
                        'name': '洛阳市'
                    },
                    {
                        'id': 1001003,
                        'name': '平顶山市'
                    },
                    {
                        'id': 1001004,
                        'name': '安阳市'
                    },
                    {
                        'id': 1001005,
                        'name': '鹤壁市'
                    },
                    {
                        'id': 1001006,
                        'name': '新乡市'
                    },
                    {
                        'id': 1001007,
                        'name': '焦作市'
                    },
                    {
                        'id': 1001008,
                        'name': '濮阳市'
                    },
                    {
                        'id': 1001009,
                        'name': '许昌市'
                    },
                    {
                        'id': 1001010,
                        'name': '漯河市'
                    },
                    {
                        'id': 1001011,
                        'name': '三门峡市'
                    },
                    {
                        'id': 1001012,
                        'name': '南阳市'
                    },
                    {
                        'id': 1001013,
                        'name': '商丘市'
                    },
                    {
                        'id': 1001014,
                        'name': '信阳市'
                    },
                    {
                        'id': 1001015,
                        'name': '周口市'
                    },
                    {
                        'id': 1001016,
                        'name': '驻马店市'
                    },
                    {
                        'id': 1001017,
                        'name': '河南省直辖县级行政区划'
                    }
                ]
            },
            {
                'id': 10011,
                'name': '黑龙江省',
                'children': [
                    {
                        'id': 1001100,
                        'name': '哈尔滨市'
                    },
                    {
                        'id': 1001101,
                        'name': '齐齐哈尔市'
                    },
                    {
                        'id': 1001102,
                        'name': '鸡西市'
                    },
                    {
                        'id': 1001103,
                        'name': '鹤岗市'
                    },
                    {
                        'id': 1001104,
                        'name': '双鸭山市'
                    },
                    {
                        'id': 1001105,
                        'name': '大庆市'
                    },
                    {
                        'id': 1001106,
                        'name': '伊春市'
                    },
                    {
                        'id': 1001107,
                        'name': '佳木斯市'
                    },
                    {
                        'id': 1001108,
                        'name': '七台河市'
                    },
                    {
                        'id': 1001109,
                        'name': '牡丹江市'
                    },
                    {
                        'id': 1001110,
                        'name': '黑河市'
                    },
                    {
                        'id': 1001111,
                        'name': '绥化市'
                    },
                    {
                        'id': 1001112,
                        'name': '大兴安岭地区'
                    }
                ]
            },
            {
                'id': 10012,
                'name': '湖北省',
                'children': [
                    {
                        'id': 1001200,
                        'name': '武汉市'
                    },
                    {
                        'id': 1001201,
                        'name': '黄石市'
                    },
                    {
                        'id': 1001202,
                        'name': '十堰市'
                    },
                    {
                        'id': 1001203,
                        'name': '宜昌市'
                    },
                    {
                        'id': 1001204,
                        'name': '襄阳市'
                    },
                    {
                        'id': 1001205,
                        'name': '鄂州市'
                    },
                    {
                        'id': 1001206,
                        'name': '荆门市'
                    },
                    {
                        'id': 1001207,
                        'name': '孝感市'
                    },
                    {
                        'id': 1001208,
                        'name': '荆州市'
                    },
                    {
                        'id': 1001209,
                        'name': '黄冈市'
                    },
                    {
                        'id': 1001210,
                        'name': '咸宁市'
                    },
                    {
                        'id': 1001211,
                        'name': '随州市'
                    },
                    {
                        'id': 1001212,
                        'name': '恩施土家族苗族自治州'
                    },
                    {
                        'id': 1001213,
                        'name': '湖北省直辖县级行政区划'
                    }
                ]
            },
            {
                'id': 10013,
                'name': '湖南省',
                'children': [
                    {
                        'id': 1001300,
                        'name': '长沙市'
                    },
                    {
                        'id': 1001301,
                        'name': '株洲市'
                    },
                    {
                        'id': 1001302,
                        'name': '湘潭市'
                    },
                    {
                        'id': 1001303,
                        'name': '衡阳市'
                    },
                    {
                        'id': 1001304,
                        'name': '邵阳市'
                    },
                    {
                        'id': 1001305,
                        'name': '岳阳市'
                    },
                    {
                        'id': 1001306,
                        'name': '常德市'
                    },
                    {
                        'id': 1001307,
                        'name': '张家界市'
                    },
                    {
                        'id': 1001308,
                        'name': '益阳市'
                    },
                    {
                        'id': 1001309,
                        'name': '郴州市'
                    },
                    {
                        'id': 1001310,
                        'name': '永州市'
                    },
                    {
                        'id': 1001311,
                        'name': '怀化市'
                    },
                    {
                        'id': 1001312,
                        'name': '娄底市'
                    },
                    {
                        'id': 1001313,
                        'name': '湘西土家族苗族自治州'
                    }
                ]
            },
            {
                'id': 10014,
                'name': '吉林省',
                'children': [
                    {
                        'id': 1001400,
                        'name': '长春市'
                    },
                    {
                        'id': 1001401,
                        'name': '吉林市'
                    },
                    {
                        'id': 1001402,
                        'name': '四平市'
                    },
                    {
                        'id': 1001403,
                        'name': '辽源市'
                    },
                    {
                        'id': 1001404,
                        'name': '通化市'
                    },
                    {
                        'id': 1001405,
                        'name': '白山市'
                    },
                    {
                        'id': 1001406,
                        'name': '松原市'
                    },
                    {
                        'id': 1001407,
                        'name': '白城市'
                    },
                    {
                        'id': 1001408,
                        'name': '延边朝鲜族自治州'
                    }
                ]
            },
            {
                'id': 10015,
                'name': '江苏省',
                'children': [
                    {
                        'id': 1001500,
                        'name': '南京市'
                    },
                    {
                        'id': 1001501,
                        'name': '无锡市'
                    },
                    {
                        'id': 1001502,
                        'name': '徐州市'
                    },
                    {
                        'id': 1001503,
                        'name': '常州市'
                    },
                    {
                        'id': 1001504,
                        'name': '苏州市'
                    },
                    {
                        'id': 1001505,
                        'name': '南通市'
                    },
                    {
                        'id': 1001506,
                        'name': '连云港市'
                    },
                    {
                        'id': 1001507,
                        'name': '淮安市'
                    },
                    {
                        'id': 1001508,
                        'name': '盐城市'
                    },
                    {
                        'id': 1001509,
                        'name': '扬州市'
                    },
                    {
                        'id': 1001510,
                        'name': '镇江市'
                    },
                    {
                        'id': 1001511,
                        'name': '泰州市'
                    },
                    {
                        'id': 1001512,
                        'name': '宿迁市'
                    }
                ]
            },
            {
                'id': 10016,
                'name': '江西省',
                'children': [
                    {
                        'id': 1001600,
                        'name': '南昌市'
                    },
                    {
                        'id': 1001601,
                        'name': '景德镇市'
                    },
                    {
                        'id': 1001602,
                        'name': '萍乡市'
                    },
                    {
                        'id': 1001603,
                        'name': '九江市'
                    },
                    {
                        'id': 1001604,
                        'name': '新余市'
                    },
                    {
                        'id': 1001605,
                        'name': '鹰潭市'
                    },
                    {
                        'id': 1001606,
                        'name': '赣州市'
                    },
                    {
                        'id': 1001607,
                        'name': '吉安市'
                    },
                    {
                        'id': 1001608,
                        'name': '宜春市'
                    },
                    {
                        'id': 1001609,
                        'name': '抚州市'
                    },
                    {
                        'id': 1001610,
                        'name': '上饶市'
                    }
                ]
            },
            {
                'id': 10017,
                'name': '辽宁省',
                'children': [
                    {
                        'id': 1001700,
                        'name': '沈阳市'
                    },
                    {
                        'id': 1001701,
                        'name': '大连市'
                    },
                    {
                        'id': 1001702,
                        'name': '鞍山市'
                    },
                    {
                        'id': 1001703,
                        'name': '抚顺市'
                    },
                    {
                        'id': 1001704,
                        'name': '本溪市'
                    },
                    {
                        'id': 1001705,
                        'name': '丹东市'
                    },
                    {
                        'id': 1001706,
                        'name': '锦州市'
                    },
                    {
                        'id': 1001707,
                        'name': '营口市'
                    },
                    {
                        'id': 1001708,
                        'name': '阜新市'
                    },
                    {
                        'id': 1001709,
                        'name': '辽阳市'
                    },
                    {
                        'id': 1001710,
                        'name': '盘锦市'
                    },
                    {
                        'id': 1001711,
                        'name': '铁岭市'
                    },
                    {
                        'id': 1001712,
                        'name': '朝阳市'
                    },
                    {
                        'id': 1001713,
                        'name': '葫芦岛市'
                    }
                ]
            },
            {
                'id': 10018,
                'name': '内蒙古',
                'children': [
                    {
                        'id': 1001800,
                        'name': '呼和浩特市'
                    },
                    {
                        'id': 1001801,
                        'name': '包头市'
                    },
                    {
                        'id': 1001802,
                        'name': '乌海市'
                    },
                    {
                        'id': 1001803,
                        'name': '赤峰市'
                    },
                    {
                        'id': 1001804,
                        'name': '通辽市'
                    },
                    {
                        'id': 1001805,
                        'name': '鄂尔多斯市'
                    },
                    {
                        'id': 1001806,
                        'name': '呼伦贝尔市'
                    },
                    {
                        'id': 1001807,
                        'name': '巴彦淖尔市'
                    },
                    {
                        'id': 1001808,
                        'name': '乌兰察布市'
                    },
                    {
                        'id': 1001809,
                        'name': '满洲里市'
                    },
                    {
                        'id': 1001810,
                        'name': '二连浩特市'
                    },
                    {
                        'id': 1001811,
                        'name': '兴安盟'
                    },
                    {
                        'id': 1001812,
                        'name': '锡林郭勒盟'
                    },
                    {
                        'id': 1001813,
                        'name': '阿拉善盟'
                    }
                ]
            },
            {
                'id': 10019,
                'name': '宁夏',
                'children': [
                    {
                        'id': 1001900,
                        'name': '银川市'
                    },
                    {
                        'id': 1001901,
                        'name': '石嘴山市'
                    },
                    {
                        'id': 1001902,
                        'name': '吴忠市'
                    },
                    {
                        'id': 1001903,
                        'name': '固原市'
                    },
                    {
                        'id': 1001904,
                        'name': '中卫市'
                    }
                ]
            },
            {
                'id': 10020,
                'name': '青海省',
                'children': [
                    {
                        'id': 1002000,
                        'name': '西宁市'
                    },
                    {
                        'id': 1002001,
                        'name': '海东市'
                    },
                    {
                        'id': 1002002,
                        'name': '海北藏族自治州'
                    },
                    {
                        'id': 1002003,
                        'name': '黄南藏族自治州'
                    },
                    {
                        'id': 1002004,
                        'name': '海南藏族自治州'
                    },
                    {
                        'id': 1002005,
                        'name': '果洛藏族自治州'
                    },
                    {
                        'id': 1002006,
                        'name': '玉树藏族自治州'
                    },
                    {
                        'id': 1002007,
                        'name': '海西蒙古族藏族自治州'
                    }
                ]
            },
            {
                'id': 10021,
                'name': '陕西省',
                'children': [
                    {
                        'id': 1002100,
                        'name': '西安市'
                    },
                    {
                        'id': 1002101,
                        'name': '铜川市'
                    },
                    {
                        'id': 1002102,
                        'name': '宝鸡市'
                    },
                    {
                        'id': 1002103,
                        'name': '咸阳市'
                    },
                    {
                        'id': 1002104,
                        'name': '渭南市'
                    },
                    {
                        'id': 1002105,
                        'name': '延安市'
                    },
                    {
                        'id': 1002106,
                        'name': '汉中市'
                    },
                    {
                        'id': 1002107,
                        'name': '榆林市'
                    },
                    {
                        'id': 1002108,
                        'name': '安康市'
                    },
                    {
                        'id': 1002109,
                        'name': '商洛市'
                    }
                ]
            },
            {
                'id': 10022,
                'name': '山东省',
                'children': [
                    {
                        'id': 1002200,
                        'name': '济南市'
                    },
                    {
                        'id': 1002201,
                        'name': '青岛市'
                    },
                    {
                        'id': 1002202,
                        'name': '淄博市'
                    },
                    {
                        'id': 1002203,
                        'name': '枣庄市'
                    },
                    {
                        'id': 1002204,
                        'name': '东营市'
                    },
                    {
                        'id': 1002205,
                        'name': '烟台市'
                    },
                    {
                        'id': 1002206,
                        'name': '潍坊市'
                    },
                    {
                        'id': 1002207,
                        'name': '济宁市'
                    },
                    {
                        'id': 1002208,
                        'name': '泰安市'
                    },
                    {
                        'id': 1002209,
                        'name': '威海市'
                    },
                    {
                        'id': 1002210,
                        'name': '日照市'
                    },
                    {
                        'id': 1002211,
                        'name': '临沂市'
                    },
                    {
                        'id': 1002212,
                        'name': '德州市'
                    },
                    {
                        'id': 1002213,
                        'name': '聊城市'
                    },
                    {
                        'id': 1002214,
                        'name': '滨州市'
                    },
                    {
                        'id': 1002215,
                        'name': '菏泽市'
                    }
                ]
            },
            {
                'id': 10023,
                'name': '山西省',
                'children': [
                    {
                        'id': 1002300,
                        'name': '太原市'
                    },
                    {
                        'id': 1002301,
                        'name': '大同市'
                    },
                    {
                        'id': 1002302,
                        'name': '阳泉市'
                    },
                    {
                        'id': 1002303,
                        'name': '长治市'
                    },
                    {
                        'id': 1002304,
                        'name': '晋城市'
                    },
                    {
                        'id': 1002305,
                        'name': '朔州市'
                    },
                    {
                        'id': 1002306,
                        'name': '晋中市'
                    },
                    {
                        'id': 1002307,
                        'name': '运城市'
                    },
                    {
                        'id': 1002308,
                        'name': '忻州市'
                    },
                    {
                        'id': 1002309,
                        'name': '临汾市'
                    },
                    {
                        'id': 1002310,
                        'name': '吕梁市'
                    }
                ]
            },
            {
                'id': 10024,
                'name': '上海市',
                'children': [
                    {
                        'id': 1002400,
                        'name': '黄浦区'
                    },
                    {
                        'id': 1002401,
                        'name': '徐汇区'
                    },
                    {
                        'id': 1002402,
                        'name': '长宁区'
                    },
                    {
                        'id': 1002403,
                        'name': '静安区'
                    },
                    {
                        'id': 1002404,
                        'name': '普陀区'
                    },
                    {
                        'id': 1002405,
                        'name': '虹口区'
                    },
                    {
                        'id': 1002406,
                        'name': '杨浦区'
                    },
                    {
                        'id': 1002407,
                        'name': '闵行区'
                    },
                    {
                        'id': 1002408,
                        'name': '宝山区'
                    },
                    {
                        'id': 1002409,
                        'name': '嘉定区'
                    },
                    {
                        'id': 1002410,
                        'name': '浦东新区'
                    },
                    {
                        'id': 1002411,
                        'name': '金山区'
                    },
                    {
                        'id': 1002412,
                        'name': '松江区'
                    },
                    {
                        'id': 1002413,
                        'name': '青浦区'
                    },
                    {
                        'id': 1002414,
                        'name': '奉贤区'
                    },
                    {
                        'id': 1002415,
                        'name': '崇明区'
                    }
                ]
            },
            {
                'id': 10025,
                'name': '深圳市'
            },
            {
                'id': 10026,
                'name': '四川省',
                'children': [
                    {
                        'id': 1002600,
                        'name': '成都市'
                    },
                    {
                        'id': 1002601,
                        'name': '自贡市'
                    },
                    {
                        'id': 1002602,
                        'name': '攀枝花市'
                    },
                    {
                        'id': 1002603,
                        'name': '泸州市'
                    },
                    {
                        'id': 1002604,
                        'name': '德阳市'
                    },
                    {
                        'id': 1002605,
                        'name': '绵阳市'
                    },
                    {
                        'id': 1002606,
                        'name': '广元市'
                    },
                    {
                        'id': 1002607,
                        'name': '遂宁市'
                    },
                    {
                        'id': 1002608,
                        'name': '内江市'
                    },
                    {
                        'id': 1002609,
                        'name': '乐山市'
                    },
                    {
                        'id': 1002610,
                        'name': '南充市'
                    },
                    {
                        'id': 1002611,
                        'name': '眉山市'
                    },
                    {
                        'id': 1002612,
                        'name': '宜宾市'
                    },
                    {
                        'id': 1002613,
                        'name': '广安市'
                    },
                    {
                        'id': 1002614,
                        'name': '达州市'
                    },
                    {
                        'id': 1002615,
                        'name': '雅安市'
                    },
                    {
                        'id': 1002616,
                        'name': '巴中市'
                    },
                    {
                        'id': 1002617,
                        'name': '资阳市'
                    },
                    {
                        'id': 1002618,
                        'name': '阿坝藏族羌族自治州'
                    },
                    {
                        'id': 1002619,
                        'name': '甘孜藏族自治州'
                    },
                    {
                        'id': 1002620,
                        'name': '凉山彝族自治州'
                    }
                ]
            },
            {
                'id': 10027,
                'name': '天津市',
                'children': [
                    {
                        'id': 1002700,
                        'name': '和平区'
                    },
                    {
                        'id': 1002701,
                        'name': '河东区'
                    },
                    {
                        'id': 1002702,
                        'name': '河西区'
                    },
                    {
                        'id': 1002703,
                        'name': '南开区'
                    },
                    {
                        'id': 1002704,
                        'name': '河北区'
                    },
                    {
                        'id': 1002705,
                        'name': '红桥区'
                    },
                    {
                        'id': 1002706,
                        'name': '东丽区'
                    },
                    {
                        'id': 1002707,
                        'name': '西青区'
                    },
                    {
                        'id': 1002708,
                        'name': '津南区'
                    },
                    {
                        'id': 1002709,
                        'name': '北辰区'
                    },
                    {
                        'id': 1002710,
                        'name': '武清区'
                    },
                    {
                        'id': 1002711,
                        'name': '宝坻区'
                    },
                    {
                        'id': 1002712,
                        'name': '滨海新区'
                    },
                    {
                        'id': 1002713,
                        'name': '宁河区'
                    },
                    {
                        'id': 1002714,
                        'name': '静海区'
                    },
                    {
                        'id': 1002715,
                        'name': '蓟州区'
                    }
                ]
            },
            {
                'id': 10028,
                'name': '西藏',
                'children': [
                    {
                        'id': 1002800,
                        'name': '拉萨市'
                    },
                    {
                        'id': 1002801,
                        'name': '日喀则市'
                    },
                    {
                        'id': 1002802,
                        'name': '昌都市'
                    },
                    {
                        'id': 1002803,
                        'name': '山南市'
                    },
                    {
                        'id': 1002804,
                        'name': '那曲市'
                    },
                    {
                        'id': 1002805,
                        'name': '林芝市'
                    },
                    {
                        'id': 1002806,
                        'name': '阿里地区'
                    }
                ]
            },
            {
                'id': 10029,
                'name': '新疆',
                'children': [
                    {
                        'id': 1002900,
                        'name': '乌鲁木齐市'
                    },
                    {
                        'id': 1002901,
                        'name': '克拉玛依市'
                    },
                    {
                        'id': 1002902,
                        'name': '吐鲁番市'
                    },
                    {
                        'id': 1002903,
                        'name': '哈密市'
                    },
                    {
                        'id': 1002904,
                        'name': '昌吉回族自治州'
                    },
                    {
                        'id': 1002905,
                        'name': '博尔塔拉蒙古自治州'
                    },
                    {
                        'id': 1002906,
                        'name': '巴音郭楞蒙古自治州'
                    },
                    {
                        'id': 1002907,
                        'name': '阿克苏地区'
                    },
                    {
                        'id': 1002908,
                        'name': '克孜勒苏柯尔克孜自治州'
                    },
                    {
                        'id': 1002909,
                        'name': '喀什地区'
                    },
                    {
                        'id': 1002910,
                        'name': '和田地区'
                    },
                    {
                        'id': 1002911,
                        'name': '伊犁哈萨克自治州'
                    },
                    {
                        'id': 1002912,
                        'name': '塔城地区'
                    },
                    {
                        'id': 1002913,
                        'name': '阿勒泰地区'
                    },
                    {
                        'id': 1002914,
                        'name': '自治区直辖县级行政区划'
                    }
                ]
            },
            {
                'id': 10030,
                'name': '云南省',
                'children': [
                    {
                        'id': 1003000,
                        'name': '昆明市'
                    },
                    {
                        'id': 1003001,
                        'name': '曲靖市'
                    },
                    {
                        'id': 1003002,
                        'name': '玉溪市'
                    },
                    {
                        'id': 1003003,
                        'name': '保山市'
                    },
                    {
                        'id': 1003004,
                        'name': '昭通市'
                    },
                    {
                        'id': 1003005,
                        'name': '丽江市'
                    },
                    {
                        'id': 1003006,
                        'name': '普洱市'
                    },
                    {
                        'id': 1003007,
                        'name': '临沧市'
                    },
                    {
                        'id': 1003008,
                        'name': '楚雄彝族自治州'
                    },
                    {
                        'id': 1003009,
                        'name': '红河哈尼族彝族自治州'
                    },
                    {
                        'id': 1003010,
                        'name': '文山壮族苗族自治州'
                    },
                    {
                        'id': 1003011,
                        'name': '西双版纳傣族自治州'
                    },
                    {
                        'id': 1003012,
                        'name': '大理白族自治州'
                    },
                    {
                        'id': 1003013,
                        'name': '德宏傣族景颇族自治州'
                    },
                    {
                        'id': 1003014,
                        'name': '怒江傈僳族自治州'
                    },
                    {
                        'id': 1003015,
                        'name': '迪庆藏族自治州'
                    }
                ]
            },
            {
                'id': 10031,
                'name': '浙江省',
                'children': [
                    {
                        'id': 1003100,
                        'name': '杭州市'
                    },
                    {
                        'id': 1003101,
                        'name': '宁波市'
                    },
                    {
                        'id': 1003102,
                        'name': '温州市'
                    },
                    {
                        'id': 1003103,
                        'name': '嘉兴市'
                    },
                    {
                        'id': 1003104,
                        'name': '湖州市'
                    },
                    {
                        'id': 1003105,
                        'name': '绍兴市'
                    },
                    {
                        'id': 1003106,
                        'name': '金华市'
                    },
                    {
                        'id': 1003107,
                        'name': '衢州市'
                    },
                    {
                        'id': 1003108,
                        'name': '舟山市'
                    },
                    {
                        'id': 1003109,
                        'name': '台州市'
                    },
                    {
                        'id': 1003110,
                        'name': '丽水市'
                    }
                ]
            },
            {
                'id': 10032,
                'name': '香港'
            },
            {
                'id': 10033,
                'name': '澳门'
            },
            {
                'id': 10034,
                'name': '台湾'
            }
        ]
    },
    {
        'id': 101,
        'name': '德国',
        'children': [
            {
                'id': 10100,
                'name': '阿恩斯贝格'
            },
            {
                'id': 10101,
                'name': '爱尔福特'
            },
            {
                'id': 10102,
                'name': '安斯巴格'
            },
            {
                'id': 10103,
                'name': '奥格斯堡'
            },
            {
                'id': 10104,
                'name': '柏林'
            },
            {
                'id': 10105,
                'name': '拜伊罗特'
            },
            {
                'id': 10106,
                'name': '比勒费尔德'
            },
            {
                'id': 10107,
                'name': '波茨坦'
            },
            {
                'id': 10108,
                'name': '波鸿'
            },
            {
                'id': 10109,
                'name': '不来梅'
            },
            {
                'id': 10110,
                'name': '不伦瑞克'
            },
            {
                'id': 10111,
                'name': '达姆施塔特'
            },
            {
                'id': 10112,
                'name': '代特莫尔特'
            },
            {
                'id': 10113,
                'name': '德累斯顿'
            },
            {
                'id': 10114,
                'name': '德绍'
            },
            {
                'id': 10115,
                'name': '杜塞尔多夫'
            },
            {
                'id': 10116,
                'name': '法兰克福'
            },
            {
                'id': 10117,
                'name': '弗赖堡'
            },
            {
                'id': 10118,
                'name': '哈雷'
            },
            {
                'id': 10119,
                'name': '汉堡'
            },
            {
                'id': 10120,
                'name': '汉诺威'
            },
            {
                'id': 10121,
                'name': '基尔'
            },
            {
                'id': 10122,
                'name': '吉森'
            },
            {
                'id': 10123,
                'name': '卡尔斯鲁厄'
            },
            {
                'id': 10124,
                'name': '卡塞尔'
            },
            {
                'id': 10125,
                'name': '开姆尼斯'
            },
            {
                'id': 10126,
                'name': '科布伦次'
            },
            {
                'id': 10127,
                'name': '德国·科隆'
            },
            {
                'id': 10128,
                'name': '莱比锡'
            },
            {
                'id': 10129,
                'name': '兰茨胡特'
            },
            {
                'id': 10130,
                'name': '吕讷堡'
            },
            {
                'id': 10131,
                'name': '马格德堡'
            },
            {
                'id': 10132,
                'name': '曼海姆'
            },
            {
                'id': 10133,
                'name': '美因兹'
            },
            {
                'id': 10134,
                'name': '明斯特'
            },
            {
                'id': 10135,
                'name': '慕尼黑'
            },
            {
                'id': 10136,
                'name': '纽伦堡'
            },
            {
                'id': 10137,
                'name': '什未林'
            },
            {
                'id': 10138,
                'name': '斯图加特'
            },
            {
                'id': 10139,
                'name': '特里尔'
            },
            {
                'id': 10140,
                'name': '威斯巴登'
            },
            {
                'id': 10141,
                'name': '维尔茨堡'
            }
        ]
    },
    {
        'id': 102,
        'name': '法国',
        'children': [
            {
                'id': 10200,
                'name': '阿尔勒'
            },
            {
                'id': 10201,
                'name': '阿雅克修'
            },
            {
                'id': 10202,
                'name': '艾克斯'
            },
            {
                'id': 10203,
                'name': '奥尔良'
            },
            {
                'id': 10204,
                'name': '巴黎'
            },
            {
                'id': 10205,
                'name': '贝桑松'
            },
            {
                'id': 10206,
                'name': '第戎'
            },
            {
                'id': 10207,
                'name': '弗雷瑞斯'
            },
            {
                'id': 10208,
                'name': '卡昂'
            },
            {
                'id': 10209,
                'name': '雷恩'
            },
            {
                'id': 10210,
                'name': '里昂'
            },
            {
                'id': 10211,
                'name': '里尔'
            },
            {
                'id': 10212,
                'name': '利摩日'
            },
            {
                'id': 10213,
                'name': '鲁昂'
            },
            {
                'id': 10214,
                'name': '马赛'
            },
            {
                'id': 10215,
                'name': '梅斯'
            },
            {
                'id': 10216,
                'name': '蒙彼利埃'
            },
            {
                'id': 10217,
                'name': '南特'
            },
            {
                'id': 10218,
                'name': '尼斯'
            },
            {
                'id': 10219,
                'name': '沙隆'
            },
            {
                'id': 10220,
                'name': '图卢兹'
            },
            {
                'id': 10221,
                'name': '瓦朗斯'
            },
            {
                'id': 10222,
                'name': '亚眠'
            }
        ]
    },
    {
        'id': 103,
        'name': '韩国',
        'children': [
            {
                'id': 10300,
                'name': '大邱'
            },
            {
                'id': 10301,
                'name': '大田'
            },
            {
                'id': 10302,
                'name': '釜山'
            },
            {
                'id': 10303,
                'name': '光州'
            },
            {
                'id': 10304,
                'name': '济州特别自治道'
            },
            {
                'id': 10305,
                'name': '江原道',
                'children': [
                    {
                        'id': 1030500,
                        'name': '春川市'
                    },
                    {
                        'id': 1030501,
                        'name': '东海市'
                    },
                    {
                        'id': 1030502,
                        'name': '高城郡'
                    },
                    {
                        'id': 1030503,
                        'name': '横城郡'
                    },
                    {
                        'id': 1030504,
                        'name': '洪川郡'
                    },
                    {
                        'id': 1030505,
                        'name': '华川郡'
                    },
                    {
                        'id': 1030506,
                        'name': '江陵市'
                    },
                    {
                        'id': 1030507,
                        'name': '旌善郡'
                    },
                    {
                        'id': 1030508,
                        'name': '麟蹄郡'
                    },
                    {
                        'id': 1030509,
                        'name': '宁越郡'
                    },
                    {
                        'id': 1030510,
                        'name': '平昌郡'
                    },
                    {
                        'id': 1030511,
                        'name': '三陟市'
                    },
                    {
                        'id': 1030512,
                        'name': '束草市'
                    },
                    {
                        'id': 1030513,
                        'name': '太白市'
                    },
                    {
                        'id': 1030514,
                        'name': '铁原郡'
                    },
                    {
                        'id': 1030515,
                        'name': '襄阳郡'
                    },
                    {
                        'id': 1030516,
                        'name': '杨口郡'
                    },
                    {
                        'id': 1030517,
                        'name': '原州市'
                    }
                ]
            },
            {
                'id': 10306,
                'name': '京畿道',
                'children': [
                    {
                        'id': 1030600,
                        'name': '安城市'
                    },
                    {
                        'id': 1030601,
                        'name': '安山市'
                    },
                    {
                        'id': 1030602,
                        'name': '安养市'
                    },
                    {
                        'id': 1030603,
                        'name': '抱川市'
                    },
                    {
                        'id': 1030604,
                        'name': '城南市'
                    },
                    {
                        'id': 1030605,
                        'name': '东豆川市'
                    },
                    {
                        'id': 1030606,
                        'name': '富川市'
                    },
                    {
                        'id': 1030607,
                        'name': '高阳市'
                    },
                    {
                        'id': 1030608,
                        'name': '光明市'
                    },
                    {
                        'id': 1030609,
                        'name': '京畿道·广州市'
                    },
                    {
                        'id': 1030610,
                        'name': '果川市'
                    },
                    {
                        'id': 1030611,
                        'name': '河南市'
                    },
                    {
                        'id': 1030612,
                        'name': '华城市'
                    },
                    {
                        'id': 1030613,
                        'name': '加平郡'
                    },
                    {
                        'id': 1030614,
                        'name': '金浦市'
                    },
                    {
                        'id': 1030615,
                        'name': '九里市'
                    },
                    {
                        'id': 1030616,
                        'name': '军浦市'
                    },
                    {
                        'id': 1030617,
                        'name': '骊州郡'
                    },
                    {
                        'id': 1030618,
                        'name': '利川市'
                    },
                    {
                        'id': 1030619,
                        'name': '涟川郡'
                    },
                    {
                        'id': 1030620,
                        'name': '龙仁市'
                    },
                    {
                        'id': 1030621,
                        'name': '南杨州市'
                    },
                    {
                        'id': 1030622,
                        'name': '平泽市'
                    },
                    {
                        'id': 1030623,
                        'name': '坡州市'
                    },
                    {
                        'id': 1030624,
                        'name': '始兴市'
                    },
                    {
                        'id': 1030625,
                        'name': '水原市'
                    },
                    {
                        'id': 1030626,
                        'name': '乌山市'
                    },
                    {
                        'id': 1030627,
                        'name': '扬平郡'
                    },
                    {
                        'id': 1030628,
                        'name': '杨州市'
                    },
                    {
                        'id': 1030629,
                        'name': '仪旺市'
                    },
                    {
                        'id': 1030630,
                        'name': '议政府市'
                    }
                ]
            },
            {
                'id': 10307,
                'name': '庆尚北道',
                'children': [
                    {
                        'id': 1030700,
                        'name': '安东市'
                    },
                    {
                        'id': 1030701,
                        'name': '奉化郡'
                    },
                    {
                        'id': 1030702,
                        'name': '高灵郡'
                    },
                    {
                        'id': 1030703,
                        'name': '龟尾市'
                    },
                    {
                        'id': 1030704,
                        'name': '金泉市'
                    },
                    {
                        'id': 1030705,
                        'name': '军威郡'
                    },
                    {
                        'id': 1030706,
                        'name': '醴泉郡'
                    },
                    {
                        'id': 1030707,
                        'name': '浦项市'
                    },
                    {
                        'id': 1030708,
                        'name': '漆谷郡'
                    },
                    {
                        'id': 1030709,
                        'name': '淸道郡'
                    },
                    {
                        'id': 1030710,
                        'name': '靑松郡'
                    },
                    {
                        'id': 1030711,
                        'name': '庆山市'
                    },
                    {
                        'id': 1030712,
                        'name': '庆州市'
                    },
                    {
                        'id': 1030713,
                        'name': '荣州市'
                    },
                    {
                        'id': 1030714,
                        'name': '尙州市'
                    },
                    {
                        'id': 1030715,
                        'name': '蔚珍郡'
                    },
                    {
                        'id': 1030716,
                        'name': '闻庆市'
                    },
                    {
                        'id': 1030717,
                        'name': '星州郡'
                    },
                    {
                        'id': 1030718,
                        'name': '义城郡'
                    },
                    {
                        'id': 1030719,
                        'name': '英阳郡'
                    },
                    {
                        'id': 1030720,
                        'name': '盈德郡'
                    },
                    {
                        'id': 1030721,
                        'name': '永川市'
                    },
                    {
                        'id': 1030722,
                        'name': '郁陵郡'
                    }
                ]
            },
            {
                'id': 10308,
                'name': '庆尚南道',
                'children': [
                    {
                        'id': 1030800,
                        'name': '昌宁郡'
                    },
                    {
                        'id': 1030801,
                        'name': '昌原市'
                    },
                    {
                        'id': 1030802,
                        'name': '固城郡'
                    },
                    {
                        'id': 1030803,
                        'name': '河东郡'
                    },
                    {
                        'id': 1030804,
                        'name': '金海市'
                    },
                    {
                        'id': 1030805,
                        'name': '晋州市'
                    },
                    {
                        'id': 1030806,
                        'name': '居昌郡'
                    },
                    {
                        'id': 1030807,
                        'name': '巨济市'
                    },
                    {
                        'id': 1030808,
                        'name': '梁山市'
                    },
                    {
                        'id': 1030809,
                        'name': '马山市'
                    },
                    {
                        'id': 1030810,
                        'name': '密阳市'
                    },
                    {
                        'id': 1030811,
                        'name': '南海郡'
                    },
                    {
                        'id': 1030812,
                        'name': '山淸郡'
                    },
                    {
                        'id': 1030813,
                        'name': '泗川市'
                    },
                    {
                        'id': 1030814,
                        'name': '统营市'
                    },
                    {
                        'id': 1030815,
                        'name': '陜川郡'
                    },
                    {
                        'id': 1030816,
                        'name': '咸安郡'
                    },
                    {
                        'id': 1030817,
                        'name': '咸阳郡'
                    },
                    {
                        'id': 1030818,
                        'name': '宜宁郡'
                    },
                    {
                        'id': 1030819,
                        'name': '鎭海市'
                    }
                ]
            },
            {
                'id': 10309,
                'name': '全罗北道',
                'children': [
                    {
                        'id': 1030900,
                        'name': '淳昌郡'
                    },
                    {
                        'id': 1030901,
                        'name': '扶安郡'
                    },
                    {
                        'id': 1030902,
                        'name': '高敞郡'
                    },
                    {
                        'id': 1030903,
                        'name': '金堤市'
                    },
                    {
                        'id': 1030904,
                        'name': '井邑市'
                    },
                    {
                        'id': 1030905,
                        'name': '茂朱郡'
                    },
                    {
                        'id': 1030906,
                        'name': '南原市'
                    },
                    {
                        'id': 1030907,
                        'name': '全州市'
                    },
                    {
                        'id': 1030908,
                        'name': '群山市'
                    },
                    {
                        'id': 1030909,
                        'name': '任实郡'
                    },
                    {
                        'id': 1030910,
                        'name': '完州郡'
                    },
                    {
                        'id': 1030911,
                        'name': '益山市'
                    },
                    {
                        'id': 1030912,
                        'name': '长水郡'
                    },
                    {
                        'id': 1030913,
                        'name': '鎭安郡'
                    }
                ]
            },
            {
                'id': 10310,
                'name': '全罗南道',
                'children': [
                    {
                        'id': 1031000,
                        'name': '宝城郡'
                    },
                    {
                        'id': 1031001,
                        'name': '高兴郡'
                    },
                    {
                        'id': 1031002,
                        'name': '谷城郡'
                    },
                    {
                        'id': 1031003,
                        'name': '莞岛郡'
                    },
                    {
                        'id': 1031004,
                        'name': '光阳市'
                    },
                    {
                        'id': 1031005,
                        'name': '海南郡'
                    },
                    {
                        'id': 1031006,
                        'name': '和顺郡'
                    },
                    {
                        'id': 1031007,
                        'name': '康津郡'
                    },
                    {
                        'id': 1031008,
                        'name': '全罗南道·丽水市'
                    },
                    {
                        'id': 1031009,
                        'name': '灵光郡'
                    },
                    {
                        'id': 1031010,
                        'name': '灵岩郡'
                    },
                    {
                        'id': 1031011,
                        'name': '罗州市'
                    },
                    {
                        'id': 1031012,
                        'name': '木浦市'
                    },
                    {
                        'id': 1031013,
                        'name': '求礼郡'
                    },
                    {
                        'id': 1031014,
                        'name': '顺天市'
                    },
                    {
                        'id': 1031015,
                        'name': '潭阳郡'
                    },
                    {
                        'id': 1031016,
                        'name': '务安郡'
                    },
                    {
                        'id': 1031017,
                        'name': '咸平郡'
                    },
                    {
                        'id': 1031018,
                        'name': '新安郡'
                    },
                    {
                        'id': 1031019,
                        'name': '长城郡'
                    },
                    {
                        'id': 1031020,
                        'name': '长兴郡'
                    },
                    {
                        'id': 1031021,
                        'name': '珍岛郡'
                    }
                ]
            },
            {
                'id': 10311,
                'name': '仁川'
            },
            {
                'id': 10312,
                'name': '首尔'
            },
            {
                'id': 10313,
                'name': '蔚山'
            },
            {
                'id': 10314,
                'name': '忠清北道',
                'children': [
                    {
                        'id': 1031400,
                        'name': '报恩郡'
                    },
                    {
                        'id': 1031401,
                        'name': '曾坪郡'
                    },
                    {
                        'id': 1031402,
                        'name': '丹阳郡'
                    },
                    {
                        'id': 1031403,
                        'name': '堤川市'
                    },
                    {
                        'id': 1031404,
                        'name': '槐山郡'
                    },
                    {
                        'id': 1031405,
                        'name': '淸原郡'
                    },
                    {
                        'id': 1031406,
                        'name': '淸州市'
                    },
                    {
                        'id': 1031407,
                        'name': '沃川郡'
                    },
                    {
                        'id': 1031408,
                        'name': '阴城郡'
                    },
                    {
                        'id': 1031409,
                        'name': '永同郡'
                    },
                    {
                        'id': 1031410,
                        'name': '鎭川郡'
                    },
                    {
                        'id': 1031411,
                        'name': '忠州市'
                    }
                ]
            },
            {
                'id': 10315,
                'name': '忠清南道',
                'children': [
                    {
                        'id': 1031500,
                        'name': '保宁市'
                    },
                    {
                        'id': 1031501,
                        'name': '扶余郡'
                    },
                    {
                        'id': 1031502,
                        'name': '公州市'
                    },
                    {
                        'id': 1031503,
                        'name': '洪城郡'
                    },
                    {
                        'id': 1031504,
                        'name': '鸡龙市'
                    },
                    {
                        'id': 1031505,
                        'name': '锦山郡'
                    },
                    {
                        'id': 1031506,
                        'name': '礼山郡'
                    },
                    {
                        'id': 1031507,
                        'name': '论山市'
                    },
                    {
                        'id': 1031508,
                        'name': '青阳郡'
                    },
                    {
                        'id': 1031509,
                        'name': '瑞山市'
                    },
                    {
                        'id': 1031510,
                        'name': '舒川郡'
                    },
                    {
                        'id': 1031511,
                        'name': '泰安郡'
                    },
                    {
                        'id': 1031512,
                        'name': '唐津郡'
                    },
                    {
                        'id': 1031513,
                        'name': '天安市'
                    },
                    {
                        'id': 1031514,
                        'name': '牙山市'
                    },
                    {
                        'id': 1031515,
                        'name': '燕岐郡'
                    }
                ]
            }
        ]
    },
    {
        'id': 104,
        'name': '美国',
        'children': [
            {
                'id': 10400,
                'name': '阿肯色',
                'children': [
                    {
                        'id': 1040000,
                        'name': '费耶特维尔'
                    },
                    {
                        'id': 1040001,
                        'name': '史密斯堡'
                    },
                    {
                        'id': 1040002,
                        'name': '小石城'
                    }
                ]
            },
            {
                'id': 10401,
                'name': '阿拉巴马',
                'children': [
                    {
                        'id': 1040100,
                        'name': '伯明罕'
                    },
                    {
                        'id': 1040101,
                        'name': '蒙哥马利'
                    },
                    {
                        'id': 1040102,
                        'name': '莫比尔'
                    }
                ]
            },
            {
                'id': 10402,
                'name': '阿拉斯加',
                'children': [
                    {
                        'id': 1040200,
                        'name': '安克雷奇'
                    },
                    {
                        'id': 1040201,
                        'name': '费尔班克斯'
                    },
                    {
                        'id': 1040202,
                        'name': '朱诺'
                    }
                ]
            },
            {
                'id': 10403,
                'name': '爱达荷',
                'children': [
                    {
                        'id': 1040300,
                        'name': '爱达荷福尔斯'
                    },
                    {
                        'id': 1040301,
                        'name': '波卡特洛'
                    },
                    {
                        'id': 1040302,
                        'name': '博伊西'
                    },
                    {
                        'id': 1040303,
                        'name': '布莱克富特'
                    },
                    {
                        'id': 1040304,
                        'name': '科达伦'
                    },
                    {
                        'id': 1040305,
                        'name': '爱达荷·刘易斯顿'
                    },
                    {
                        'id': 1040306,
                        'name': '爱达荷·莫斯科'
                    },
                    {
                        'id': 1040307,
                        'name': '墨菲'
                    },
                    {
                        'id': 1040308,
                        'name': '楠帕'
                    },
                    {
                        'id': 1040309,
                        'name': '岂彻姆'
                    },
                    {
                        'id': 1040310,
                        'name': '森瓦利'
                    },
                    {
                        'id': 1040311,
                        'name': '亚美利加瀑布城'
                    }
                ]
            },
            {
                'id': 10404,
                'name': '爱荷华',
                'children': [
                    {
                        'id': 1040400,
                        'name': '达文波特'
                    },
                    {
                        'id': 1040401,
                        'name': '得梅因'
                    },
                    {
                        'id': 1040402,
                        'name': '锡达拉皮兹'
                    }
                ]
            },
            {
                'id': 10405,
                'name': '北达科他',
                'children': [
                    {
                        'id': 1040500,
                        'name': '俾斯麦'
                    },
                    {
                        'id': 1040501,
                        'name': '大福克斯'
                    },
                    {
                        'id': 1040502,
                        'name': '法戈'
                    },
                    {
                        'id': 1040503,
                        'name': '迈诺特'
                    }
                ]
            },
            {
                'id': 10406,
                'name': '北卡罗来纳',
                'children': [
                    {
                        'id': 1040600,
                        'name': '艾许维尔'
                    },
                    {
                        'id': 1040601,
                        'name': '杜罕'
                    },
                    {
                        'id': 1040602,
                        'name': '格林斯伯勒'
                    },
                    {
                        'id': 1040603,
                        'name': '教堂山'
                    },
                    {
                        'id': 1040604,
                        'name': '罗利'
                    },
                    {
                        'id': 1040605,
                        'name': '洛利杜罕都会区'
                    },
                    {
                        'id': 1040606,
                        'name': '夏洛特'
                    }
                ]
            },
            {
                'id': 10407,
                'name': '宾夕法尼亚',
                'children': [
                    {
                        'id': 1040700,
                        'name': '阿伦敦'
                    },
                    {
                        'id': 1040701,
                        'name': '费城'
                    },
                    {
                        'id': 1040702,
                        'name': '匹兹堡'
                    }
                ]
            },
            {
                'id': 10408,
                'name': '德克萨斯',
                'children': [
                    {
                        'id': 1040800,
                        'name': '埃尔帕索'
                    },
                    {
                        'id': 1040801,
                        'name': '奥斯汀'
                    },
                    {
                        'id': 1040802,
                        'name': '达拉斯'
                    },
                    {
                        'id': 1040803,
                        'name': '哥帕斯基斯蒂'
                    },
                    {
                        'id': 1040804,
                        'name': '交维斯顿'
                    },
                    {
                        'id': 1040805,
                        'name': '拉雷多'
                    },
                    {
                        'id': 1040806,
                        'name': '麦亚伦'
                    },
                    {
                        'id': 1040807,
                        'name': '圣安东尼奥'
                    },
                    {
                        'id': 1040808,
                        'name': '休斯敦'
                    }
                ]
            },
            {
                'id': 10409,
                'name': '俄亥俄',
                'children': [
                    {
                        'id': 1040900,
                        'name': '代顿'
                    },
                    {
                        'id': 1040901,
                        'name': '克利夫兰'
                    },
                    {
                        'id': 1040902,
                        'name': '俄亥俄·托莱多'
                    },
                    {
                        'id': 1040903,
                        'name': '辛辛那提'
                    }
                ]
            },
            {
                'id': 10410,
                'name': '俄克拉荷马',
                'children': [
                    {
                        'id': 1041000,
                        'name': '俄克拉荷马城'
                    },
                    {
                        'id': 1041001,
                        'name': '诺曼'
                    },
                    {
                        'id': 1041002,
                        'name': '塔尔萨'
                    }
                ]
            },
            {
                'id': 10411,
                'name': '俄勒冈',
                'children': [
                    {
                        'id': 1041100,
                        'name': '本德'
                    },
                    {
                        'id': 1041101,
                        'name': '波特兰'
                    },
                    {
                        'id': 1041102,
                        'name': '达尔斯'
                    },
                    {
                        'id': 1041103,
                        'name': '蒂拉穆克'
                    },
                    {
                        'id': 1041104,
                        'name': '格兰茨帕斯'
                    },
                    {
                        'id': 1041105,
                        'name': '胡德里弗'
                    },
                    {
                        'id': 1041106,
                        'name': '火山口湖'
                    },
                    {
                        'id': 1041107,
                        'name': '科瓦利斯'
                    },
                    {
                        'id': 1041108,
                        'name': '库斯贝'
                    },
                    {
                        'id': 1041109,
                        'name': '梅德福'
                    },
                    {
                        'id': 1041110,
                        'name': '塞勒姆'
                    },
                    {
                        'id': 1041111,
                        'name': '圣海伦斯'
                    },
                    {
                        'id': 1041112,
                        'name': '尤金'
                    }
                ]
            },
            {
                'id': 10412,
                'name': '佛罗里达',
                'children': [
                    {
                        'id': 1041200,
                        'name': '奥兰多'
                    },
                    {
                        'id': 1041201,
                        'name': '基韦斯特'
                    },
                    {
                        'id': 1041202,
                        'name': '杰克逊维尔'
                    },
                    {
                        'id': 1041203,
                        'name': '卡纳维尔角'
                    },
                    {
                        'id': 1041204,
                        'name': '罗德岱堡'
                    },
                    {
                        'id': 1041205,
                        'name': '迈阿密'
                    },
                    {
                        'id': 1041206,
                        'name': '圣彼德斯堡市'
                    },
                    {
                        'id': 1041207,
                        'name': '塔拉哈西'
                    },
                    {
                        'id': 1041208,
                        'name': '坦帕'
                    }
                ]
            },
            {
                'id': 10413,
                'name': '佛蒙特',
                'children': [
                    {
                        'id': 1041300,
                        'name': '伯灵顿'
                    },
                    {
                        'id': 1041301,
                        'name': '拉特兰'
                    },
                    {
                        'id': 1041302,
                        'name': '南伯灵顿'
                    }
                ]
            },
            {
                'id': 10414,
                'name': '华盛顿',
                'children': [
                    {
                        'id': 1041400,
                        'name': '斯波坎'
                    },
                    {
                        'id': 1041401,
                        'name': '塔科马'
                    },
                    {
                        'id': 1041402,
                        'name': '西雅图'
                    }
                ]
            },
            {
                'id': 10415,
                'name': '怀俄明',
                'children': [
                    {
                        'id': 1041500,
                        'name': '埃文斯顿'
                    },
                    {
                        'id': 1041501,
                        'name': '卡斯珀'
                    },
                    {
                        'id': 1041502,
                        'name': '拉勒米'
                    },
                    {
                        'id': 1041503,
                        'name': '罗克斯普林斯'
                    },
                    {
                        'id': 1041504,
                        'name': '夏延'
                    },
                    {
                        'id': 1041505,
                        'name': '谢里登'
                    }
                ]
            },
            {
                'id': 10416,
                'name': '加利福尼亚',
                'children': [
                    {
                        'id': 1041600,
                        'name': '旧金山'
                    },
                    {
                        'id': 1041601,
                        'name': '洛杉矶'
                    },
                    {
                        'id': 1041602,
                        'name': '圣迭戈'
                    },
                    {
                        'id': 1041603,
                        'name': '加利福尼亚·圣何塞'
                    }
                ]
            },
            {
                'id': 10417,
                'name': '堪萨斯',
                'children': [
                    {
                        'id': 1041700,
                        'name': '阿比林'
                    },
                    {
                        'id': 1041701,
                        'name': '奥弗兰公园'
                    },
                    {
                        'id': 1041702,
                        'name': '哈钦森'
                    },
                    {
                        'id': 1041703,
                        'name': '堪萨斯·堪萨斯城'
                    },
                    {
                        'id': 1041704,
                        'name': '莱文沃思'
                    },
                    {
                        'id': 1041705,
                        'name': '劳伦斯'
                    },
                    {
                        'id': 1041706,
                        'name': '曼哈顿'
                    },
                    {
                        'id': 1041707,
                        'name': '托皮卡'
                    },
                    {
                        'id': 1041708,
                        'name': '威奇托'
                    }
                ]
            },
            {
                'id': 10418,
                'name': '康涅狄格',
                'children': [
                    {
                        'id': 1041800,
                        'name': '布里奇波特'
                    },
                    {
                        'id': 1041801,
                        'name': '达里恩'
                    },
                    {
                        'id': 1041802,
                        'name': '格林尼治'
                    },
                    {
                        'id': 1041803,
                        'name': '哈特福德'
                    },
                    {
                        'id': 1041804,
                        'name': '米德尔顿'
                    },
                    {
                        'id': 1041805,
                        'name': '纽黑文'
                    },
                    {
                        'id': 1041806,
                        'name': '韦斯特波特'
                    },
                    {
                        'id': 1041807,
                        'name': '沃特伯里'
                    },
                    {
                        'id': 1041808,
                        'name': '新不列颠'
                    }
                ]
            },
            {
                'id': 10419,
                'name': '科罗拉多',
                'children': [
                    {
                        'id': 1041900,
                        'name': '阿斯彭'
                    },
                    {
                        'id': 1041901,
                        'name': '科罗拉多·奥罗拉'
                    },
                    {
                        'id': 1041902,
                        'name': '博尔德'
                    },
                    {
                        'id': 1041903,
                        'name': '大章克申'
                    },
                    {
                        'id': 1041904,
                        'name': '丹佛'
                    },
                    {
                        'id': 1041905,
                        'name': '柯林斯堡'
                    },
                    {
                        'id': 1041906,
                        'name': '科罗拉多斯普林斯'
                    },
                    {
                        'id': 1041907,
                        'name': '韦尔'
                    }
                ]
            },
            {
                'id': 10420,
                'name': '肯塔基',
                'children': [
                    {
                        'id': 1042000,
                        'name': '列克星敦'
                    },
                    {
                        'id': 1042001,
                        'name': '路易斯维尔'
                    },
                    {
                        'id': 1042002,
                        'name': '欧文斯伯勒'
                    }
                ]
            },
            {
                'id': 10421,
                'name': '路易斯安那',
                'children': [
                    {
                        'id': 1042100,
                        'name': '巴吞鲁日'
                    },
                    {
                        'id': 1042101,
                        'name': '什里夫波特'
                    },
                    {
                        'id': 1042102,
                        'name': '新奥尔良'
                    }
                ]
            },
            {
                'id': 10422,
                'name': '罗德岛',
                'children': [
                    {
                        'id': 1042200,
                        'name': '波塔基特'
                    },
                    {
                        'id': 1042201,
                        'name': '克兰斯顿'
                    },
                    {
                        'id': 1042202,
                        'name': '罗德岛·纽波特'
                    },
                    {
                        'id': 1042203,
                        'name': '普罗维登斯'
                    },
                    {
                        'id': 1042204,
                        'name': '韦斯特利'
                    },
                    {
                        'id': 1042205,
                        'name': '文索基特'
                    },
                    {
                        'id': 1042206,
                        'name': '沃威克'
                    }
                ]
            },
            {
                'id': 10423,
                'name': '马里兰',
                'children': [
                    {
                        'id': 1042300,
                        'name': '巴尔的摩'
                    },
                    {
                        'id': 1042301,
                        'name': '盖瑟斯堡'
                    },
                    {
                        'id': 1042302,
                        'name': '罗克维尔'
                    }
                ]
            },
            {
                'id': 10424,
                'name': '马萨诸塞',
                'children': [
                    {
                        'id': 1042400,
                        'name': '波士顿'
                    },
                    {
                        'id': 1042401,
                        'name': '马萨诸塞·斯普林菲尔德'
                    },
                    {
                        'id': 1042402,
                        'name': '伍斯特'
                    }
                ]
            },
            {
                'id': 10425,
                'name': '蒙大拿',
                'children': [
                    {
                        'id': 1042500,
                        'name': '比灵斯'
                    },
                    {
                        'id': 1042501,
                        'name': '大瀑布村'
                    },
                    {
                        'id': 1042502,
                        'name': '米苏拉'
                    }
                ]
            },
            {
                'id': 10426,
                'name': '密苏里',
                'children': [
                    {
                        'id': 1042600,
                        'name': '密苏里·哥伦比亚'
                    },
                    {
                        'id': 1042601,
                        'name': '杰佛逊市'
                    },
                    {
                        'id': 1042602,
                        'name': '密苏里·堪萨斯城'
                    },
                    {
                        'id': 1042603,
                        'name': '圣路易斯'
                    },
                    {
                        'id': 1042604,
                        'name': '密苏里·斯普林菲尔德'
                    }
                ]
            },
            {
                'id': 10427,
                'name': '密西西比',
                'children': [
                    {
                        'id': 1042700,
                        'name': '比洛克西'
                    },
                    {
                        'id': 1042701,
                        'name': '格尔夫波特'
                    },
                    {
                        'id': 1042702,
                        'name': '格林维尔'
                    },
                    {
                        'id': 1042703,
                        'name': '哈蒂斯堡'
                    },
                    {
                        'id': 1042704,
                        'name': '杰克逊'
                    },
                    {
                        'id': 1042705,
                        'name': '默里迪恩'
                    },
                    {
                        'id': 1042706,
                        'name': '维克斯堡'
                    }
                ]
            },
            {
                'id': 10428,
                'name': '密歇根',
                'children': [
                    {
                        'id': 1042800,
                        'name': '安娜堡'
                    },
                    {
                        'id': 1042801,
                        'name': '巴特尔克里克'
                    },
                    {
                        'id': 1042802,
                        'name': '贝城'
                    },
                    {
                        'id': 1042803,
                        'name': '大急流城'
                    },
                    {
                        'id': 1042804,
                        'name': '迪尔伯恩'
                    },
                    {
                        'id': 1042805,
                        'name': '底特律'
                    },
                    {
                        'id': 1042806,
                        'name': '弗林特'
                    },
                    {
                        'id': 1042807,
                        'name': '怀恩多特'
                    },
                    {
                        'id': 1042808,
                        'name': '卡拉马袓'
                    },
                    {
                        'id': 1042809,
                        'name': '兰辛'
                    },
                    {
                        'id': 1042810,
                        'name': '马斯基根'
                    },
                    {
                        'id': 1042811,
                        'name': '庞菷亚克'
                    },
                    {
                        'id': 1042812,
                        'name': '萨吉诺'
                    },
                    {
                        'id': 1042813,
                        'name': '苏圣玛丽'
                    },
                    {
                        'id': 1042814,
                        'name': '密歇根·沃伦'
                    },
                    {
                        'id': 1042815,
                        'name': '休伦港'
                    }
                ]
            },
            {
                'id': 10429,
                'name': '缅因',
                'children': [
                    {
                        'id': 1042900,
                        'name': '缅因·班戈'
                    },
                    {
                        'id': 1042901,
                        'name': '缅因·刘易斯顿'
                    }
                ]
            },
            {
                'id': 10430,
                'name': '明尼苏达',
                'children': [
                    {
                        'id': 1043000,
                        'name': '明尼苏达·罗切斯特'
                    },
                    {
                        'id': 1043001,
                        'name': '明尼阿波利斯'
                    },
                    {
                        'id': 1043002,
                        'name': '圣保罗'
                    }
                ]
            },
            {
                'id': 10431,
                'name': '南达科他',
                'children': [
                    {
                        'id': 1043100,
                        'name': '南达科他·阿伯丁'
                    },
                    {
                        'id': 1043101,
                        'name': '拉皮德城'
                    },
                    {
                        'id': 1043102,
                        'name': '苏福尔斯'
                    }
                ]
            },
            {
                'id': 10432,
                'name': '南卡罗来纳',
                'children': [
                    {
                        'id': 1043200,
                        'name': '查尔斯顿'
                    },
                    {
                        'id': 1043201,
                        'name': '南卡罗来纳·哥伦比亚'
                    }
                ]
            },
            {
                'id': 10433,
                'name': '内布拉斯加',
                'children': [
                    {
                        'id': 1043300,
                        'name': '奥马哈'
                    },
                    {
                        'id': 1043301,
                        'name': '贝尔维尤'
                    },
                    {
                        'id': 1043302,
                        'name': '林肯'
                    }
                ]
            },
            {
                'id': 10434,
                'name': '内华达',
                'children': [
                    {
                        'id': 1043400,
                        'name': '埃尔科'
                    },
                    {
                        'id': 1043401,
                        'name': '北拉斯维加斯'
                    },
                    {
                        'id': 1043402,
                        'name': '弗吉尼亚城'
                    },
                    {
                        'id': 1043403,
                        'name': '亨德森'
                    },
                    {
                        'id': 1043404,
                        'name': '卡森城'
                    },
                    {
                        'id': 1043405,
                        'name': '拉斯维加斯'
                    },
                    {
                        'id': 1043406,
                        'name': '里诺'
                    },
                    {
                        'id': 1043407,
                        'name': '斯帕克斯'
                    }
                ]
            },
            {
                'id': 10435,
                'name': '纽约',
                'children': [
                    {
                        'id': 1043500,
                        'name': '布法罗'
                    },
                    {
                        'id': 1043501,
                        'name': '罗切斯特'
                    },
                    {
                        'id': 1043502,
                        'name': '纽约市'
                    }
                ]
            },
            {
                'id': 10436,
                'name': '特拉华',
                'children': [
                    {
                        'id': 1043600,
                        'name': '多佛'
                    },
                    {
                        'id': 1043601,
                        'name': '特拉华·纽瓦克'
                    },
                    {
                        'id': 1043602,
                        'name': '威明顿'
                    }
                ]
            },
            {
                'id': 10437,
                'name': '田纳西',
                'children': [
                    {
                        'id': 1043700,
                        'name': '布利斯托'
                    },
                    {
                        'id': 1043701,
                        'name': '查塔努加'
                    },
                    {
                        'id': 1043702,
                        'name': '金斯波特'
                    },
                    {
                        'id': 1043703,
                        'name': '孟菲斯'
                    },
                    {
                        'id': 1043704,
                        'name': '纳什维尔'
                    },
                    {
                        'id': 1043705,
                        'name': '诺克斯维尔'
                    },
                    {
                        'id': 1043706,
                        'name': '三城区'
                    },
                    {
                        'id': 1043707,
                        'name': '士麦那'
                    },
                    {
                        'id': 1043708,
                        'name': '斯普林希尔'
                    },
                    {
                        'id': 1043709,
                        'name': '约翰逊城'
                    }
                ]
            },
            {
                'id': 10438,
                'name': '威斯康星',
                'children': [
                    {
                        'id': 1043800,
                        'name': '阿普尓顿'
                    },
                    {
                        'id': 1043801,
                        'name': '奥什科什'
                    },
                    {
                        'id': 1043802,
                        'name': '格林贝'
                    },
                    {
                        'id': 1043803,
                        'name': '基诺沙'
                    },
                    {
                        'id': 1043804,
                        'name': '拉克罗斯'
                    },
                    {
                        'id': 1043805,
                        'name': '拉辛'
                    },
                    {
                        'id': 1043806,
                        'name': '马尼托沃克'
                    },
                    {
                        'id': 1043807,
                        'name': '迈迪逊'
                    },
                    {
                        'id': 1043808,
                        'name': '密尔沃基'
                    },
                    {
                        'id': 1043809,
                        'name': '欧克莱尓'
                    },
                    {
                        'id': 1043810,
                        'name': '沃索'
                    },
                    {
                        'id': 1043811,
                        'name': '希博伊根'
                    }
                ]
            },
            {
                'id': 10439,
                'name': '维吉尼亚',
                'children': [
                    {
                        'id': 1043900,
                        'name': '弗吉尼亚比奇'
                    },
                    {
                        'id': 1043901,
                        'name': '维吉尼亚·诺福克'
                    },
                    {
                        'id': 1043902,
                        'name': '切萨皮克'
                    }
                ]
            },
            {
                'id': 10440,
                'name': '西佛吉尼亚',
                'children': [
                    {
                        'id': 1044000,
                        'name': '亨廷顿'
                    },
                    {
                        'id': 1044001,
                        'name': '帕克斯堡'
                    }
                ]
            },
            {
                'id': 10441,
                'name': '夏威夷',
                'children': [
                    {
                        'id': 1044100,
                        'name': '凯卢阿'
                    },
                    {
                        'id': 1044101,
                        'name': '檀香山'
                    },
                    {
                        'id': 1044102,
                        'name': '希洛'
                    }
                ]
            },
            {
                'id': 10442,
                'name': '新罕布什尔',
                'children': [
                    {
                        'id': 1044200,
                        'name': '康科德'
                    },
                    {
                        'id': 1044201,
                        'name': '新罕布什尔·曼彻斯特'
                    },
                    {
                        'id': 1044202,
                        'name': '纳舒厄'
                    }
                ]
            },
            {
                'id': 10443,
                'name': '新墨西哥',
                'children': [
                    {
                        'id': 1044300,
                        'name': '阿尔伯克基'
                    },
                    {
                        'id': 1044301,
                        'name': '拉斯克鲁塞斯'
                    },
                    {
                        'id': 1044302,
                        'name': '罗斯韦尔'
                    },
                    {
                        'id': 1044303,
                        'name': '新墨西哥·圣菲'
                    }
                ]
            },
            {
                'id': 10444,
                'name': '新泽西',
                'children': [
                    {
                        'id': 1044400,
                        'name': '新泽西·纽瓦克'
                    },
                    {
                        'id': 1044401,
                        'name': '帕特森'
                    },
                    {
                        'id': 1044402,
                        'name': '泽西城'
                    }
                ]
            },
            {
                'id': 10445,
                'name': '亚利桑那',
                'children': [
                    {
                        'id': 1044500,
                        'name': '凤凰城'
                    },
                    {
                        'id': 1044501,
                        'name': '格兰代尔'
                    },
                    {
                        'id': 1044502,
                        'name': '梅萨'
                    },
                    {
                        'id': 1044503,
                        'name': '史卡兹代尔'
                    },
                    {
                        'id': 1044504,
                        'name': '坦普'
                    },
                    {
                        'id': 1044505,
                        'name': '图森'
                    },
                    {
                        'id': 1044506,
                        'name': '优玛'
                    }
                ]
            },
            {
                'id': 10446,
                'name': '伊利诺伊',
                'children': [
                    {
                        'id': 1044600,
                        'name': '奥尔顿'
                    },
                    {
                        'id': 1044601,
                        'name': '伊利诺斯·奥罗拉'
                    },
                    {
                        'id': 1044602,
                        'name': '布卢明顿'
                    },
                    {
                        'id': 1044603,
                        'name': '丹维尓'
                    },
                    {
                        'id': 1044604,
                        'name': '迪卡尔布'
                    },
                    {
                        'id': 1044605,
                        'name': '迪凯持'
                    },
                    {
                        'id': 1044606,
                        'name': '东圣路易斯'
                    },
                    {
                        'id': 1044607,
                        'name': '厄巴纳-香槟'
                    },
                    {
                        'id': 1044608,
                        'name': '盖尔斯堡'
                    },
                    {
                        'id': 1044609,
                        'name': '卡本代尔'
                    },
                    {
                        'id': 1044610,
                        'name': '罗克艾兰'
                    },
                    {
                        'id': 1044611,
                        'name': '罗克福德'
                    },
                    {
                        'id': 1044612,
                        'name': '诺黙尔'
                    },
                    {
                        'id': 1044613,
                        'name': '皮奥里亚'
                    },
                    {
                        'id': 1044614,
                        'name': '森特勒利亚'
                    },
                    {
                        'id': 1044615,
                        'name': '伊利诺伊·斯普林菲尔德'
                    },
                    {
                        'id': 1044616,
                        'name': '沃其根'
                    },
                    {
                        'id': 1044617,
                        'name': '芝加哥'
                    }
                ]
            },
            {
                'id': 10447,
                'name': '印第安那',
                'children': [
                    {
                        'id': 1044700,
                        'name': '埃文斯维尔'
                    },
                    {
                        'id': 1044701,
                        'name': '韦恩堡'
                    },
                    {
                        'id': 1044702,
                        'name': '印第安纳波利斯'
                    }
                ]
            },
            {
                'id': 10448,
                'name': '犹他',
                'children': [
                    {
                        'id': 1044800,
                        'name': '奥格登'
                    },
                    {
                        'id': 1044801,
                        'name': '雷登'
                    },
                    {
                        'id': 1044802,
                        'name': '欧仁'
                    },
                    {
                        'id': 1044803,
                        'name': '帕克城'
                    },
                    {
                        'id': 1044804,
                        'name': '普罗沃'
                    },
                    {
                        'id': 1044805,
                        'name': '圣乔治'
                    },
                    {
                        'id': 1044806,
                        'name': '西瓦利城'
                    },
                    {
                        'id': 1044807,
                        'name': '盐湖城'
                    }
                ]
            },
            {
                'id': 10449,
                'name': '佐治亚',
                'children': [
                    {
                        'id': 1044900,
                        'name': '奥古斯塔'
                    },
                    {
                        'id': 1044901,
                        'name': '哥伦布'
                    },
                    {
                        'id': 1044902,
                        'name': '梅肯'
                    },
                    {
                        'id': 1044903,
                        'name': '沙瓦纳'
                    },
                    {
                        'id': 1044904,
                        'name': '亚特兰大'
                    }
                ]
            }
        ]
    },
    {
        'id': 105,
        'name': '日本',
        'children': [
            {
                'id': 10500,
                'name': '爱媛'
            },
            {
                'id': 10501,
                'name': '爱知'
            },
            {
                'id': 10502,
                'name': '北海道'
            },
            {
                'id': 10503,
                'name': '兵库'
            },
            {
                'id': 10504,
                'name': '冲绳'
            },
            {
                'id': 10505,
                'name': '茨城'
            },
            {
                'id': 10506,
                'name': '大阪'
            },
            {
                'id': 10507,
                'name': '大分'
            },
            {
                'id': 10508,
                'name': '岛根'
            },
            {
                'id': 10509,
                'name': '徳岛'
            },
            {
                'id': 10510,
                'name': '东京'
            },
            {
                'id': 10511,
                'name': '福岛'
            },
            {
                'id': 10512,
                'name': '福冈'
            },
            {
                'id': 10513,
                'name': '福井'
            },
            {
                'id': 10514,
                'name': '富山'
            },
            {
                'id': 10515,
                'name': '冈山'
            },
            {
                'id': 10516,
                'name': '高知'
            },
            {
                'id': 10517,
                'name': '宮城'
            },
            {
                'id': 10518,
                'name': '宫崎'
            },
            {
                'id': 10519,
                'name': '广岛'
            },
            {
                'id': 10520,
                'name': '和歌山'
            },
            {
                'id': 10521,
                'name': '京都'
            },
            {
                'id': 10522,
                'name': '静冈'
            },
            {
                'id': 10523,
                'name': '枥木'
            },
            {
                'id': 10524,
                'name': '鹿儿岛'
            },
            {
                'id': 10525,
                'name': '奈良'
            },
            {
                'id': 10526,
                'name': '鸟取'
            },
            {
                'id': 10527,
                'name': '岐阜'
            },
            {
                'id': 10528,
                'name': '埼玉'
            },
            {
                'id': 10529,
                'name': '千叶'
            },
            {
                'id': 10530,
                'name': '青森'
            },
            {
                'id': 10531,
                'name': '秋田'
            },
            {
                'id': 10532,
                'name': '群马'
            },
            {
                'id': 10533,
                'name': '三重'
            },
            {
                'id': 10534,
                'name': '山口'
            },
            {
                'id': 10535,
                'name': '山梨'
            },
            {
                'id': 10536,
                'name': '山形'
            },
            {
                'id': 10537,
                'name': '神奈川'
            },
            {
                'id': 10538,
                'name': '石川'
            },
            {
                'id': 10539,
                'name': '香川'
            },
            {
                'id': 10540,
                'name': '新潟'
            },
            {
                'id': 10541,
                'name': '熊本'
            },
            {
                'id': 10542,
                'name': '岩手'
            },
            {
                'id': 10543,
                'name': '长崎'
            },
            {
                'id': 10544,
                'name': '长野'
            },
            {
                'id': 10545,
                'name': '滋贺'
            },
            {
                'id': 10546,
                'name': '佐贺'
            }
        ]
    },
    {
        'id': 106,
        'name': '英国',
        'children': [
            {
                'id': 10600,
                'name': '北爱尔兰',
                'children': [
                    {
                        'id': 1060000,
                        'name': '贝尔法斯特'
                    },
                    {
                        'id': 1060001,
                        'name': '德里'
                    },
                    {
                        'id': 1060002,
                        'name': '利斯本'
                    },
                    {
                        'id': 1060003,
                        'name': '纽里'
                    }
                ]
            },
            {
                'id': 10601,
                'name': '苏格兰',
                'children': [
                    {
                        'id': 1060100,
                        'name': '苏格兰·阿伯丁'
                    },
                    {
                        'id': 1060101,
                        'name': '爱丁堡'
                    },
                    {
                        'id': 1060102,
                        'name': '丹迪'
                    },
                    {
                        'id': 1060103,
                        'name': '格拉斯哥'
                    },
                    {
                        'id': 1060104,
                        'name': '斯特灵'
                    },
                    {
                        'id': 1060105,
                        'name': '因弗内斯'
                    }
                ]
            },
            {
                'id': 10602,
                'name': '威尔士',
                'children': [
                    {
                        'id': 1060200,
                        'name': '班戈'
                    },
                    {
                        'id': 1060201,
                        'name': '卡迪夫'
                    },
                    {
                        'id': 1060202,
                        'name': '纽波特'
                    },
                    {
                        'id': 1060203,
                        'name': '斯旺西'
                    }
                ]
            },
            {
                'id': 10603,
                'name': '英格兰',
                'children': [
                    {
                        'id': 1060300,
                        'name': '埃克塞特'
                    },
                    {
                        'id': 1060301,
                        'name': '巴斯'
                    },
                    {
                        'id': 1060302,
                        'name': '彼得伯勒'
                    },
                    {
                        'id': 1060303,
                        'name': '伯明翰'
                    },
                    {
                        'id': 1060304,
                        'name': '布拉德福德'
                    },
                    {
                        'id': 1060305,
                        'name': '布莱顿与赫福'
                    },
                    {
                        'id': 1060306,
                        'name': '布里斯托尔'
                    },
                    {
                        'id': 1060307,
                        'name': '德比'
                    },
                    {
                        'id': 1060308,
                        'name': '德罕'
                    },
                    {
                        'id': 1060309,
                        'name': '格洛斯特'
                    },
                    {
                        'id': 1060310,
                        'name': '赫尔河畔京斯敦'
                    },
                    {
                        'id': 1060311,
                        'name': '赫里福德'
                    },
                    {
                        'id': 1060312,
                        'name': '剑桥'
                    },
                    {
                        'id': 1060313,
                        'name': '卡莱尔'
                    },
                    {
                        'id': 1060314,
                        'name': '坎特伯雷'
                    },
                    {
                        'id': 1060315,
                        'name': '考文垂'
                    },
                    {
                        'id': 1060316,
                        'name': '兰开斯特'
                    },
                    {
                        'id': 1060317,
                        'name': '里彭'
                    },
                    {
                        'id': 1060318,
                        'name': '利奇菲尔德'
                    },
                    {
                        'id': 1060319,
                        'name': '利物浦'
                    },
                    {
                        'id': 1060320,
                        'name': '利茲'
                    },
                    {
                        'id': 1060321,
                        'name': '列斯特'
                    },
                    {
                        'id': 1060322,
                        'name': '英格兰·林肯'
                    },
                    {
                        'id': 1060323,
                        'name': '伦敦'
                    },
                    {
                        'id': 1060324,
                        'name': '英格兰·曼彻斯特'
                    },
                    {
                        'id': 1060325,
                        'name': '南安普敦'
                    },
                    {
                        'id': 1060326,
                        'name': '牛津'
                    },
                    {
                        'id': 1060327,
                        'name': '英格兰·纽卡斯尔'
                    },
                    {
                        'id': 1060328,
                        'name': '诺丁汉'
                    },
                    {
                        'id': 1060329,
                        'name': '诺里奇'
                    },
                    {
                        'id': 1060330,
                        'name': '朴茨茅斯'
                    },
                    {
                        'id': 1060331,
                        'name': '普雷斯顿'
                    },
                    {
                        'id': 1060332,
                        'name': '普利茅斯'
                    },
                    {
                        'id': 1060333,
                        'name': '奇切斯特'
                    },
                    {
                        'id': 1060334,
                        'name': '切斯特'
                    },
                    {
                        'id': 1060335,
                        'name': '桑德兰'
                    },
                    {
                        'id': 1060336,
                        'name': '圣阿本斯'
                    },
                    {
                        'id': 1060337,
                        'name': '索尔斯堡'
                    },
                    {
                        'id': 1060338,
                        'name': '索福特'
                    },
                    {
                        'id': 1060339,
                        'name': '特鲁罗'
                    },
                    {
                        'id': 1060340,
                        'name': '特伦特河畔斯多克'
                    },
                    {
                        'id': 1060341,
                        'name': '威尔斯'
                    },
                    {
                        'id': 1060342,
                        'name': '韦克菲尔德'
                    },
                    {
                        'id': 1060343,
                        'name': '温彻斯特'
                    },
                    {
                        'id': 1060344,
                        'name': '伍尔弗汉普顿'
                    },
                    {
                        'id': 1060345,
                        'name': '英格兰·伍斯特'
                    },
                    {
                        'id': 1060346,
                        'name': '谢菲尔德'
                    },
                    {
                        'id': 1060347,
                        'name': '伊利'
                    },
                    {
                        'id': 1060348,
                        'name': '约克'
                    }
                ]
            }
        ]
    },
    {
        'id': 107,
        'name': '俄罗斯',
        'children': [
            {
                'id': 10700,
                'name': '阿巴坎'
            },
            {
                'id': 10701,
                'name': '阿尔汉格尔斯克'
            },
            {
                'id': 10702,
                'name': '阿金斯科耶'
            },
            {
                'id': 10703,
                'name': '阿纳德尔'
            },
            {
                'id': 10704,
                'name': '阿斯特拉罕'
            },
            {
                'id': 10705,
                'name': '埃利斯塔'
            },
            {
                'id': 10706,
                'name': '奥廖尔'
            },
            {
                'id': 10707,
                'name': '奥伦堡'
            },
            {
                'id': 10708,
                'name': '巴尔瑙尔'
            },
            {
                'id': 10709,
                'name': '奔萨'
            },
            {
                'id': 10710,
                'name': '彼得罗巴甫洛夫斯克'
            },
            {
                'id': 10711,
                'name': '彼得罗扎沃茨克'
            },
            {
                'id': 10712,
                'name': '彼尔姆'
            },
            {
                'id': 10713,
                'name': '比罗比詹'
            },
            {
                'id': 10714,
                'name': '别尔哥罗德'
            },
            {
                'id': 10715,
                'name': '伯力'
            },
            {
                'id': 10716,
                'name': '布拉戈维申斯克'
            },
            {
                'id': 10717,
                'name': '布良斯克'
            },
            {
                'id': 10718,
                'name': '车里雅宾斯克'
            },
            {
                'id': 10719,
                'name': '赤塔'
            },
            {
                'id': 10720,
                'name': '顿河畔罗斯托夫'
            },
            {
                'id': 10721,
                'name': '鄂木斯克'
            },
            {
                'id': 10722,
                'name': '伏尔加格勒'
            },
            {
                'id': 10723,
                'name': '弗拉基米尔'
            },
            {
                'id': 10724,
                'name': '弗拉季高加索'
            },
            {
                'id': 10725,
                'name': '戈尔诺－阿尔泰斯克'
            },
            {
                'id': 10726,
                'name': '格罗兹尼'
            },
            {
                'id': 10727,
                'name': '海参崴'
            },
            {
                'id': 10728,
                'name': '汉特－曼西斯克'
            },
            {
                'id': 10729,
                'name': '基洛夫'
            },
            {
                'id': 10730,
                'name': '加里宁格勒'
            },
            {
                'id': 10731,
                'name': '喀山'
            },
            {
                'id': 10732,
                'name': '卡卢加'
            },
            {
                'id': 10733,
                'name': '科斯特罗马'
            },
            {
                'id': 10734,
                'name': '克拉斯诺达尔'
            },
            {
                'id': 10735,
                'name': '克拉斯诺亚尔斯克'
            },
            {
                'id': 10736,
                'name': '克麦罗沃'
            },
            {
                'id': 10737,
                'name': '克孜勒'
            },
            {
                'id': 10738,
                'name': '库德姆卡尔'
            },
            {
                'id': 10739,
                'name': '库尔干'
            },
            {
                'id': 10740,
                'name': '库尔斯克'
            },
            {
                'id': 10741,
                'name': '利佩茨克'
            },
            {
                'id': 10742,
                'name': '梁赞'
            },
            {
                'id': 10743,
                'name': '马哈奇卡拉'
            },
            {
                'id': 10744,
                'name': '马加丹'
            },
            {
                'id': 10745,
                'name': '马加斯'
            },
            {
                'id': 10746,
                'name': '迈科普'
            },
            {
                'id': 10747,
                'name': '摩尔曼斯克'
            },
            {
                'id': 10748,
                'name': '莫斯科'
            },
            {
                'id': 10749,
                'name': '纳尔奇克'
            },
            {
                'id': 10750,
                'name': '纳里扬马尔'
            },
            {
                'id': 10751,
                'name': '南萨哈林斯克'
            },
            {
                'id': 10752,
                'name': '诺夫哥罗德'
            },
            {
                'id': 10753,
                'name': '帕拉纳'
            },
            {
                'id': 10754,
                'name': '普斯科夫'
            },
            {
                'id': 10755,
                'name': '切博克萨雷'
            },
            {
                'id': 10756,
                'name': '切尔克斯克'
            },
            {
                'id': 10757,
                'name': '秋明'
            },
            {
                'id': 10758,
                'name': '萨拉托夫'
            },
            {
                'id': 10759,
                'name': '萨兰斯克'
            },
            {
                'id': 10760,
                'name': '萨列哈尔德'
            },
            {
                'id': 10761,
                'name': '萨马拉'
            },
            {
                'id': 10762,
                'name': '瑟克特夫卡尔'
            },
            {
                'id': 10763,
                'name': '圣彼得堡'
            },
            {
                'id': 10764,
                'name': '斯摩棱斯克'
            },
            {
                'id': 10765,
                'name': '斯塔夫罗波尔'
            },
            {
                'id': 10766,
                'name': '坦波夫'
            },
            {
                'id': 10767,
                'name': '特维尔'
            },
            {
                'id': 10768,
                'name': '图拉'
            },
            {
                'id': 10769,
                'name': '托木斯克'
            },
            {
                'id': 10770,
                'name': '沃罗涅什'
            },
            {
                'id': 10771,
                'name': '沃洛格达'
            },
            {
                'id': 10772,
                'name': '乌法'
            },
            {
                'id': 10773,
                'name': '乌兰乌德'
            },
            {
                'id': 10774,
                'name': '乌里扬诺夫斯克'
            },
            {
                'id': 10775,
                'name': '乌斯季奥尔登斯基'
            },
            {
                'id': 10776,
                'name': '下诺夫哥罗德'
            },
            {
                'id': 10777,
                'name': '新西伯利亚'
            },
            {
                'id': 10778,
                'name': '雅库茨克'
            },
            {
                'id': 10779,
                'name': '雅罗斯拉夫尔'
            },
            {
                'id': 10780,
                'name': '叶卡捷林堡'
            },
            {
                'id': 10781,
                'name': '伊尔库茨克'
            },
            {
                'id': 10782,
                'name': '伊热夫斯克'
            },
            {
                'id': 10783,
                'name': '伊万诺沃'
            },
            {
                'id': 10784,
                'name': '约什卡尔奥拉'
            }
        ]
    },
    {
        'id': 108,
        'name': '阿尔巴尼亚',
        'children': [
            {
                'id': 10800,
                'name': '爱尔巴桑'
            },
            {
                'id': 10801,
                'name': '迪勃拉'
            },
            {
                'id': 10802,
                'name': '地拉那'
            },
            {
                'id': 10803,
                'name': '都拉斯'
            },
            {
                'id': 10804,
                'name': '发罗拉'
            },
            {
                'id': 10805,
                'name': '费里'
            },
            {
                'id': 10806,
                'name': '吉诺卡斯特'
            },
            {
                'id': 10807,
                'name': '科尔察'
            },
            {
                'id': 10808,
                'name': '库克斯'
            },
            {
                'id': 10809,
                'name': '莱什'
            },
            {
                'id': 10810,
                'name': '培拉特'
            },
            {
                'id': 10811,
                'name': '斯库台'
            }
        ]
    },
    {
        'id': 109,
        'name': '阿尔及利亚',
        'children': [
            {
                'id': 10900,
                'name': '阿尔及利亚·阿德拉尔'
            },
            {
                'id': 10901,
                'name': '阿尔及尔'
            },
            {
                'id': 10902,
                'name': '艾因·德夫拉'
            },
            {
                'id': 10903,
                'name': '艾因·蒂姆尚特'
            },
            {
                'id': 10904,
                'name': '安纳巴'
            },
            {
                'id': 10905,
                'name': '奥兰'
            },
            {
                'id': 10906,
                'name': '巴特纳'
            },
            {
                'id': 10907,
                'name': '贝贾亚'
            },
            {
                'id': 10908,
                'name': '贝沙尔'
            },
            {
                'id': 10909,
                'name': '贝伊德'
            },
            {
                'id': 10910,
                'name': '比斯克拉'
            },
            {
                'id': 10911,
                'name': '布尔吉·布阿雷里吉'
            },
            {
                'id': 10912,
                'name': '布利达'
            },
            {
                'id': 10913,
                'name': '布迈德斯'
            },
            {
                'id': 10914,
                'name': '布依拉'
            },
            {
                'id': 10915,
                'name': '蒂巴扎'
            },
            {
                'id': 10916,
                'name': '蒂斯姆西勒特'
            },
            {
                'id': 10917,
                'name': '盖尔达耶'
            },
            {
                'id': 10918,
                'name': '盖尔马'
            },
            {
                'id': 10919,
                'name': '罕西拉'
            },
            {
                'id': 10920,
                'name': '赫利赞'
            },
            {
                'id': 10921,
                'name': '吉杰尔'
            },
            {
                'id': 10922,
                'name': '杰勒法'
            },
            {
                'id': 10923,
                'name': '君士坦丁'
            },
            {
                'id': 10924,
                'name': '拉格瓦特'
            },
            {
                'id': 10925,
                'name': '马斯卡拉'
            },
            {
                'id': 10926,
                'name': '麦迪亚'
            },
            {
                'id': 10927,
                'name': '密拉'
            },
            {
                'id': 10928,
                'name': '莫斯塔加纳姆'
            },
            {
                'id': 10929,
                'name': '姆西拉'
            },
            {
                'id': 10930,
                'name': '纳阿马'
            },
            {
                'id': 10931,
                'name': '塞蒂夫'
            },
            {
                'id': 10932,
                'name': '赛伊达'
            },
            {
                'id': 10933,
                'name': '斯基克达'
            },
            {
                'id': 10934,
                'name': '苏克·阿赫拉斯'
            },
            {
                'id': 10935,
                'name': '塔里夫'
            },
            {
                'id': 10936,
                'name': '塔曼拉塞特'
            },
            {
                'id': 10937,
                'name': '特贝萨'
            },
            {
                'id': 10938,
                'name': '特莱姆森'
            },
            {
                'id': 10939,
                'name': '提济乌祖'
            },
            {
                'id': 10940,
                'name': '提亚雷特'
            },
            {
                'id': 10941,
                'name': '廷杜夫'
            },
            {
                'id': 10942,
                'name': '瓦德'
            },
            {
                'id': 10943,
                'name': '瓦尔格拉'
            },
            {
                'id': 10944,
                'name': '乌姆布阿基'
            },
            {
                'id': 10945,
                'name': '西迪贝勒阿贝斯'
            },
            {
                'id': 10946,
                'name': '谢里夫'
            },
            {
                'id': 10947,
                'name': '伊利齐'
            }
        ]
    },
    {
        'id': 110,
        'name': '阿富汗',
        'children': [
            {
                'id': 11000,
                'name': '赫拉特'
            },
            {
                'id': 11001,
                'name': '喀布尔'
            },
            {
                'id': 11002,
                'name': '坎大哈'
            },
            {
                'id': 11003,
                'name': '马扎里沙里夫'
            }
        ]
    },
    {
        'id': 111,
        'name': '阿根廷',
        'children': [
            {
                'id': 11100,
                'name': '别德马'
            },
            {
                'id': 11101,
                'name': '波萨达斯'
            },
            {
                'id': 11102,
                'name': '布兰卡港'
            },
            {
                'id': 11103,
                'name': '布宜诺斯艾利斯'
            },
            {
                'id': 11104,
                'name': '福莫萨'
            },
            {
                'id': 11105,
                'name': '胡胡伊'
            },
            {
                'id': 11106,
                'name': '卡塔马卡'
            },
            {
                'id': 11107,
                'name': '阿根廷·科尔多瓦'
            },
            {
                'id': 11108,
                'name': '科连特斯'
            },
            {
                'id': 11109,
                'name': '克劳斯城'
            },
            {
                'id': 11110,
                'name': '肯考迪娅'
            },
            {
                'id': 11111,
                'name': '阿根廷·拉里奥哈'
            },
            {
                'id': 11112,
                'name': '拉普拉塔'
            },
            {
                'id': 11113,
                'name': '雷西斯滕匹亚'
            },
            {
                'id': 11114,
                'name': '里奥加耶戈斯'
            },
            {
                'id': 11115,
                'name': '里奥夸尔托'
            },
            {
                'id': 11116,
                'name': '里瓦达维亚海军准将城'
            },
            {
                'id': 11117,
                'name': '罗萨里奥'
            },
            {
                'id': 11118,
                'name': '罗森'
            },
            {
                'id': 11119,
                'name': '马德普拉塔'
            },
            {
                'id': 11120,
                'name': '门多萨'
            },
            {
                'id': 11121,
                'name': '内乌肯'
            },
            {
                'id': 11122,
                'name': '萨尔塔'
            },
            {
                'id': 11123,
                'name': '圣地亚哥-德尔埃斯特罗'
            },
            {
                'id': 11124,
                'name': '阿根廷·圣菲'
            },
            {
                'id': 11125,
                'name': '圣胡安'
            },
            {
                'id': 11126,
                'name': '圣拉斐尔'
            },
            {
                'id': 11127,
                'name': '阿根廷·圣路易斯'
            },
            {
                'id': 11128,
                'name': '阿根廷·圣罗莎'
            },
            {
                'id': 11129,
                'name': '圣米格尔-德图库曼'
            },
            {
                'id': 11130,
                'name': '圣尼古拉斯'
            },
            {
                'id': 11131,
                'name': '特雷利乌'
            },
            {
                'id': 11132,
                'name': '乌斯怀亚'
            }
        ]
    },
    {
        'id': 112,
        'name': '阿拉伯联合酋长国',
        'children': [
            {
                'id': 11200,
                'name': '阿布扎比'
            },
            {
                'id': 11201,
                'name': '艾因'
            },
            {
                'id': 11202,
                'name': '迪拜'
            },
            {
                'id': 11203,
                'name': '沙迦'
            }
        ]
    },
    {
        'id': 113,
        'name': '阿鲁巴'
    },
    {
        'id': 114,
        'name': '阿曼',
        'children': [
            {
                'id': 11400,
                'name': '巴提奈地区'
            },
            {
                'id': 11401,
                'name': '达希莱地区'
            },
            {
                'id': 11402,
                'name': '马斯喀特省'
            },
            {
                'id': 11403,
                'name': '穆桑达姆省'
            },
            {
                'id': 11404,
                'name': '佐法尔省'
            }
        ]
    },
    {
        'id': 115,
        'name': '阿塞拜疆',
        'children': [
            {
                'id': 11500,
                'name': '阿布歇隆'
            },
            {
                'id': 11501,
                'name': '哈奇马斯'
            },
            {
                'id': 11502,
                'name': '卡尔巴卡尔'
            },
            {
                'id': 11503,
                'name': '卡扎赫'
            },
            {
                'id': 11504,
                'name': '连科兰'
            },
            {
                'id': 11505,
                'name': '密尔-卡拉巴赫'
            },
            {
                'id': 11506,
                'name': '穆甘-萨连'
            },
            {
                'id': 11507,
                'name': '纳戈尔诺－卡拉巴赫'
            },
            {
                'id': 11508,
                'name': '纳希切万'
            },
            {
                'id': 11509,
                'name': '普利亚拉克斯'
            },
            {
                'id': 11510,
                'name': '舍基'
            },
            {
                'id': 11511,
                'name': '苏姆盖特'
            },
            {
                'id': 11512,
                'name': '锡尔万'
            },
            {
                'id': 11513,
                'name': '占贾'
            }
        ]
    },
    {
        'id': 116,
        'name': '阿森松岛'
    },
    {
        'id': 117,
        'name': '埃及',
        'children': [
            {
                'id': 11700,
                'name': '阿斯旺'
            },
            {
                'id': 11701,
                'name': '古尔代盖'
            },
            {
                'id': 11702,
                'name': '开罗'
            },
            {
                'id': 11703,
                'name': '苏布拉开马'
            },
            {
                'id': 11704,
                'name': '亚历山大'
            }
        ]
    },
    {
        'id': 118,
        'name': '埃塞俄比亚',
        'children': [
            {
                'id': 11800,
                'name': '阿法尔'
            },
            {
                'id': 11801,
                'name': '阿姆哈拉'
            },
            {
                'id': 11802,
                'name': '奥罗米亚'
            },
            {
                'id': 11803,
                'name': '宾香古尔'
            },
            {
                'id': 11804,
                'name': '德雷达瓦'
            },
            {
                'id': 11805,
                'name': '甘贝拉各族'
            },
            {
                'id': 11806,
                'name': '哈勒里民族'
            },
            {
                'id': 11807,
                'name': '南方各族'
            },
            {
                'id': 11808,
                'name': '埃塞俄比亚·索马里'
            },
            {
                'id': 11809,
                'name': '提格雷'
            },
            {
                'id': 11810,
                'name': '亚的斯亚贝巴'
            }
        ]
    },
    {
        'id': 119,
        'name': '爱尔兰',
        'children': [
            {
                'id': 11900,
                'name': '奥法利'
            },
            {
                'id': 11901,
                'name': '蒂珀雷里'
            },
            {
                'id': 11902,
                'name': '都柏林'
            },
            {
                'id': 11903,
                'name': '多内加尔'
            },
            {
                'id': 11904,
                'name': '戈尔韦'
            },
            {
                'id': 11905,
                'name': '基尔代尔'
            },
            {
                'id': 11906,
                'name': '基尔肯尼'
            },
            {
                'id': 11907,
                'name': '卡范'
            },
            {
                'id': 11908,
                'name': '卡洛'
            },
            {
                'id': 11909,
                'name': '凯里'
            },
            {
                'id': 11910,
                'name': '科克'
            },
            {
                'id': 11911,
                'name': '克莱尔'
            },
            {
                'id': 11912,
                'name': '朗福德'
            },
            {
                'id': 11913,
                'name': '劳斯'
            },
            {
                'id': 11914,
                'name': '崂斯'
            },
            {
                'id': 11915,
                'name': '利默里克'
            },
            {
                'id': 11916,
                'name': '利特里姆'
            },
            {
                'id': 11917,
                'name': '罗斯康芒'
            },
            {
                'id': 11918,
                'name': '梅奥'
            },
            {
                'id': 11919,
                'name': '米斯'
            },
            {
                'id': 11920,
                'name': '莫内根'
            },
            {
                'id': 11921,
                'name': '斯莱戈'
            },
            {
                'id': 11922,
                'name': '威克洛'
            },
            {
                'id': 11923,
                'name': '韦克斯福德'
            },
            {
                'id': 11924,
                'name': '沃特福德'
            },
            {
                'id': 11925,
                'name': '西米斯'
            }
        ]
    },
    {
        'id': 120,
        'name': '爱沙尼亚',
        'children': [
            {
                'id': 12000,
                'name': '贝尔瓦'
            },
            {
                'id': 12001,
                'name': '哈留'
            },
            {
                'id': 12002,
                'name': '拉普拉'
            },
            {
                'id': 12003,
                'name': '里亚内'
            },
            {
                'id': 12004,
                'name': '帕尔努'
            },
            {
                'id': 12005,
                'name': '萨雷'
            },
            {
                'id': 12006,
                'name': '塔尔图'
            },
            {
                'id': 12007,
                'name': '爱沙尼亚·瓦尔加'
            },
            {
                'id': 12008,
                'name': '维良地'
            },
            {
                'id': 12009,
                'name': '维鲁'
            },
            {
                'id': 12010,
                'name': '沃鲁'
            },
            {
                'id': 12011,
                'name': '希尤'
            },
            {
                'id': 12012,
                'name': '耶尔韦'
            },
            {
                'id': 12013,
                'name': '耶盖瓦'
            },
            {
                'id': 12014,
                'name': '依达－维鲁'
            }
        ]
    },
    {
        'id': 121,
        'name': '安道尔',
        'children': [
            {
                'id': 12100,
                'name': '安道尔城'
            },
            {
                'id': 12101,
                'name': '奥尔迪诺'
            },
            {
                'id': 12102,
                'name': '恩坎普'
            },
            {
                'id': 12103,
                'name': '卡尼略'
            },
            {
                'id': 12104,
                'name': '莱塞斯卡尔德－恩戈尔达'
            },
            {
                'id': 12105,
                'name': '马萨纳'
            },
            {
                'id': 12106,
                'name': '圣胡利娅－德洛里亚'
            }
        ]
    },
    {
        'id': 122,
        'name': '安哥拉',
        'children': [
            {
                'id': 12200,
                'name': '北宽扎'
            },
            {
                'id': 12201,
                'name': '北隆达'
            },
            {
                'id': 12202,
                'name': '本戈'
            },
            {
                'id': 12203,
                'name': '本格拉'
            },
            {
                'id': 12204,
                'name': '比耶'
            },
            {
                'id': 12205,
                'name': '卡宾达'
            },
            {
                'id': 12206,
                'name': '安哥拉·库内内'
            },
            {
                'id': 12207,
                'name': '宽多库邦戈'
            },
            {
                'id': 12208,
                'name': '罗安达'
            },
            {
                'id': 12209,
                'name': '马兰热'
            },
            {
                'id': 12210,
                'name': '莫希科'
            },
            {
                'id': 12211,
                'name': '纳米贝'
            },
            {
                'id': 12212,
                'name': '南宽扎'
            },
            {
                'id': 12213,
                'name': '南隆达'
            },
            {
                'id': 12214,
                'name': '万博'
            },
            {
                'id': 12215,
                'name': '威拉'
            },
            {
                'id': 12216,
                'name': '威热'
            },
            {
                'id': 12217,
                'name': '扎伊尔'
            }
        ]
    },
    {
        'id': 123,
        'name': '安圭拉'
    },
    {
        'id': 124,
        'name': '安提瓜岛和巴布达'
    },
    {
        'id': 125,
        'name': '澳大利亚',
        'children': [
            {
                'id': 12500,
                'name': '澳大利亚·诺福克'
            },
            {
                'id': 12501,
                'name': '北帕默斯顿'
            },
            {
                'id': 12502,
                'name': '达尔文'
            },
            {
                'id': 12503,
                'name': '堪培拉'
            },
            {
                'id': 12504,
                'name': '昆士兰',
                'children': [
                    {
                        'id': 1250400,
                        'name': '布里斯班'
                    },
                    {
                        'id': 1250401,
                        'name': '黄金海岸'
                    },
                    {
                        'id': 1250402,
                        'name': '凯恩斯'
                    },
                    {
                        'id': 1250403,
                        'name': '日光海岸'
                    },
                    {
                        'id': 1250404,
                        'name': '汤斯维尔'
                    },
                    {
                        'id': 1250405,
                        'name': '图文巴'
                    }
                ]
            },
            {
                'id': 12505,
                'name': '南澳大利亚',
                'children': [
                    {
                        'id': 1250500,
                        'name': '阿德莱德'
                    },
                    {
                        'id': 1250501,
                        'name': '奥古斯塔港'
                    },
                    {
                        'id': 1250502,
                        'name': '甘比亚山'
                    },
                    {
                        'id': 1250503,
                        'name': '怀阿拉'
                    },
                    {
                        'id': 1250504,
                        'name': '林肯港'
                    },
                    {
                        'id': 1250505,
                        'name': '默里布里奇'
                    },
                    {
                        'id': 1250506,
                        'name': '皮里港'
                    },
                    {
                        'id': 1250507,
                        'name': '维克托港'
                    }
                ]
            },
            {
                'id': 12506,
                'name': '塔斯马尼亚',
                'children': [
                    {
                        'id': 1250600,
                        'name': '伯尼港'
                    },
                    {
                        'id': 1250601,
                        'name': '德文波特'
                    },
                    {
                        'id': 1250602,
                        'name': '霍巴特'
                    },
                    {
                        'id': 1250603,
                        'name': '朗塞斯顿'
                    }
                ]
            },
            {
                'id': 12507,
                'name': '维多利亚',
                'children': [
                    {
                        'id': 1250700,
                        'name': '吉朗'
                    },
                    {
                        'id': 1250701,
                        'name': '墨尔本'
                    }
                ]
            },
            {
                'id': 12508,
                'name': '西澳大利亚',
                'children': [
                    {
                        'id': 1250800,
                        'name': '奥尔巴尼'
                    },
                    {
                        'id': 1250801,
                        'name': '班伯里'
                    },
                    {
                        'id': 1250802,
                        'name': '弗里曼特尔港'
                    },
                    {
                        'id': 1250803,
                        'name': '杰拉尔顿'
                    },
                    {
                        'id': 1250804,
                        'name': '卡尔古利'
                    },
                    {
                        'id': 1250805,
                        'name': '曼哲拉'
                    },
                    {
                        'id': 1250806,
                        'name': '珀斯'
                    }
                ]
            },
            {
                'id': 12509,
                'name': '新南威尔士',
                'children': [
                    {
                        'id': 1250900,
                        'name': '新南威尔士·纽卡斯尔'
                    },
                    {
                        'id': 1250901,
                        'name': '伍伦贡'
                    },
                    {
                        'id': 1250902,
                        'name': '悉尼'
                    }
                ]
            }
        ]
    },
    {
        'id': 126,
        'name': '奥地利',
        'children': [
            {
                'id': 12600,
                'name': '布尔根兰'
            },
            {
                'id': 12601,
                'name': '蒂罗尔'
            },
            {
                'id': 12602,
                'name': '福拉尔贝格'
            },
            {
                'id': 12603,
                'name': '克恩顿'
            },
            {
                'id': 12604,
                'name': '萨尔茨堡'
            },
            {
                'id': 12605,
                'name': '上奥地利'
            },
            {
                'id': 12606,
                'name': '施蒂利亚'
            },
            {
                'id': 12607,
                'name': '维也纳'
            },
            {
                'id': 12608,
                'name': '下奥地利'
            }
        ]
    },
    {
        'id': 127,
        'name': '奥兰群岛'
    },
    {
        'id': 128,
        'name': '巴巴多斯岛'
    },
    {
        'id': 129,
        'name': '巴布亚新几内亚',
        'children': [
            {
                'id': 12900,
                'name': '布干维尔'
            },
            {
                'id': 12901,
                'name': '东塞皮克'
            },
            {
                'id': 12902,
                'name': '东新不列颠'
            },
            {
                'id': 12903,
                'name': '恩加'
            },
            {
                'id': 12904,
                'name': '海湾'
            },
            {
                'id': 12905,
                'name': '马当'
            },
            {
                'id': 12906,
                'name': '马努斯'
            },
            {
                'id': 12907,
                'name': '米尔恩湾'
            },
            {
                'id': 12908,
                'name': '莫尔兹比港'
            },
            {
                'id': 12909,
                'name': '莫罗贝'
            },
            {
                'id': 12910,
                'name': '钦布'
            },
            {
                'id': 12911,
                'name': '桑道恩'
            },
            {
                'id': 12912,
                'name': '西新不列颠'
            },
            {
                'id': 12913,
                'name': '新爱尔兰'
            }
        ]
    },
    {
        'id': 130,
        'name': '巴哈马'
    },
    {
        'id': 131,
        'name': '巴基斯坦',
        'children': [
            {
                'id': 13100,
                'name': '白沙瓦'
            },
            {
                'id': 13101,
                'name': '费萨拉巴德'
            },
            {
                'id': 13102,
                'name': '故吉软瓦拉'
            },
            {
                'id': 13103,
                'name': '海德拉巴'
            },
            {
                'id': 13104,
                'name': '卡拉奇'
            },
            {
                'id': 13105,
                'name': '拉合尔'
            },
            {
                'id': 13106,
                'name': '拉瓦尔品第'
            },
            {
                'id': 13107,
                'name': '木尔坦'
            },
            {
                'id': 13108,
                'name': '伊斯兰堡'
            }
        ]
    },
    {
        'id': 132,
        'name': '巴拉圭',
        'children': [
            {
                'id': 13200,
                'name': '阿曼拜'
            },
            {
                'id': 13201,
                'name': '阿耶斯总统省'
            },
            {
                'id': 13202,
                'name': '巴拉瓜里'
            },
            {
                'id': 13203,
                'name': '博克龙'
            },
            {
                'id': 13204,
                'name': '瓜伊拉'
            },
            {
                'id': 13205,
                'name': '卡瓜苏'
            },
            {
                'id': 13206,
                'name': '卡嫩迪尤'
            },
            {
                'id': 13207,
                'name': '卡萨帕'
            },
            {
                'id': 13208,
                'name': '康塞普西翁'
            },
            {
                'id': 13209,
                'name': '科迪勒拉'
            },
            {
                'id': 13210,
                'name': '米西奥内斯'
            },
            {
                'id': 13211,
                'name': '涅恩布库'
            },
            {
                'id': 13212,
                'name': '圣佩德罗'
            },
            {
                'id': 13213,
                'name': '亚松森特别区'
            },
            {
                'id': 13214,
                'name': '伊塔普亚'
            },
            {
                'id': 13215,
                'name': '巴拉圭·中央'
            }
        ]
    },
    {
        'id': 133,
        'name': '巴勒斯坦',
        'children': [
            {
                'id': 13300,
                'name': '加沙地带'
            },
            {
                'id': 13301,
                'name': '西岸'
            }
        ]
    },
    {
        'id': 134,
        'name': '巴林',
        'children': [
            {
                'id': 13400,
                'name': '哈德'
            },
            {
                'id': 13401,
                'name': '哈马德'
            },
            {
                'id': 13402,
                'name': '里法'
            },
            {
                'id': 13403,
                'name': '麦纳麦'
            },
            {
                'id': 13404,
                'name': '穆哈拉格'
            },
            {
                'id': 13405,
                'name': '伊萨城'
            }
        ]
    },
    {
        'id': 135,
        'name': '巴拿马'
    },
    {
        'id': 136,
        'name': '巴西',
        'children': [
            {
                'id': 13600,
                'name': '阿克里'
            },
            {
                'id': 13601,
                'name': '阿拉戈斯'
            },
            {
                'id': 13602,
                'name': '阿马帕'
            },
            {
                'id': 13603,
                'name': '巴拉那'
            },
            {
                'id': 13604,
                'name': '巴西利亚'
            },
            {
                'id': 13605,
                'name': '巴伊亚'
            },
            {
                'id': 13606,
                'name': '北里奥格兰德'
            },
            {
                'id': 13607,
                'name': '伯南布哥'
            },
            {
                'id': 13608,
                'name': '戈亚斯'
            },
            {
                'id': 13609,
                'name': '朗多尼亚'
            },
            {
                'id': 13610,
                'name': '里约热内卢'
            },
            {
                'id': 13611,
                'name': '罗赖马'
            },
            {
                'id': 13612,
                'name': '马拉尼昂'
            },
            {
                'id': 13613,
                'name': '马托格罗索'
            },
            {
                'id': 13614,
                'name': '米纳斯吉拉斯'
            },
            {
                'id': 13615,
                'name': '南里奥格兰德'
            },
            {
                'id': 13616,
                'name': '南马托格罗索'
            },
            {
                'id': 13617,
                'name': '帕拉'
            },
            {
                'id': 13618,
                'name': '帕拉伊巴'
            },
            {
                'id': 13619,
                'name': '皮奥伊'
            },
            {
                'id': 13620,
                'name': '塞阿拉'
            },
            {
                'id': 13621,
                'name': '塞尔希培'
            },
            {
                'id': 13622,
                'name': '圣埃斯皮里图'
            },
            {
                'id': 13623,
                'name': '巴西·圣保罗'
            },
            {
                'id': 13624,
                'name': '巴西·圣卡塔琳娜'
            },
            {
                'id': 13625,
                'name': '托坎廷斯'
            },
            {
                'id': 13626,
                'name': '巴西·亚马逊'
            }
        ]
    },
    {
        'id': 137,
        'name': '白俄罗斯',
        'children': [
            {
                'id': 13700,
                'name': '布列斯特'
            },
            {
                'id': 13701,
                'name': '戈梅利'
            },
            {
                'id': 13702,
                'name': '格罗德诺'
            },
            {
                'id': 13703,
                'name': '明斯克市'
            },
            {
                'id': 13704,
                'name': '莫吉廖夫'
            },
            {
                'id': 13705,
                'name': '维捷布斯克'
            }
        ]
    },
    {
        'id': 138,
        'name': '百慕大'
    },
    {
        'id': 139,
        'name': '保加利亚',
        'children': [
            {
                'id': 13900,
                'name': '布尔加斯'
            },
            {
                'id': 13901,
                'name': '卡斯科伏'
            },
            {
                'id': 13902,
                'name': '鲁塞'
            },
            {
                'id': 13903,
                'name': '洛维奇'
            },
            {
                'id': 13904,
                'name': '蒙塔纳'
            },
            {
                'id': 13905,
                'name': '普罗夫迪夫'
            },
            {
                'id': 13906,
                'name': '索非亚'
            },
            {
                'id': 13907,
                'name': '索非亚市'
            },
            {
                'id': 13908,
                'name': '瓦尔纳'
            }
        ]
    },
    {
        'id': 140,
        'name': '北马里亚纳群岛'
    },
    {
        'id': 141,
        'name': '贝宁',
        'children': [
            {
                'id': 14100,
                'name': '阿黎博里'
            },
            {
                'id': 14101,
                'name': '阿塔科拉'
            },
            {
                'id': 14102,
                'name': '贝宁·滨海'
            },
            {
                'id': 14103,
                'name': '波希康市'
            },
            {
                'id': 14104,
                'name': '博尔古'
            },
            {
                'id': 14105,
                'name': '贝宁·大西洋'
            },
            {
                'id': 14106,
                'name': '高原'
            },
            {
                'id': 14107,
                'name': '库福'
            },
            {
                'id': 14108,
                'name': '莫诺'
            },
            {
                'id': 14109,
                'name': '丘陵'
            },
            {
                'id': 14110,
                'name': '韦梅'
            },
            {
                'id': 14111,
                'name': '峡谷'
            },
            {
                'id': 14112,
                'name': '祖'
            }
        ]
    },
    {
        'id': 142,
        'name': '比利时',
        'children': [
            {
                'id': 14200,
                'name': '埃诺'
            },
            {
                'id': 14201,
                'name': '安特卫普'
            },
            {
                'id': 14202,
                'name': '布拉班特-瓦隆'
            },
            {
                'id': 14203,
                'name': '布鲁塞尔'
            },
            {
                'id': 14204,
                'name': '东佛兰德'
            },
            {
                'id': 14205,
                'name': '佛兰芒-布拉班特'
            },
            {
                'id': 14206,
                'name': '列日'
            },
            {
                'id': 14207,
                'name': '林堡'
            },
            {
                'id': 14208,
                'name': '比利时·卢森堡'
            },
            {
                'id': 14209,
                'name': '那慕尔'
            },
            {
                'id': 14210,
                'name': '西佛兰德'
            }
        ]
    },
    {
        'id': 143,
        'name': '冰岛'
    },
    {
        'id': 144,
        'name': '波多黎各'
    },
    {
        'id': 145,
        'name': '波兰',
        'children': [
            {
                'id': 14500,
                'name': '埃尔布隆格'
            },
            {
                'id': 14501,
                'name': '奥尔什丁'
            },
            {
                'id': 14502,
                'name': '奥斯特罗文卡'
            },
            {
                'id': 14503,
                'name': '比得哥什'
            },
            {
                'id': 14504,
                'name': '彼得库夫'
            },
            {
                'id': 14505,
                'name': '比托姆'
            },
            {
                'id': 14506,
                'name': '比亚瓦波德拉斯卡'
            },
            {
                'id': 14507,
                'name': '比亚维斯托克'
            },
            {
                'id': 14508,
                'name': '波莱'
            },
            {
                'id': 14509,
                'name': '波兹南'
            },
            {
                'id': 14510,
                'name': '达布罗瓦戈尼察'
            },
            {
                'id': 14511,
                'name': '大波兰地区戈茹夫'
            },
            {
                'id': 14512,
                'name': '弗罗茨瓦夫'
            },
            {
                'id': 14513,
                'name': '弗沃茨瓦韦克'
            },
            {
                'id': 14514,
                'name': '格但斯克'
            },
            {
                'id': 14515,
                'name': '格丁尼亚'
            },
            {
                'id': 14516,
                'name': '格利维采'
            },
            {
                'id': 14517,
                'name': '格鲁琼兹'
            },
            {
                'id': 14518,
                'name': '海乌姆'
            },
            {
                'id': 14519,
                'name': '华沙'
            },
            {
                'id': 14520,
                'name': '霍茹夫'
            },
            {
                'id': 14521,
                'name': '卡利什'
            },
            {
                'id': 14522,
                'name': '卡托维兹'
            },
            {
                'id': 14523,
                'name': '凯尔采'
            },
            {
                'id': 14524,
                'name': '科宁'
            },
            {
                'id': 14525,
                'name': '科沙林'
            },
            {
                'id': 14526,
                'name': '克拉科夫'
            },
            {
                'id': 14527,
                'name': '克罗斯诺'
            },
            {
                'id': 14528,
                'name': '拉多姆'
            },
            {
                'id': 14529,
                'name': '莱格尼察'
            },
            {
                'id': 14530,
                'name': '莱什诺'
            },
            {
                'id': 14531,
                'name': '卢布林'
            },
            {
                'id': 14532,
                'name': '鲁达'
            },
            {
                'id': 14533,
                'name': '罗兹'
            },
            {
                'id': 14534,
                'name': '绿山城'
            },
            {
                'id': 14535,
                'name': '米什洛维采'
            },
            {
                'id': 14536,
                'name': '皮瓦'
            },
            {
                'id': 14537,
                'name': '普热梅希尔'
            },
            {
                'id': 14538,
                'name': '普沃茨克'
            },
            {
                'id': 14539,
                'name': '切哈努夫'
            },
            {
                'id': 14540,
                'name': '热舒夫'
            },
            {
                'id': 14541,
                'name': '什切青'
            },
            {
                'id': 14542,
                'name': '斯凯尔涅维采'
            },
            {
                'id': 14543,
                'name': '斯武普斯克'
            },
            {
                'id': 14544,
                'name': '苏瓦乌基'
            },
            {
                'id': 14545,
                'name': '索波特'
            },
            {
                'id': 14546,
                'name': '索斯诺维茨'
            },
            {
                'id': 14547,
                'name': '塔尔努夫'
            },
            {
                'id': 14548,
                'name': '塔尔诺布热格'
            },
            {
                'id': 14549,
                'name': '特切'
            },
            {
                'id': 14550,
                'name': '托伦'
            },
            {
                'id': 14551,
                'name': '瓦乌布日赫'
            },
            {
                'id': 14552,
                'name': '沃姆扎'
            },
            {
                'id': 14553,
                'name': '希米亚诺维采'
            },
            {
                'id': 14554,
                'name': '希维诺乌伊希切'
            },
            {
                'id': 14555,
                'name': '希维托赫洛维采'
            },
            {
                'id': 14556,
                'name': '谢德尔采'
            },
            {
                'id': 14557,
                'name': '谢拉兹'
            },
            {
                'id': 14558,
                'name': '新松奇'
            },
            {
                'id': 14559,
                'name': '雅沃兹诺'
            },
            {
                'id': 14560,
                'name': '耶莱尼亚古拉'
            },
            {
                'id': 14561,
                'name': '扎布热'
            },
            {
                'id': 14562,
                'name': '扎莫希奇'
            }
        ]
    },
    {
        'id': 146,
        'name': '玻利维亚',
        'children': [
            {
                'id': 14600,
                'name': '奥尔托'
            },
            {
                'id': 14601,
                'name': '奥鲁罗'
            },
            {
                'id': 14602,
                'name': '贝尼'
            },
            {
                'id': 14603,
                'name': '波多西'
            },
            {
                'id': 14604,
                'name': '基拉科洛'
            },
            {
                'id': 14605,
                'name': '科恰班巴'
            },
            {
                'id': 14606,
                'name': '玻利维亚·拉巴斯'
            },
            {
                'id': 14607,
                'name': '潘多'
            },
            {
                'id': 14608,
                'name': '丘基萨卡'
            },
            {
                'id': 14609,
                'name': '萨卡巴'
            },
            {
                'id': 14610,
                'name': '玻利维亚·圣克鲁斯'
            },
            {
                'id': 14611,
                'name': '塔里哈'
            }
        ]
    },
    {
        'id': 147,
        'name': '波斯尼亚和黑塞哥维那',
        'children': [
            {
                'id': 14700,
                'name': '波萨维纳'
            },
            {
                'id': 14701,
                'name': '波斯尼亚－波德里涅'
            },
            {
                'id': 14702,
                'name': '多米斯拉夫格勒'
            },
            {
                'id': 14703,
                'name': '黑塞哥维那－涅雷特瓦'
            },
            {
                'id': 14704,
                'name': '萨拉热窝'
            },
            {
                'id': 14705,
                'name': '图兹拉－波德里涅'
            },
            {
                'id': 14706,
                'name': '乌纳－萨纳'
            },
            {
                'id': 14707,
                'name': '西波斯尼亚'
            },
            {
                'id': 14708,
                'name': '西黑塞哥维那'
            },
            {
                'id': 14709,
                'name': '泽尼察－多博伊'
            },
            {
                'id': 14710,
                'name': '中波斯尼亚'
            }
        ]
    },
    {
        'id': 148,
        'name': '博茨瓦纳'
    },
    {
        'id': 149,
        'name': '伯利兹',
        'children': [
            {
                'id': 14900,
                'name': '伯利兹·伯利兹'
            },
            {
                'id': 14901,
                'name': '橘园'
            },
            {
                'id': 14902,
                'name': '卡约'
            },
            {
                'id': 14903,
                'name': '科罗萨尔'
            },
            {
                'id': 14904,
                'name': '斯坦港'
            },
            {
                'id': 14905,
                'name': '伯利兹·托莱多'
            }
        ]
    },
    {
        'id': 150,
        'name': '不丹'
    },
    {
        'id': 151,
        'name': '布基纳法索',
        'children': [
            {
                'id': 15100,
                'name': '巴雷'
            },
            {
                'id': 15101,
                'name': '巴姆'
            },
            {
                'id': 15102,
                'name': '巴瓦'
            },
            {
                'id': 15103,
                'name': '巴泽加'
            },
            {
                'id': 15104,
                'name': '波尼'
            },
            {
                'id': 15105,
                'name': '布尔古'
            },
            {
                'id': 15106,
                'name': '布尔基恩德'
            },
            {
                'id': 15107,
                'name': '布古里巴'
            },
            {
                'id': 15108,
                'name': '冈祖尔古'
            },
            {
                'id': 15109,
                'name': '古尔马'
            },
            {
                'id': 15110,
                'name': '济罗'
            },
            {
                'id': 15111,
                'name': '卡焦戈'
            },
            {
                'id': 15112,
                'name': '凯内杜古'
            },
            {
                'id': 15113,
                'name': '科蒙加里'
            },
            {
                'id': 15114,
                'name': '科莫埃'
            },
            {
                'id': 15115,
                'name': '孔皮恩加'
            },
            {
                'id': 15116,
                'name': '孔西'
            },
            {
                'id': 15117,
                'name': '库尔佩罗戈'
            },
            {
                'id': 15118,
                'name': '库尔维奥戈'
            },
            {
                'id': 15119,
                'name': '库里滕加'
            },
            {
                'id': 15120,
                'name': '雷拉巴'
            },
            {
                'id': 15121,
                'name': '罗卢姆'
            },
            {
                'id': 15122,
                'name': '穆翁'
            },
            {
                'id': 15123,
                'name': '纳门滕加'
            },
            {
                'id': 15124,
                'name': '纳乌里'
            },
            {
                'id': 15125,
                'name': '纳亚拉'
            },
            {
                'id': 15126,
                'name': '尼亚尼亚'
            },
            {
                'id': 15127,
                'name': '努姆比埃尔'
            },
            {
                'id': 15128,
                'name': '帕索雷'
            },
            {
                'id': 15129,
                'name': '塞诺'
            },
            {
                'id': 15130,
                'name': '桑吉'
            },
            {
                'id': 15131,
                'name': '桑马滕加'
            },
            {
                'id': 15132,
                'name': '苏鲁'
            },
            {
                'id': 15133,
                'name': '苏姆'
            },
            {
                'id': 15134,
                'name': '塔波阿'
            },
            {
                'id': 15135,
                'name': '图伊'
            },
            {
                'id': 15136,
                'name': '乌埃'
            },
            {
                'id': 15137,
                'name': '乌布里滕加'
            },
            {
                'id': 15138,
                'name': '乌达兰'
            },
            {
                'id': 15139,
                'name': '锡西里'
            },
            {
                'id': 15140,
                'name': '亚加'
            },
            {
                'id': 15141,
                'name': '亚滕加'
            },
            {
                'id': 15142,
                'name': '伊奥巴'
            },
            {
                'id': 15143,
                'name': '宗德韦奥戈'
            },
            {
                'id': 15144,
                'name': '宗多马'
            }
        ]
    },
    {
        'id': 152,
        'name': '布隆迪',
        'children': [
            {
                'id': 15200,
                'name': '布班扎'
            },
            {
                'id': 15201,
                'name': '布鲁里'
            },
            {
                'id': 15202,
                'name': '布琼布拉城市'
            },
            {
                'id': 15203,
                'name': '布琼布拉乡村'
            },
            {
                'id': 15204,
                'name': '恩戈齐'
            },
            {
                'id': 15205,
                'name': '基龙多'
            },
            {
                'id': 15206,
                'name': '基特加'
            },
            {
                'id': 15207,
                'name': '卡鲁济'
            },
            {
                'id': 15208,
                'name': '卡扬扎'
            },
            {
                'id': 15209,
                'name': '坎库佐'
            },
            {
                'id': 15210,
                'name': '鲁塔纳'
            },
            {
                'id': 15211,
                'name': '鲁伊吉'
            },
            {
                'id': 15212,
                'name': '马坎巴'
            },
            {
                'id': 15213,
                'name': '穆拉姆维亚'
            },
            {
                'id': 15214,
                'name': '穆瓦洛'
            },
            {
                'id': 15215,
                'name': '穆因加'
            },
            {
                'id': 15216,
                'name': '锡比托凯'
            }
        ]
    },
    {
        'id': 153,
        'name': '布韦岛'
    },
    {
        'id': 154,
        'name': '朝鲜',
        'children': [
            {
                'id': 15400,
                'name': '海州'
            },
            {
                'id': 15401,
                'name': '惠山'
            },
            {
                'id': 15402,
                'name': '江界'
            },
            {
                'id': 15403,
                'name': '开城'
            },
            {
                'id': 15404,
                'name': '罗先'
            },
            {
                'id': 15405,
                'name': '南浦'
            },
            {
                'id': 15406,
                'name': '平壤'
            },
            {
                'id': 15407,
                'name': '清津'
            },
            {
                'id': 15408,
                'name': '沙里院'
            },
            {
                'id': 15409,
                'name': '咸兴'
            },
            {
                'id': 15410,
                'name': '新义州'
            },
            {
                'id': 15411,
                'name': '元山'
            }
        ]
    },
    {
        'id': 155,
        'name': '丹麦',
        'children': [
            {
                'id': 15500,
                'name': '奥胡斯'
            },
            {
                'id': 15501,
                'name': '北日德兰'
            },
            {
                'id': 15502,
                'name': '博恩霍尔姆'
            },
            {
                'id': 15503,
                'name': '菲特烈堡'
            },
            {
                'id': 15504,
                'name': '菲茵'
            },
            {
                'id': 15505,
                'name': '哥本哈根'
            },
            {
                'id': 15506,
                'name': '里伯'
            },
            {
                'id': 15507,
                'name': '灵克宾'
            },
            {
                'id': 15508,
                'name': '罗斯基勒'
            },
            {
                'id': 15509,
                'name': '南日德兰'
            },
            {
                'id': 15510,
                'name': '斯多斯特姆'
            },
            {
                'id': 15511,
                'name': '维堡'
            },
            {
                'id': 15512,
                'name': '维厄勒'
            },
            {
                'id': 15513,
                'name': '西希兰'
            }
        ]
    },
    {
        'id': 156,
        'name': '东帝汶',
        'children': [
            {
                'id': 15600,
                'name': '阿伊莱乌'
            },
            {
                'id': 15601,
                'name': '阿伊纳罗'
            },
            {
                'id': 15602,
                'name': '埃尔梅拉'
            },
            {
                'id': 15603,
                'name': '安贝诺'
            },
            {
                'id': 15604,
                'name': '包考'
            },
            {
                'id': 15605,
                'name': '博博纳罗'
            },
            {
                'id': 15606,
                'name': '帝力'
            },
            {
                'id': 15607,
                'name': '科瓦利马'
            },
            {
                'id': 15608,
                'name': '劳滕'
            },
            {
                'id': 15609,
                'name': '利基卡'
            },
            {
                'id': 15610,
                'name': '马纳图托'
            },
            {
                'id': 15611,
                'name': '马努法伊'
            },
            {
                'id': 15612,
                'name': '维克克'
            }
        ]
    },
    {
        'id': 157,
        'name': '多哥',
        'children': [
            {
                'id': 15700,
                'name': '滨海区'
            },
            {
                'id': 15701,
                'name': '草原区'
            },
            {
                'id': 15702,
                'name': '高原区'
            },
            {
                'id': 15703,
                'name': '卡拉区'
            }
        ]
    },
    {
        'id': 158,
        'name': '多米尼加'
    },
    {
        'id': 159,
        'name': '多米尼加共和国'
    },
    {
        'id': 160,
        'name': '厄瓜多尔',
        'children': [
            {
                'id': 16000,
                'name': '阿苏艾'
            },
            {
                'id': 16001,
                'name': '埃尔奥罗'
            },
            {
                'id': 16002,
                'name': '埃斯梅拉尔达斯'
            },
            {
                'id': 16003,
                'name': '厄瓜多尔·玻利瓦尔'
            },
            {
                'id': 16004,
                'name': '瓜亚斯'
            },
            {
                'id': 16005,
                'name': '加拉帕戈斯'
            },
            {
                'id': 16006,
                'name': '卡尔奇'
            },
            {
                'id': 16007,
                'name': '卡尼亚尔'
            },
            {
                'id': 16008,
                'name': '科托帕希'
            },
            {
                'id': 16009,
                'name': '洛哈'
            },
            {
                'id': 16010,
                'name': '洛斯里奥斯'
            },
            {
                'id': 16011,
                'name': '马纳比'
            },
            {
                'id': 16012,
                'name': '莫罗纳－圣地亚哥'
            },
            {
                'id': 16013,
                'name': '纳波，奥雷利亚纳'
            },
            {
                'id': 16014,
                'name': '帕斯塔萨'
            },
            {
                'id': 16015,
                'name': '皮钦查'
            },
            {
                'id': 16016,
                'name': '钦博拉索'
            },
            {
                'id': 16017,
                'name': '萨莫拉－钦奇佩'
            },
            {
                'id': 16018,
                'name': '苏昆毕奥斯'
            },
            {
                'id': 16019,
                'name': '通古拉瓦'
            },
            {
                'id': 16020,
                'name': '因巴布拉'
            }
        ]
    },
    {
        'id': 161,
        'name': '厄立特里亚',
        'children': [
            {
                'id': 16100,
                'name': '安塞巴'
            },
            {
                'id': 16101,
                'name': '北红海'
            },
            {
                'id': 16102,
                'name': '加什·巴尔卡'
            },
            {
                'id': 16103,
                'name': '南红海'
            }
        ]
    },
    {
        'id': 162,
        'name': '法罗群岛'
    },
    {
        'id': 163,
        'name': '法属波利尼西亚'
    },
    {
        'id': 164,
        'name': '法属圭亚那'
    },
    {
        'id': 165,
        'name': '法属南部领地'
    },
    {
        'id': 166,
        'name': '梵蒂冈'
    },
    {
        'id': 167,
        'name': '菲律宾',
        'children': [
            {
                'id': 16700,
                'name': '达沃'
            },
            {
                'id': 16701,
                'name': '卡卢坎'
            },
            {
                'id': 16702,
                'name': '马尼拉'
            },
            {
                'id': 16703,
                'name': '宿务'
            }
        ]
    },
    {
        'id': 168,
        'name': '斐济'
    },
    {
        'id': 169,
        'name': '芬兰',
        'children': [
            {
                'id': 16900,
                'name': '埃斯波'
            },
            {
                'id': 16901,
                'name': '奥卢'
            },
            {
                'id': 16902,
                'name': '波里'
            },
            {
                'id': 16903,
                'name': '博尔沃'
            },
            {
                'id': 16904,
                'name': '海门林纳'
            },
            {
                'id': 16905,
                'name': '赫尔辛基'
            },
            {
                'id': 16906,
                'name': '卡亚尼'
            },
            {
                'id': 16907,
                'name': '科科拉'
            },
            {
                'id': 16908,
                'name': '科特卡'
            },
            {
                'id': 16909,
                'name': '库奥皮奥'
            },
            {
                'id': 16910,
                'name': '拉赫蒂'
            },
            {
                'id': 16911,
                'name': '拉彭兰塔'
            },
            {
                'id': 16912,
                'name': '罗瓦涅米'
            },
            {
                'id': 16913,
                'name': '玛丽港'
            },
            {
                'id': 16914,
                'name': '米凯利'
            },
            {
                'id': 16915,
                'name': '坦佩雷'
            },
            {
                'id': 16916,
                'name': '图尔库'
            },
            {
                'id': 16917,
                'name': '瓦萨'
            },
            {
                'id': 16918,
                'name': '万塔'
            },
            {
                'id': 16919,
                'name': '约恩苏'
            }
        ]
    },
    {
        'id': 170,
        'name': '佛得角',
        'children': [
            {
                'id': 17000,
                'name': '保尔'
            },
            {
                'id': 17001,
                'name': '波多诺伏'
            },
            {
                'id': 17002,
                'name': '博阿维斯塔岛'
            },
            {
                'id': 17003,
                'name': '布拉瓦岛'
            },
            {
                'id': 17004,
                'name': '大里贝拉'
            },
            {
                'id': 17005,
                'name': '福古岛'
            },
            {
                'id': 17006,
                'name': '马尤岛'
            },
            {
                'id': 17007,
                'name': '莫斯特罗'
            },
            {
                'id': 17008,
                'name': '普拉亚'
            },
            {
                'id': 17009,
                'name': '萨尔岛'
            },
            {
                'id': 17010,
                'name': '圣安唐岛'
            },
            {
                'id': 17011,
                'name': '圣地亚哥岛'
            },
            {
                'id': 17012,
                'name': '圣多明戈'
            },
            {
                'id': 17013,
                'name': '圣菲利普'
            },
            {
                'id': 17014,
                'name': '佛得角·圣卡塔琳娜'
            },
            {
                'id': 17015,
                'name': '圣克鲁斯'
            },
            {
                'id': 17016,
                'name': '圣米戈尔'
            },
            {
                'id': 17017,
                'name': '圣尼古拉岛'
            },
            {
                'id': 17018,
                'name': '圣维森特岛'
            },
            {
                'id': 17019,
                'name': '塔拉法尔'
            }
        ]
    },
    {
        'id': 171,
        'name': '弗兰克群岛'
    },
    {
        'id': 172,
        'name': '冈比亚'
    },
    {
        'id': 173,
        'name': '刚果'
    },
    {
        'id': 174,
        'name': '刚果民主共和国'
    },
    {
        'id': 175,
        'name': '哥伦比亚',
        'children': [
            {
                'id': 17500,
                'name': '阿劳卡'
            },
            {
                'id': 17501,
                'name': '安提奥基亚'
            },
            {
                'id': 17502,
                'name': '北桑坦德'
            },
            {
                'id': 17503,
                'name': '波哥大首都区'
            },
            {
                'id': 17504,
                'name': '博利瓦尔'
            },
            {
                'id': 17505,
                'name': '博亚卡'
            },
            {
                'id': 17506,
                'name': '哥伦比亚·大西洋'
            },
            {
                'id': 17507,
                'name': '瓜维亚雷'
            },
            {
                'id': 17508,
                'name': '瓜希拉'
            },
            {
                'id': 17509,
                'name': '瓜伊尼亚'
            },
            {
                'id': 17510,
                'name': '金迪奥'
            },
            {
                'id': 17511,
                'name': '卡尔达斯'
            },
            {
                'id': 17512,
                'name': '卡克塔'
            },
            {
                'id': 17513,
                'name': '卡萨纳雷'
            },
            {
                'id': 17514,
                'name': '考卡'
            },
            {
                'id': 17515,
                'name': '考卡山谷'
            },
            {
                'id': 17516,
                'name': '科尔多巴'
            },
            {
                'id': 17517,
                'name': '昆迪纳马卡'
            },
            {
                'id': 17518,
                'name': '利萨拉尔达'
            },
            {
                'id': 17519,
                'name': '马格达雷那'
            },
            {
                'id': 17520,
                'name': '梅塔'
            },
            {
                'id': 17521,
                'name': '纳里尼奥'
            },
            {
                'id': 17522,
                'name': '普图马约'
            },
            {
                'id': 17523,
                'name': '乔科'
            },
            {
                'id': 17524,
                'name': '塞萨尔'
            },
            {
                'id': 17525,
                'name': '哥伦比亚·桑坦德'
            },
            {
                'id': 17526,
                'name': '圣安德烈斯-普罗维登西亚'
            },
            {
                'id': 17527,
                'name': '哥伦比亚·苏克雷'
            },
            {
                'id': 17528,
                'name': '托利马'
            },
            {
                'id': 17529,
                'name': '维查达'
            },
            {
                'id': 17530,
                'name': '沃佩斯'
            },
            {
                'id': 17531,
                'name': '乌伊拉'
            },
            {
                'id': 17532,
                'name': '哥伦比亚·亚马逊'
            }
        ]
    },
    {
        'id': 176,
        'name': '哥斯达黎加',
        'children': [
            {
                'id': 17600,
                'name': '阿拉胡埃拉'
            },
            {
                'id': 17601,
                'name': '埃雷迪亚'
            },
            {
                'id': 17602,
                'name': '瓜纳卡斯特'
            },
            {
                'id': 17603,
                'name': '卡塔戈'
            },
            {
                'id': 17604,
                'name': '利蒙'
            },
            {
                'id': 17605,
                'name': '蓬塔雷纳斯'
            },
            {
                'id': 17606,
                'name': '哥斯达黎加·圣何塞'
            }
        ]
    },
    {
        'id': 177,
        'name': '格恩西岛'
    },
    {
        'id': 178,
        'name': '格林纳达'
    },
    {
        'id': 179,
        'name': '格陵兰'
    },
    {
        'id': 180,
        'name': '古巴',
        'children': [
            {
                'id': 18000,
                'name': '奥尔金'
            },
            {
                'id': 18001,
                'name': '比那尔德里奥'
            },
            {
                'id': 18002,
                'name': '比亚克拉拉'
            },
            {
                'id': 18003,
                'name': '格拉玛'
            },
            {
                'id': 18004,
                'name': '关塔那摩'
            },
            {
                'id': 18005,
                'name': '哈瓦那'
            },
            {
                'id': 18006,
                'name': '哈瓦那城'
            },
            {
                'id': 18007,
                'name': '卡马圭'
            },
            {
                'id': 18008,
                'name': '拉斯图纳斯'
            },
            {
                'id': 18009,
                'name': '马坦萨斯'
            },
            {
                'id': 18010,
                'name': '马亚里'
            },
            {
                'id': 18011,
                'name': '曼萨尼罗'
            },
            {
                'id': 18012,
                'name': '青年岛特区'
            },
            {
                'id': 18013,
                'name': '古巴·圣地亚哥'
            },
            {
                'id': 18014,
                'name': '圣斯皮里图斯'
            },
            {
                'id': 18015,
                'name': '西恩富戈斯'
            },
            {
                'id': 18016,
                'name': '谢戈德阿维拉'
            }
        ]
    },
    {
        'id': 181,
        'name': '瓜德罗普'
    },
    {
        'id': 182,
        'name': '关岛'
    },
    {
        'id': 183,
        'name': '圭亚那',
        'children': [
            {
                'id': 18300,
                'name': '埃塞奎博群岛-西德梅拉拉'
            },
            {
                'id': 18301,
                'name': '巴里马-瓦伊尼'
            },
            {
                'id': 18302,
                'name': '波默伦-苏佩纳姆'
            },
            {
                'id': 18303,
                'name': '波塔罗-锡帕鲁尼'
            },
            {
                'id': 18304,
                'name': '德梅拉拉-马海卡'
            },
            {
                'id': 18305,
                'name': '东伯比斯-科兰太因'
            },
            {
                'id': 18306,
                'name': '库尤尼-马扎鲁尼'
            },
            {
                'id': 18307,
                'name': '马海卡-伯比斯'
            },
            {
                'id': 18308,
                'name': '上德梅拉拉-伯比斯'
            },
            {
                'id': 18309,
                'name': '上塔库图-上埃塞奎博'
            }
        ]
    },
    {
        'id': 184,
        'name': '哈萨克斯坦',
        'children': [
            {
                'id': 18400,
                'name': '阿尔卡累克'
            },
            {
                'id': 18401,
                'name': '阿克莫拉'
            },
            {
                'id': 18402,
                'name': '阿克苏'
            },
            {
                'id': 18403,
                'name': '阿克托别'
            },
            {
                'id': 18404,
                'name': '阿拉木图'
            },
            {
                'id': 18405,
                'name': '阿雷斯'
            },
            {
                'id': 18406,
                'name': '阿斯塔纳市'
            },
            {
                'id': 18407,
                'name': '阿特劳'
            },
            {
                'id': 18408,
                'name': '埃基巴斯图兹'
            },
            {
                'id': 18409,
                'name': '巴尔喀什'
            },
            {
                'id': 18410,
                'name': '巴甫洛达尔'
            },
            {
                'id': 18411,
                'name': '北哈萨克斯坦'
            },
            {
                'id': 18412,
                'name': '东哈萨克斯坦'
            },
            {
                'id': 18413,
                'name': '济良诺夫斯克'
            },
            {
                'id': 18414,
                'name': '江布尔'
            },
            {
                'id': 18415,
                'name': '杰兹卡兹甘'
            },
            {
                'id': 18416,
                'name': '卡拉干达'
            },
            {
                'id': 18417,
                'name': '卡拉扎尔'
            },
            {
                'id': 18418,
                'name': '卡普恰盖'
            },
            {
                'id': 18419,
                'name': '科斯塔奈'
            },
            {
                'id': 18420,
                'name': '克孜勒奥尔达'
            },
            {
                'id': 18421,
                'name': '肯套'
            },
            {
                'id': 18422,
                'name': '库尔恰托夫'
            },
            {
                'id': 18423,
                'name': '利萨科夫斯克'
            },
            {
                'id': 18424,
                'name': '列宁诺戈尔斯克'
            },
            {
                'id': 18425,
                'name': '鲁德内'
            },
            {
                'id': 18426,
                'name': '曼格斯套'
            },
            {
                'id': 18427,
                'name': '南哈萨克斯坦'
            },
            {
                'id': 18428,
                'name': '萨兰'
            },
            {
                'id': 18429,
                'name': '塞梅伊'
            },
            {
                'id': 18430,
                'name': '沙赫京斯克'
            },
            {
                'id': 18431,
                'name': '斯捷普诺戈尔斯克'
            },
            {
                'id': 18432,
                'name': '铁克利'
            },
            {
                'id': 18433,
                'name': '铁米尔套'
            },
            {
                'id': 18434,
                'name': '突厥斯坦'
            },
            {
                'id': 18435,
                'name': '西哈萨克斯坦'
            },
            {
                'id': 18436,
                'name': '扎纳奥津'
            }
        ]
    },
    {
        'id': 185,
        'name': '海地'
    },
    {
        'id': 186,
        'name': '荷兰',
        'children': [
            {
                'id': 18600,
                'name': '阿尔梅勒'
            },
            {
                'id': 18601,
                'name': '阿默斯福特'
            },
            {
                'id': 18602,
                'name': '阿姆斯特丹'
            },
            {
                'id': 18603,
                'name': '阿纳姆'
            },
            {
                'id': 18604,
                'name': '阿珀尔多伦'
            },
            {
                'id': 18605,
                'name': '阿森'
            },
            {
                'id': 18606,
                'name': '埃德'
            },
            {
                'id': 18607,
                'name': '埃门'
            },
            {
                'id': 18608,
                'name': '埃因霍芬'
            },
            {
                'id': 18609,
                'name': '布雷达'
            },
            {
                'id': 18610,
                'name': '蒂尔堡'
            },
            {
                'id': 18611,
                'name': '多德雷赫特'
            },
            {
                'id': 18612,
                'name': '恩斯赫德'
            },
            {
                'id': 18613,
                'name': '格罗宁根'
            },
            {
                'id': 18614,
                'name': '哈勒姆'
            },
            {
                'id': 18615,
                'name': '海牙'
            },
            {
                'id': 18616,
                'name': '霍夫多尔普'
            },
            {
                'id': 18617,
                'name': '莱顿'
            },
            {
                'id': 18618,
                'name': '莱利斯塔德'
            },
            {
                'id': 18619,
                'name': '鹿特丹'
            },
            {
                'id': 18620,
                'name': '吕伐登'
            },
            {
                'id': 18621,
                'name': '马斯特里赫特'
            },
            {
                'id': 18622,
                'name': '荷兰·米德尔堡'
            },
            {
                'id': 18623,
                'name': '奈梅亨'
            },
            {
                'id': 18624,
                'name': '斯海尔托亨博思'
            },
            {
                'id': 18625,
                'name': '乌得勒支'
            },
            {
                'id': 18626,
                'name': '兹沃勒'
            },
            {
                'id': 18627,
                'name': '佐特尔梅'
            }
        ]
    },
    {
        'id': 187,
        'name': '荷属安地列斯'
    },
    {
        'id': 188,
        'name': '赫德和麦克唐纳群岛'
    },
    {
        'id': 189,
        'name': '洪都拉斯',
        'children': [
            {
                'id': 18900,
                'name': '阿特兰蒂达'
            },
            {
                'id': 18901,
                'name': '埃尔帕拉伊索'
            },
            {
                'id': 18902,
                'name': '奥科特佩克'
            },
            {
                'id': 18903,
                'name': '奥兰乔'
            },
            {
                'id': 18904,
                'name': '弗朗西斯科-莫拉桑'
            },
            {
                'id': 18905,
                'name': '格拉西亚斯-阿迪奥斯'
            },
            {
                'id': 18906,
                'name': '海湾群岛'
            },
            {
                'id': 18907,
                'name': '科尔特斯'
            },
            {
                'id': 18908,
                'name': '科隆'
            },
            {
                'id': 18909,
                'name': '科马亚瓜'
            },
            {
                'id': 18910,
                'name': '科潘'
            },
            {
                'id': 18911,
                'name': '洪都拉斯·拉巴斯'
            },
            {
                'id': 18912,
                'name': '伦皮拉'
            },
            {
                'id': 18913,
                'name': '乔卢特卡'
            },
            {
                'id': 18914,
                'name': '乔罗马'
            },
            {
                'id': 18915,
                'name': '山谷'
            },
            {
                'id': 18916,
                'name': '圣巴巴拉'
            },
            {
                'id': 18917,
                'name': '因蒂布卡'
            },
            {
                'id': 18918,
                'name': '约罗'
            }
        ]
    },
    {
        'id': 190,
        'name': '基里巴斯',
        'children': [
            {
                'id': 19000,
                'name': '菲尼克斯群岛'
            },
            {
                'id': 19001,
                'name': '吉尔伯特群岛'
            },
            {
                'id': 19002,
                'name': '莱恩群岛'
            }
        ]
    },
    {
        'id': 191,
        'name': '吉布提',
        'children': [
            {
                'id': 19100,
                'name': '阿里萨比赫区'
            },
            {
                'id': 19101,
                'name': '奥博克区'
            },
            {
                'id': 19102,
                'name': '迪基勒区'
            },
            {
                'id': 19103,
                'name': '塔朱拉区'
            }
        ]
    },
    {
        'id': 192,
        'name': '吉尔吉斯斯坦',
        'children': [
            {
                'id': 19200,
                'name': '奥什'
            },
            {
                'id': 19201,
                'name': '巴特肯'
            },
            {
                'id': 19202,
                'name': '比什凯克市'
            },
            {
                'id': 19203,
                'name': '楚河'
            },
            {
                'id': 19204,
                'name': '贾拉拉巴德'
            },
            {
                'id': 19205,
                'name': '卡拉巴尔塔'
            },
            {
                'id': 19206,
                'name': '卡拉库尔'
            },
            {
                'id': 19207,
                'name': '坎特'
            },
            {
                'id': 19208,
                'name': '科克扬加克'
            },
            {
                'id': 19209,
                'name': '迈利赛'
            },
            {
                'id': 19210,
                'name': '纳伦'
            },
            {
                'id': 19211,
                'name': '苏卢克图'
            },
            {
                'id': 19212,
                'name': '塔拉斯'
            },
            {
                'id': 19213,
                'name': '塔什库梅尔'
            },
            {
                'id': 19214,
                'name': '乌兹根'
            },
            {
                'id': 19215,
                'name': '伊塞克湖'
            }
        ]
    },
    {
        'id': 193,
        'name': '几内亚',
        'children': [
            {
                'id': 19300,
                'name': '博凯'
            },
            {
                'id': 19301,
                'name': '恩泽雷科雷'
            },
            {
                'id': 19302,
                'name': '法拉纳'
            },
            {
                'id': 19303,
                'name': '金迪亚'
            },
            {
                'id': 19304,
                'name': '康康'
            },
            {
                'id': 19305,
                'name': '科纳克里'
            },
            {
                'id': 19306,
                'name': '拉贝'
            },
            {
                'id': 19307,
                'name': '玛木'
            }
        ]
    },
    {
        'id': 194,
        'name': '几内亚比绍'
    },
    {
        'id': 195,
        'name': '加拿大',
        'children': [
            {
                'id': 19500,
                'name': '阿伯茨福'
            },
            {
                'id': 19501,
                'name': '埃德蒙顿'
            },
            {
                'id': 19502,
                'name': '奥沙瓦'
            },
            {
                'id': 19503,
                'name': '巴里'
            },
            {
                'id': 19504,
                'name': '布列塔尼角'
            },
            {
                'id': 19505,
                'name': '多伦多'
            },
            {
                'id': 19506,
                'name': '弗雷德里顿'
            },
            {
                'id': 19507,
                'name': '圭尔夫'
            },
            {
                'id': 19508,
                'name': '哈利法克斯'
            },
            {
                'id': 19509,
                'name': '加拿大·哈密尔顿'
            },
            {
                'id': 19510,
                'name': '怀特霍斯'
            },
            {
                'id': 19511,
                'name': '基劳纳'
            },
            {
                'id': 19512,
                'name': '基奇纳'
            },
            {
                'id': 19513,
                'name': '金斯敦'
            },
            {
                'id': 19514,
                'name': '卡里加里'
            },
            {
                'id': 19515,
                'name': '魁北克'
            },
            {
                'id': 19516,
                'name': '里贾纳'
            },
            {
                'id': 19517,
                'name': '加拿大·伦敦'
            },
            {
                'id': 19518,
                'name': '蒙特利尔'
            },
            {
                'id': 19519,
                'name': '萨德伯里'
            },
            {
                'id': 19520,
                'name': '萨斯卡通'
            },
            {
                'id': 19521,
                'name': '三河城'
            },
            {
                'id': 19522,
                'name': '桑德贝'
            },
            {
                'id': 19523,
                'name': '舍布鲁克'
            },
            {
                'id': 19524,
                'name': '加拿大·圣卡塔琳娜'
            },
            {
                'id': 19525,
                'name': '圣约翰斯'
            },
            {
                'id': 19526,
                'name': '加拿大·维多利亚'
            },
            {
                'id': 19527,
                'name': '温哥华'
            },
            {
                'id': 19528,
                'name': '温尼伯'
            },
            {
                'id': 19529,
                'name': '温莎'
            },
            {
                'id': 19530,
                'name': '渥太华'
            },
            {
                'id': 19531,
                'name': '夏洛特敦'
            },
            {
                'id': 19532,
                'name': '耶洛奈夫'
            },
            {
                'id': 19533,
                'name': '伊魁特'
            }
        ]
    },
    {
        'id': 196,
        'name': '加纳',
        'children': [
            {
                'id': 19600,
                'name': '阿散蒂'
            },
            {
                'id': 19601,
                'name': '奥布阿西'
            },
            {
                'id': 19602,
                'name': '布朗阿哈福'
            },
            {
                'id': 19603,
                'name': '大阿克拉'
            },
            {
                'id': 19604,
                'name': '沃尔特'
            }
        ]
    },
    {
        'id': 197,
        'name': '加蓬',
        'children': [
            {
                'id': 19700,
                'name': '奥果韦-洛洛'
            },
            {
                'id': 19701,
                'name': '奥果韦-伊温多'
            },
            {
                'id': 19702,
                'name': '滨海奥果韦'
            },
            {
                'id': 19703,
                'name': '恩古涅'
            },
            {
                'id': 19704,
                'name': '河口'
            },
            {
                'id': 19705,
                'name': '尼扬加'
            },
            {
                'id': 19706,
                'name': '上奥果韦'
            },
            {
                'id': 19707,
                'name': '沃勒-恩特姆'
            },
            {
                'id': 19708,
                'name': '中奥果韦'
            }
        ]
    },
    {
        'id': 198,
        'name': '柬埔寨',
        'children': [
            {
                'id': 19800,
                'name': '奥多棉吉'
            },
            {
                'id': 19801,
                'name': '白马市'
            },
            {
                'id': 19802,
                'name': '柏威夏'
            },
            {
                'id': 19803,
                'name': '拜林市'
            },
            {
                'id': 19804,
                'name': '班迭棉吉'
            },
            {
                'id': 19805,
                'name': '磅清扬'
            },
            {
                'id': 19806,
                'name': '磅士卑'
            },
            {
                'id': 19807,
                'name': '磅同'
            },
            {
                'id': 19808,
                'name': '磅湛'
            },
            {
                'id': 19809,
                'name': '波罗勉'
            },
            {
                'id': 19810,
                'name': '茶胶'
            },
            {
                'id': 19811,
                'name': '柴桢'
            },
            {
                'id': 19812,
                'name': '干丹'
            },
            {
                'id': 19813,
                'name': '戈公'
            },
            {
                'id': 19814,
                'name': '贡布'
            },
            {
                'id': 19815,
                'name': '金边市'
            },
            {
                'id': 19816,
                'name': '桔井'
            },
            {
                'id': 19817,
                'name': '腊塔纳基里'
            },
            {
                'id': 19818,
                'name': '马德望'
            },
            {
                'id': 19819,
                'name': '蒙多基里'
            },
            {
                'id': 19820,
                'name': '菩萨'
            },
            {
                'id': 19821,
                'name': '上丁'
            },
            {
                'id': 19822,
                'name': '西哈努克市'
            },
            {
                'id': 19823,
                'name': '暹粒'
            }
        ]
    },
    {
        'id': 199,
        'name': '捷克共和国',
        'children': [
            {
                'id': 19900,
                'name': '奥洛穆茨'
            },
            {
                'id': 19901,
                'name': '比尔森'
            },
            {
                'id': 19902,
                'name': '布拉格直辖市'
            },
            {
                'id': 19903,
                'name': '赫拉德茨-克拉洛韦'
            },
            {
                'id': 19904,
                'name': '卡罗维发利'
            },
            {
                'id': 19905,
                'name': '利贝雷克'
            },
            {
                'id': 19906,
                'name': '摩拉维亚-西里西亚'
            },
            {
                'id': 19907,
                'name': '南摩拉维亚'
            },
            {
                'id': 19908,
                'name': '帕尔杜比采'
            },
            {
                'id': 19909,
                'name': '维索基纳'
            },
            {
                'id': 19910,
                'name': '乌斯季'
            },
            {
                'id': 19911,
                'name': '中捷克'
            },
            {
                'id': 19912,
                'name': '兹林'
            }
        ]
    },
    {
        'id': 200,
        'name': '津巴布韦',
        'children': [
            {
                'id': 20000,
                'name': '北马塔贝莱兰'
            },
            {
                'id': 20001,
                'name': '布拉瓦约'
            },
            {
                'id': 20002,
                'name': '东马绍纳兰'
            },
            {
                'id': 20003,
                'name': '哈拉雷'
            },
            {
                'id': 20004,
                'name': '马尼卡兰'
            },
            {
                'id': 20005,
                'name': '马斯温戈'
            },
            {
                'id': 20006,
                'name': '南马塔贝莱兰'
            },
            {
                'id': 20007,
                'name': '西马绍纳兰'
            },
            {
                'id': 20008,
                'name': '中马绍纳兰'
            }
        ]
    },
    {
        'id': 201,
        'name': '喀麦隆',
        'children': [
            {
                'id': 20100,
                'name': '阿达马瓦'
            },
            {
                'id': 20101,
                'name': '喀麦隆·滨海'
            }
        ]
    },
    {
        'id': 202,
        'name': '卡塔尔',
        'children': [
            {
                'id': 20200,
                'name': '多哈'
            },
            {
                'id': 20201,
                'name': '古韦里耶'
            },
            {
                'id': 20202,
                'name': '豪尔'
            },
            {
                'id': 20203,
                'name': '杰里扬拜特奈'
            },
            {
                'id': 20204,
                'name': '赖扬'
            },
            {
                'id': 20205,
                'name': '沃克拉'
            },
            {
                'id': 20206,
                'name': '乌姆锡拉勒'
            },
            {
                'id': 20207,
                'name': '朱迈利耶'
            }
        ]
    },
    {
        'id': 203,
        'name': '开曼群岛'
    },
    {
        'id': 204,
        'name': '科科斯群岛'
    },
    {
        'id': 205,
        'name': '科摩罗'
    },
    {
        'id': 206,
        'name': '科特迪瓦',
        'children': [
            {
                'id': 20600,
                'name': '阿涅比'
            },
            {
                'id': 20601,
                'name': '巴芬'
            },
            {
                'id': 20602,
                'name': '邦达马河谷'
            },
            {
                'id': 20603,
                'name': '登盖莱'
            },
            {
                'id': 20604,
                'name': '恩济－科莫埃'
            },
            {
                'id': 20605,
                'name': '弗罗马格尔'
            },
            {
                'id': 20606,
                'name': '湖泊'
            },
            {
                'id': 20607,
                'name': '马拉韦'
            },
            {
                'id': 20608,
                'name': '南邦达马'
            },
            {
                'id': 20609,
                'name': '南科莫埃'
            },
            {
                'id': 20610,
                'name': '萨桑德拉'
            },
            {
                'id': 20611,
                'name': '萨瓦纳'
            },
            {
                'id': 20612,
                'name': '山地'
            },
            {
                'id': 20613,
                'name': '沃罗杜古'
            },
            {
                'id': 20614,
                'name': '下萨桑德拉'
            },
            {
                'id': 20615,
                'name': '泻湖'
            },
            {
                'id': 20616,
                'name': '赞赞'
            },
            {
                'id': 20617,
                'name': '中卡瓦利'
            },
            {
                'id': 20618,
                'name': '中科莫埃'
            }
        ]
    },
    {
        'id': 207,
        'name': '科威特'
    },
    {
        'id': 208,
        'name': '克罗地亚',
        'children': [
            {
                'id': 20800,
                'name': '奥西耶克-巴拉尼亚'
            },
            {
                'id': 20801,
                'name': '别洛瓦尔-比洛戈拉'
            },
            {
                'id': 20802,
                'name': '滨海和山区'
            },
            {
                'id': 20803,
                'name': '波热加-斯拉沃尼亚'
            },
            {
                'id': 20804,
                'name': '布罗德-波萨维纳'
            },
            {
                'id': 20805,
                'name': '杜布罗夫斯克-内雷特瓦'
            },
            {
                'id': 20806,
                'name': '卡尔洛瓦茨'
            },
            {
                'id': 20807,
                'name': '科普里夫尼察-克里热夫齐'
            },
            {
                'id': 20808,
                'name': '克拉皮纳-扎戈列'
            },
            {
                'id': 20809,
                'name': '利卡-塞尼'
            },
            {
                'id': 20810,
                'name': '梅吉穆列'
            },
            {
                'id': 20811,
                'name': '萨格勒布'
            },
            {
                'id': 20812,
                'name': '萨格勒布市'
            },
            {
                'id': 20813,
                'name': '斯普利特-达尔马提亚'
            },
            {
                'id': 20814,
                'name': '瓦拉日丁'
            },
            {
                'id': 20815,
                'name': '维罗维蒂察-波德拉维纳'
            },
            {
                'id': 20816,
                'name': '武科瓦尔-斯里耶姆'
            },
            {
                'id': 20817,
                'name': '希贝尼克-克宁'
            },
            {
                'id': 20818,
                'name': '锡萨克-莫斯拉维纳'
            },
            {
                'id': 20819,
                'name': '伊斯特拉'
            },
            {
                'id': 20820,
                'name': '扎达尔'
            }
        ]
    },
    {
        'id': 209,
        'name': '肯尼亚',
        'children': [
            {
                'id': 20900,
                'name': '埃尔格约-马拉奎特'
            },
            {
                'id': 20901,
                'name': '巴林戈'
            },
            {
                'id': 20902,
                'name': '邦戈马'
            },
            {
                'id': 20903,
                'name': '博美特'
            },
            {
                'id': 20904,
                'name': '布希亚'
            },
            {
                'id': 20905,
                'name': '恩布'
            },
            {
                'id': 20906,
                'name': '霍马湾'
            },
            {
                'id': 20907,
                'name': '基安布'
            },
            {
                'id': 20908,
                'name': '基里菲'
            },
            {
                'id': 20909,
                'name': '基里尼亚加'
            },
            {
                'id': 20910,
                'name': '基苏木'
            },
            {
                'id': 20911,
                'name': '基图伊'
            },
            {
                'id': 20912,
                'name': '基西'
            },
            {
                'id': 20913,
                'name': '加里萨'
            },
            {
                'id': 20914,
                'name': '卡卡梅加'
            },
            {
                'id': 20915,
                'name': '卡耶亚多'
            },
            {
                'id': 20916,
                'name': '凯里乔'
            },
            {
                'id': 20917,
                'name': '夸勒'
            },
            {
                'id': 20918,
                'name': '拉木'
            },
            {
                'id': 20919,
                'name': '莱基皮亚'
            },
            {
                'id': 20920,
                'name': '马查科斯'
            },
            {
                'id': 20921,
                'name': '马瓜尼'
            },
            {
                'id': 20922,
                'name': '马萨布布'
            },
            {
                'id': 20923,
                'name': '曼德拉'
            },
            {
                'id': 20924,
                'name': '梅鲁'
            },
            {
                'id': 20925,
                'name': '蒙巴萨'
            },
            {
                'id': 20926,
                'name': '米戈利'
            },
            {
                'id': 20927,
                'name': '穆兰卡'
            },
            {
                'id': 20928,
                'name': '纳库鲁'
            },
            {
                'id': 20929,
                'name': '纳罗克'
            },
            {
                'id': 20930,
                'name': '南迪'
            },
            {
                'id': 20931,
                'name': '内罗毕'
            },
            {
                'id': 20932,
                'name': '尼蒂'
            },
            {
                'id': 20933,
                'name': '尼亚米拉'
            },
            {
                'id': 20934,
                'name': '年达鲁阿'
            },
            {
                'id': 20935,
                'name': '涅里'
            },
            {
                'id': 20936,
                'name': '桑布卢'
            },
            {
                'id': 20937,
                'name': '塔纳河'
            },
            {
                'id': 20938,
                'name': '泰塔塔维塔'
            },
            {
                'id': 20939,
                'name': '特兰斯-恩佐亚'
            },
            {
                'id': 20940,
                'name': '图尔卡纳'
            },
            {
                'id': 20941,
                'name': '瓦吉尔'
            },
            {
                'id': 20942,
                'name': '瓦辛基苏'
            },
            {
                'id': 20943,
                'name': '韦希加'
            },
            {
                'id': 20944,
                'name': '西波克特'
            },
            {
                'id': 20945,
                'name': '夏亚'
            },
            {
                'id': 20946,
                'name': '伊希约洛'
            },
            {
                'id': 20947,
                'name': '肯尼亚·中央'
            }
        ]
    },
    {
        'id': 210,
        'name': '库克群岛'
    },
    {
        'id': 211,
        'name': '拉脱维亚',
        'children': [
            {
                'id': 21100,
                'name': '阿卢克斯内'
            },
            {
                'id': 21101,
                'name': '爱兹克劳克雷'
            },
            {
                'id': 21102,
                'name': '奥格雷'
            },
            {
                'id': 21103,
                'name': '巴尔维'
            },
            {
                'id': 21104,
                'name': '包斯卡'
            },
            {
                'id': 21105,
                'name': '采西斯'
            },
            {
                'id': 21106,
                'name': '多贝莱'
            },
            {
                'id': 21107,
                'name': '古尔贝内'
            },
            {
                'id': 21108,
                'name': '杰卡布皮尔斯'
            },
            {
                'id': 21109,
                'name': '克拉斯拉瓦'
            },
            {
                'id': 21110,
                'name': '库尔迪加'
            },
            {
                'id': 21111,
                'name': '雷泽克内'
            },
            {
                'id': 21112,
                'name': '里加'
            },
            {
                'id': 21113,
                'name': '利耶帕亚'
            },
            {
                'id': 21114,
                'name': '林巴济'
            },
            {
                'id': 21115,
                'name': '卢扎'
            },
            {
                'id': 21116,
                'name': '马多纳'
            },
            {
                'id': 21117,
                'name': '普雷利'
            },
            {
                'id': 21118,
                'name': '萨尔杜斯'
            },
            {
                'id': 21119,
                'name': '塔尔西'
            },
            {
                'id': 21120,
                'name': '陶格夫皮尔斯'
            },
            {
                'id': 21121,
                'name': '图库马'
            },
            {
                'id': 21122,
                'name': '拉脱维亚·瓦尔加'
            },
            {
                'id': 21123,
                'name': '瓦尔米耶拉'
            },
            {
                'id': 21124,
                'name': '文茨皮尔斯'
            },
            {
                'id': 21125,
                'name': '叶尔加瓦'
            }
        ]
    },
    {
        'id': 212,
        'name': '莱索托',
        'children': [
            {
                'id': 21200,
                'name': '伯里亚'
            },
            {
                'id': 21201,
                'name': '布塔布泰'
            },
            {
                'id': 21202,
                'name': '古廷'
            },
            {
                'id': 21203,
                'name': '加查斯内克'
            },
            {
                'id': 21204,
                'name': '莱里贝'
            },
            {
                'id': 21205,
                'name': '马费滕'
            },
            {
                'id': 21206,
                'name': '马塞卢'
            },
            {
                'id': 21207,
                'name': '莫哈莱斯胡克'
            },
            {
                'id': 21208,
                'name': '莫霍特隆'
            },
            {
                'id': 21209,
                'name': '塔巴采卡'
            }
        ]
    },
    {
        'id': 213,
        'name': '老挝',
        'children': [
            {
                'id': 21300,
                'name': '阿速坡'
            },
            {
                'id': 21301,
                'name': '波里坎赛'
            },
            {
                'id': 21302,
                'name': '博乔'
            },
            {
                'id': 21303,
                'name': '川圹'
            },
            {
                'id': 21304,
                'name': '丰沙里'
            },
            {
                'id': 21305,
                'name': '甘蒙'
            },
            {
                'id': 21306,
                'name': '华潘'
            },
            {
                'id': 21307,
                'name': '琅勃拉邦'
            },
            {
                'id': 21308,
                'name': '琅南塔'
            },
            {
                'id': 21309,
                'name': '赛宋本行政特区'
            },
            {
                'id': 21310,
                'name': '色贡'
            },
            {
                'id': 21311,
                'name': '沙拉湾'
            },
            {
                'id': 21312,
                'name': '沙湾拿吉'
            },
            {
                'id': 21313,
                'name': '沙耶武里'
            },
            {
                'id': 21314,
                'name': '万象'
            },
            {
                'id': 21315,
                'name': '乌多姆赛'
            },
            {
                'id': 21316,
                'name': '占巴塞'
            }
        ]
    },
    {
        'id': 214,
        'name': '黎巴嫩',
        'children': [
            {
                'id': 21400,
                'name': '贝卡'
            },
            {
                'id': 21401,
                'name': '贝鲁特'
            },
            {
                'id': 21402,
                'name': '黎巴嫩山'
            },
            {
                'id': 21403,
                'name': '奈拜提耶市'
            }
        ]
    },
    {
        'id': 215,
        'name': '利比里亚',
        'children': [
            {
                'id': 21500,
                'name': '巴波卢'
            },
            {
                'id': 21501,
                'name': '邦'
            },
            {
                'id': 21502,
                'name': '博波卢'
            },
            {
                'id': 21503,
                'name': '博米'
            },
            {
                'id': 21504,
                'name': '大巴萨'
            },
            {
                'id': 21505,
                'name': '大吉德'
            },
            {
                'id': 21506,
                'name': '大角山'
            },
            {
                'id': 21507,
                'name': '大克鲁'
            },
            {
                'id': 21508,
                'name': '菲什敦'
            },
            {
                'id': 21509,
                'name': '吉河'
            },
            {
                'id': 21510,
                'name': '里弗塞斯'
            },
            {
                'id': 21511,
                'name': '洛法'
            },
            {
                'id': 21512,
                'name': '马吉比'
            },
            {
                'id': 21513,
                'name': '利比里亚·马里兰'
            },
            {
                'id': 21514,
                'name': '蒙特塞拉多'
            },
            {
                'id': 21515,
                'name': '宁巴'
            },
            {
                'id': 21516,
                'name': '锡诺'
            }
        ]
    },
    {
        'id': 216,
        'name': '利比亚'
    },
    {
        'id': 217,
        'name': '立陶宛',
        'children': [
            {
                'id': 21700,
                'name': '阿利图斯'
            },
            {
                'id': 21701,
                'name': '考纳斯'
            },
            {
                'id': 21702,
                'name': '克莱佩达'
            },
            {
                'id': 21703,
                'name': '马里扬泊列'
            },
            {
                'id': 21704,
                'name': '帕涅韦日斯'
            },
            {
                'id': 21705,
                'name': '陶拉格'
            },
            {
                'id': 21706,
                'name': '特尔希艾'
            },
            {
                'id': 21707,
                'name': '维尔纽斯'
            },
            {
                'id': 21708,
                'name': '乌田纳'
            },
            {
                'id': 21709,
                'name': '希奥利艾'
            },
            {
                'id': 21710,
                'name': '亚克曼'
            }
        ]
    },
    {
        'id': 218,
        'name': '列支敦士登'
    },
    {
        'id': 219,
        'name': '留尼旺岛'
    },
    {
        'id': 220,
        'name': '卢森堡',
        'children': [
            {
                'id': 22000,
                'name': '迪基希'
            },
            {
                'id': 22001,
                'name': '格雷文马赫'
            },
            {
                'id': 22002,
                'name': '卢森堡 卢森堡市'
            }
        ]
    },
    {
        'id': 221,
        'name': '卢旺达',
        'children': [
            {
                'id': 22100,
                'name': '比温巴'
            },
            {
                'id': 22101,
                'name': '布塔雷'
            },
            {
                'id': 22102,
                'name': '恩延扎'
            },
            {
                'id': 22103,
                'name': '基本古'
            },
            {
                'id': 22104,
                'name': '基布耶'
            },
            {
                'id': 22105,
                'name': '基加利-恩加利'
            },
            {
                'id': 22106,
                'name': '基加利市'
            },
            {
                'id': 22107,
                'name': '吉孔戈罗'
            },
            {
                'id': 22108,
                'name': '吉塞尼'
            },
            {
                'id': 22109,
                'name': '吉塔拉马'
            },
            {
                'id': 22110,
                'name': '卡布加'
            },
            {
                'id': 22111,
                'name': '卢瓦马加纳'
            },
            {
                'id': 22112,
                'name': '鲁汉戈'
            },
            {
                'id': 22113,
                'name': '鲁亨盖里'
            },
            {
                'id': 22114,
                'name': '尚古古'
            },
            {
                'id': 22115,
                'name': '乌姆塔拉'
            }
        ]
    },
    {
        'id': 222,
        'name': '罗马尼亚',
        'children': [
            {
                'id': 22200,
                'name': '阿尔巴尤利亚'
            },
            {
                'id': 22201,
                'name': '阿拉德'
            },
            {
                'id': 22202,
                'name': '奥拉迪亚'
            },
            {
                'id': 22203,
                'name': '巴克乌'
            },
            {
                'id': 22204,
                'name': '巴亚马雷'
            },
            {
                'id': 22205,
                'name': '比斯特里察'
            },
            {
                'id': 22206,
                'name': '博托沙尼'
            },
            {
                'id': 22207,
                'name': '布加勒斯特'
            },
            {
                'id': 22208,
                'name': '布拉索夫'
            },
            {
                'id': 22209,
                'name': '布勒伊拉'
            },
            {
                'id': 22210,
                'name': '布泽乌'
            },
            {
                'id': 22211,
                'name': '德罗贝塔-塞维林堡'
            },
            {
                'id': 22212,
                'name': '德瓦'
            },
            {
                'id': 22213,
                'name': '蒂米什瓦拉'
            },
            {
                'id': 22214,
                'name': '福克沙尼'
            },
            {
                'id': 22215,
                'name': '加拉茨'
            },
            {
                'id': 22216,
                'name': '久尔久'
            },
            {
                'id': 22217,
                'name': '康斯坦察'
            },
            {
                'id': 22218,
                'name': '克拉约瓦'
            },
            {
                'id': 22219,
                'name': '克勒拉希'
            },
            {
                'id': 22220,
                'name': '克卢日纳波卡'
            },
            {
                'id': 22221,
                'name': '勒姆尼库沃尔恰'
            },
            {
                'id': 22222,
                'name': '雷希察'
            },
            {
                'id': 22223,
                'name': '梅尔库里亚丘克'
            },
            {
                'id': 22224,
                'name': '皮特什蒂'
            },
            {
                'id': 22225,
                'name': '皮亚特拉尼亚姆茨'
            },
            {
                'id': 22226,
                'name': '普洛耶什蒂'
            },
            {
                'id': 22227,
                'name': '萨图·马雷'
            },
            {
                'id': 22228,
                'name': '圣格奥尔基'
            },
            {
                'id': 22229,
                'name': '斯拉蒂纳'
            },
            {
                'id': 22230,
                'name': '斯洛博齐亚'
            },
            {
                'id': 22231,
                'name': '苏恰瓦'
            },
            {
                'id': 22232,
                'name': '特尔戈维什泰'
            },
            {
                'id': 22233,
                'name': '特尔古穆列什'
            },
            {
                'id': 22234,
                'name': '特尔古日乌'
            },
            {
                'id': 22235,
                'name': '图尔恰'
            },
            {
                'id': 22236,
                'name': '瓦斯卢伊'
            },
            {
                'id': 22237,
                'name': '锡比乌'
            },
            {
                'id': 22238,
                'name': '雅西'
            },
            {
                'id': 22239,
                'name': '亚厉山德里亚'
            },
            {
                'id': 22240,
                'name': '扎勒乌'
            }
        ]
    },
    {
        'id': 223,
        'name': '马达加斯加',
        'children': [
            {
                'id': 22300,
                'name': '安齐拉纳纳'
            },
            {
                'id': 22301,
                'name': '菲亚纳兰楚阿'
            },
            {
                'id': 22302,
                'name': '马哈赞加'
            },
            {
                'id': 22303,
                'name': '塔那那利佛'
            },
            {
                'id': 22304,
                'name': '图阿马西拉'
            },
            {
                'id': 22305,
                'name': '图利亚拉'
            }
        ]
    },
    {
        'id': 224,
        'name': '马尔代夫',
        'children': [
            {
                'id': 22400,
                'name': '阿杜'
            },
            {
                'id': 22401,
                'name': '北阿里'
            },
            {
                'id': 22402,
                'name': '北蒂拉杜马蒂'
            },
            {
                'id': 22403,
                'name': '北马洛斯马杜卢'
            },
            {
                'id': 22404,
                'name': '北米拉杜马杜卢'
            },
            {
                'id': 22405,
                'name': '北尼兰杜'
            },
            {
                'id': 22406,
                'name': '北苏瓦迪瓦'
            },
            {
                'id': 22407,
                'name': '法迪福卢'
            },
            {
                'id': 22408,
                'name': '费利杜'
            },
            {
                'id': 22409,
                'name': '福阿穆拉库'
            },
            {
                'id': 22410,
                'name': '哈杜马蒂'
            },
            {
                'id': 22411,
                'name': '科卢马杜卢'
            },
            {
                'id': 22412,
                'name': '马累'
            },
            {
                'id': 22413,
                'name': '马累岛'
            },
            {
                'id': 22414,
                'name': '穆拉库'
            },
            {
                'id': 22415,
                'name': '南阿里'
            },
            {
                'id': 22416,
                'name': '南蒂拉杜马蒂'
            },
            {
                'id': 22417,
                'name': '南马洛斯马杜卢'
            },
            {
                'id': 22418,
                'name': '南米拉杜马杜卢'
            },
            {
                'id': 22419,
                'name': '南尼兰杜'
            },
            {
                'id': 22420,
                'name': '南苏瓦迪瓦'
            }
        ]
    },
    {
        'id': 225,
        'name': '马耳他'
    },
    {
        'id': 226,
        'name': '马拉维'
    },
    {
        'id': 227,
        'name': '马来西亚',
        'children': [
            {
                'id': 22700,
                'name': '槟榔屿',
                'children': [
                    {
                        'id': 2270000,
                        'name': '北海'
                    },
                    {
                        'id': 2270001,
                        'name': '槟城'
                    },
                    {
                        'id': 2270002,
                        'name': '大山脚'
                    },
                    {
                        'id': 2270003,
                        'name': '高渊'
                    }
                ]
            },
            {
                'id': 22701,
                'name': '玻璃市',
                'children': [
                    {
                        'id': 2270100,
                        'name': '加央'
                    }
                ]
            },
            {
                'id': 22702,
                'name': '丁加奴',
                'children': [
                    {
                        'id': 2270200,
                        'name': '甘马挽'
                    },
                    {
                        'id': 2270201,
                        'name': '瓜拉丁加奴'
                    },
                    {
                        'id': 2270202,
                        'name': '龙运'
                    },
                    {
                        'id': 2270203,
                        'name': '马江'
                    },
                    {
                        'id': 2270204,
                        'name': '实兆'
                    },
                    {
                        'id': 2270205,
                        'name': '乌鲁'
                    },
                    {
                        'id': 2270206,
                        'name': '勿述'
                    }
                ]
            },
            {
                'id': 22703,
                'name': '吉打',
                'children': [
                    {
                        'id': 2270300,
                        'name': '巴东得腊'
                    },
                    {
                        'id': 2270301,
                        'name': '笨筒'
                    },
                    {
                        'id': 2270302,
                        'name': '浮罗交怡'
                    },
                    {
                        'id': 2270303,
                        'name': '哥打士打'
                    },
                    {
                        'id': 2270304,
                        'name': '古邦巴素'
                    },
                    {
                        'id': 2270305,
                        'name': '瓜拉姆达'
                    },
                    {
                        'id': 2270306,
                        'name': '华玲'
                    },
                    {
                        'id': 2270307,
                        'name': '居林'
                    },
                    {
                        'id': 2270308,
                        'name': '万拉峇鲁'
                    }
                ]
            },
            {
                'id': 22704,
                'name': '吉兰丹',
                'children': [
                    {
                        'id': 2270400,
                        'name': '巴西富地'
                    },
                    {
                        'id': 2270401,
                        'name': '巴西马'
                    },
                    {
                        'id': 2270402,
                        'name': '丹那美拉'
                    },
                    {
                        'id': 2270403,
                        'name': '道北'
                    },
                    {
                        'id': 2270404,
                        'name': '登卓'
                    },
                    {
                        'id': 2270405,
                        'name': '哥打巴鲁'
                    },
                    {
                        'id': 2270406,
                        'name': '瓜拉吉赖'
                    },
                    {
                        'id': 2270407,
                        'name': '话望生'
                    },
                    {
                        'id': 2270408,
                        'name': '马樟'
                    },
                    {
                        'id': 2270409,
                        'name': '日里'
                    }
                ]
            },
            {
                'id': 22705,
                'name': '吉隆坡'
            },
            {
                'id': 22706,
                'name': '马六甲',
                'children': [
                    {
                        'id': 2270600,
                        'name': '马六甲市'
                    },
                    {
                        'id': 2270601,
                        'name': '亚罗牙也'
                    },
                    {
                        'id': 2270602,
                        'name': '野新'
                    }
                ]
            },
            {
                'id': 22707,
                'name': '纳闽'
            },
            {
                'id': 22708,
                'name': '彭亨',
                'children': [
                    {
                        'id': 2270800,
                        'name': '百乐'
                    },
                    {
                        'id': 2270801,
                        'name': '北根'
                    },
                    {
                        'id': 2270802,
                        'name': '淡马鲁'
                    },
                    {
                        'id': 2270803,
                        'name': '而连突'
                    },
                    {
                        'id': 2270804,
                        'name': '关丹'
                    },
                    {
                        'id': 2270805,
                        'name': '金马仑高原'
                    },
                    {
                        'id': 2270806,
                        'name': '劳勿'
                    },
                    {
                        'id': 2270807,
                        'name': '立卑'
                    },
                    {
                        'id': 2270808,
                        'name': '马兰'
                    },
                    {
                        'id': 2270809,
                        'name': '文冬'
                    },
                    {
                        'id': 2270810,
                        'name': '云冰'
                    }
                ]
            },
            {
                'id': 22709,
                'name': '霹雳',
                'children': [
                    {
                        'id': 2270900,
                        'name': '安顺'
                    },
                    {
                        'id': 2270901,
                        'name': '丹绒马'
                    },
                    {
                        'id': 2270902,
                        'name': '和丰'
                    },
                    {
                        'id': 2270903,
                        'name': '紅土坎'
                    },
                    {
                        'id': 2270904,
                        'name': '华都牙也'
                    },
                    {
                        'id': 2270905,
                        'name': '江沙'
                    },
                    {
                        'id': 2270906,
                        'name': '太平'
                    },
                    {
                        'id': 2270907,
                        'name': '怡保'
                    }
                ]
            },
            {
                'id': 22710,
                'name': '柔佛',
                'children': [
                    {
                        'id': 2271000,
                        'name': '笨珍'
                    },
                    {
                        'id': 2271001,
                        'name': '丰盛港'
                    },
                    {
                        'id': 2271002,
                        'name': '哥打丁宜'
                    },
                    {
                        'id': 2271003,
                        'name': '居銮'
                    },
                    {
                        'id': 2271004,
                        'name': '峇株巴辖'
                    },
                    {
                        'id': 2271005,
                        'name': '麻坡'
                    },
                    {
                        'id': 2271006,
                        'name': '昔加末'
                    },
                    {
                        'id': 2271007,
                        'name': '新山'
                    }
                ]
            },
            {
                'id': 22711,
                'name': '森美兰',
                'children': [
                    {
                        'id': 2271100,
                        'name': '波德申'
                    },
                    {
                        'id': 2271101,
                        'name': '淡边'
                    },
                    {
                        'id': 2271102,
                        'name': '芙蓉'
                    },
                    {
                        'id': 2271103,
                        'name': '瓜拉庇劳'
                    },
                    {
                        'id': 2271104,
                        'name': '林茂'
                    },
                    {
                        'id': 2271105,
                        'name': '仁保'
                    },
                    {
                        'id': 2271106,
                        'name': '日叻务'
                    }
                ]
            },
            {
                'id': 22712,
                'name': '沙巴',
                'children': [
                    {
                        'id': 2271200,
                        'name': '吧巴'
                    },
                    {
                        'id': 2271201,
                        'name': '保佛'
                    },
                    {
                        'id': 2271202,
                        'name': '比鲁兰'
                    },
                    {
                        'id': 2271203,
                        'name': '必达士'
                    },
                    {
                        'id': 2271204,
                        'name': '兵南邦'
                    },
                    {
                        'id': 2271205,
                        'name': '担布南'
                    },
                    {
                        'id': 2271206,
                        'name': '丹南'
                    },
                    {
                        'id': 2271207,
                        'name': '斗湖'
                    },
                    {
                        'id': 2271208,
                        'name': '斗亚兰'
                    },
                    {
                        'id': 2271209,
                        'name': '哥打基纳巴鲁'
                    },
                    {
                        'id': 2271210,
                        'name': '哥打马鲁都'
                    },
                    {
                        'id': 2271211,
                        'name': '根地咬'
                    },
                    {
                        'id': 2271212,
                        'name': '古达'
                    },
                    {
                        'id': 2271213,
                        'name': '古打毛律'
                    },
                    {
                        'id': 2271214,
                        'name': '古纳'
                    },
                    {
                        'id': 2271215,
                        'name': '瓜拉班尤'
                    },
                    {
                        'id': 2271216,
                        'name': '京那巴登岸'
                    },
                    {
                        'id': 2271217,
                        'name': '兰脑'
                    },
                    {
                        'id': 2271218,
                        'name': '拿笃'
                    },
                    {
                        'id': 2271219,
                        'name': '纳巴湾'
                    },
                    {
                        'id': 2271220,
                        'name': '山打根'
                    },
                    {
                        'id': 2271221,
                        'name': '西比陶'
                    },
                    {
                        'id': 2271222,
                        'name': '仙本那'
                    }
                ]
            },
            {
                'id': 22713,
                'name': '沙捞越',
                'children': [
                    {
                        'id': 2271300,
                        'name': '古晋'
                    },
                    {
                        'id': 2271301,
                        'name': '加帛'
                    },
                    {
                        'id': 2271302,
                        'name': '林梦'
                    },
                    {
                        'id': 2271303,
                        'name': '美里'
                    },
                    {
                        'id': 2271304,
                        'name': '民都鲁'
                    },
                    {
                        'id': 2271305,
                        'name': '木胶'
                    },
                    {
                        'id': 2271306,
                        'name': '木中'
                    },
                    {
                        'id': 2271307,
                        'name': '三马拉汉'
                    },
                    {
                        'id': 2271308,
                        'name': '斯里阿曼'
                    },
                    {
                        'id': 2271309,
                        'name': '泗里街'
                    },
                    {
                        'id': 2271310,
                        'name': '泗务'
                    }
                ]
            },
            {
                'id': 22714,
                'name': '雪兰莪',
                'children': [
                    {
                        'id': 2271400,
                        'name': '八打灵'
                    },
                    {
                        'id': 2271401,
                        'name': '鹅麦'
                    },
                    {
                        'id': 2271402,
                        'name': '瓜拉冷岳'
                    },
                    {
                        'id': 2271403,
                        'name': '瓜拉雪兰莪'
                    },
                    {
                        'id': 2271404,
                        'name': '沙白安南'
                    },
                    {
                        'id': 2271405,
                        'name': '乌鲁冷岳'
                    },
                    {
                        'id': 2271406,
                        'name': '乌鲁雪兰莪'
                    },
                    {
                        'id': 2271407,
                        'name': '雪邦'
                    }
                ]
            }
        ]
    },
    {
        'id': 228,
        'name': '马里',
        'children': [
            {
                'id': 22800,
                'name': '巴马科首都区'
            },
            {
                'id': 22801,
                'name': '基达尔'
            },
            {
                'id': 22802,
                'name': '加奥'
            },
            {
                'id': 22803,
                'name': '卡伊'
            },
            {
                'id': 22804,
                'name': '库利科罗'
            },
            {
                'id': 22805,
                'name': '莫普提'
            },
            {
                'id': 22806,
                'name': '塞古'
            },
            {
                'id': 22807,
                'name': '通布图'
            },
            {
                'id': 22808,
                'name': '锡卡索'
            }
        ]
    },
    {
        'id': 229,
        'name': '马其顿'
    },
    {
        'id': 230,
        'name': '马绍尔群岛'
    },
    {
        'id': 231,
        'name': '马提尼克'
    },
    {
        'id': 232,
        'name': '马约特岛'
    },
    {
        'id': 233,
        'name': '曼岛'
    },
    {
        'id': 234,
        'name': '毛里求斯'
    },
    {
        'id': 235,
        'name': '毛里塔尼亚',
        'children': [
            {
                'id': 23500,
                'name': '阿德拉尔'
            },
            {
                'id': 23501,
                'name': '阿萨巴'
            },
            {
                'id': 23502,
                'name': '卜拉克纳'
            },
            {
                'id': 23503,
                'name': '东胡德'
            },
            {
                'id': 23504,
                'name': '戈尔戈勒'
            },
            {
                'id': 23505,
                'name': '吉迪马卡'
            },
            {
                'id': 23506,
                'name': '努瓦迪布湾'
            },
            {
                'id': 23507,
                'name': '努瓦克肖特特区'
            },
            {
                'id': 23508,
                'name': '塔甘特'
            },
            {
                'id': 23509,
                'name': '特拉扎'
            },
            {
                'id': 23510,
                'name': '提里斯-宰穆尔'
            },
            {
                'id': 23511,
                'name': '西胡德'
            },
            {
                'id': 23512,
                'name': '因希里'
            }
        ]
    },
    {
        'id': 236,
        'name': '美属萨摩亚',
        'children': [
            {
                'id': 23600,
                'name': '阿纳'
            },
            {
                'id': 23601,
                'name': '阿图阿'
            },
            {
                'id': 23602,
                'name': '艾加伊勒泰'
            },
            {
                'id': 23603,
                'name': '法塞莱莱阿加'
            },
            {
                'id': 23604,
                'name': '加盖福毛加'
            },
            {
                'id': 23605,
                'name': '加加埃毛加'
            },
            {
                'id': 23606,
                'name': '帕劳利'
            },
            {
                'id': 23607,
                'name': '萨图帕伊泰阿'
            },
            {
                'id': 23608,
                'name': '萨瓦伊岛'
            },
            {
                'id': 23609,
                'name': '图阿马萨加'
            },
            {
                'id': 23610,
                'name': '瓦奥福诺蒂'
            },
            {
                'id': 23611,
                'name': '韦西加诺'
            },
            {
                'id': 23612,
                'name': '乌波卢岛'
            }
        ]
    },
    {
        'id': 237,
        'name': '美属外岛'
    },
    {
        'id': 238,
        'name': '蒙古',
        'children': [
            {
                'id': 23800,
                'name': '巴彦洪格尔'
            },
            {
                'id': 23801,
                'name': '巴彦乌勒盖'
            },
            {
                'id': 23802,
                'name': '布尔干'
            },
            {
                'id': 23803,
                'name': '达尔汗乌勒'
            },
            {
                'id': 23804,
                'name': '蒙古·东方'
            },
            {
                'id': 23805,
                'name': '东戈壁'
            },
            {
                'id': 23806,
                'name': '鄂尔浑'
            },
            {
                'id': 23807,
                'name': '戈壁阿尔泰'
            },
            {
                'id': 23808,
                'name': '戈壁苏木贝尔'
            },
            {
                'id': 23809,
                'name': '后杭爱'
            },
            {
                'id': 23810,
                'name': '科布多'
            },
            {
                'id': 23811,
                'name': '肯特'
            },
            {
                'id': 23812,
                'name': '库苏古尔'
            },
            {
                'id': 23813,
                'name': '南戈壁'
            },
            {
                'id': 23814,
                'name': '前杭爱'
            },
            {
                'id': 23815,
                'name': '色楞格'
            },
            {
                'id': 23816,
                'name': '苏赫巴托尔'
            },
            {
                'id': 23817,
                'name': '乌布苏'
            },
            {
                'id': 23818,
                'name': '乌兰巴托市'
            },
            {
                'id': 23819,
                'name': '扎布汗'
            },
            {
                'id': 23820,
                'name': '中戈壁'
            },
            {
                'id': 23821,
                'name': '蒙古·中央'
            }
        ]
    },
    {
        'id': 239,
        'name': '蒙特塞拉特'
    },
    {
        'id': 240,
        'name': '孟加拉',
        'children': [
            {
                'id': 24000,
                'name': '达卡'
            },
            {
                'id': 24001,
                'name': '吉大港'
            },
            {
                'id': 24002,
                'name': '库尔纳'
            }
        ]
    },
    {
        'id': 241,
        'name': '密克罗尼西亚'
    },
    {
        'id': 242,
        'name': '秘鲁',
        'children': [
            {
                'id': 24200,
                'name': '阿雷基帕'
            },
            {
                'id': 24201,
                'name': '阿普里马克'
            },
            {
                'id': 24202,
                'name': '阿亚库乔'
            },
            {
                'id': 24203,
                'name': '安卡什'
            },
            {
                'id': 24204,
                'name': '胡利亚卡'
            },
            {
                'id': 24205,
                'name': '胡宁'
            },
            {
                'id': 24206,
                'name': '卡哈马卡'
            },
            {
                'id': 24207,
                'name': '卡亚俄'
            },
            {
                'id': 24208,
                'name': '库斯科'
            },
            {
                'id': 24209,
                'name': '秘鲁·拉利伯塔德'
            },
            {
                'id': 24210,
                'name': '兰巴耶克'
            },
            {
                'id': 24211,
                'name': '利马'
            },
            {
                'id': 24212,
                'name': '洛雷托'
            },
            {
                'id': 24213,
                'name': '马德雷德迪奥斯'
            },
            {
                'id': 24214,
                'name': '莫克瓜'
            },
            {
                'id': 24215,
                'name': '帕斯科'
            },
            {
                'id': 24216,
                'name': '皮乌拉'
            },
            {
                'id': 24217,
                'name': '普诺'
            },
            {
                'id': 24218,
                'name': '钦博特'
            },
            {
                'id': 24219,
                'name': '钦查阿尔塔'
            },
            {
                'id': 24220,
                'name': '圣马丁'
            },
            {
                'id': 24221,
                'name': '苏拉纳'
            },
            {
                'id': 24222,
                'name': '塔克纳'
            },
            {
                'id': 24223,
                'name': '通贝斯'
            },
            {
                'id': 24224,
                'name': '瓦努科'
            },
            {
                'id': 24225,
                'name': '万卡维利卡'
            },
            {
                'id': 24226,
                'name': '乌卡亚利'
            },
            {
                'id': 24227,
                'name': '秘鲁·亚马逊'
            },
            {
                'id': 24228,
                'name': '伊卡'
            }
        ]
    },
    {
        'id': 243,
        'name': '缅甸',
        'children': [
            {
                'id': 24300,
                'name': '勃固省'
            },
            {
                'id': 24301,
                'name': '掸邦'
            },
            {
                'id': 24302,
                'name': '德林达依省'
            },
            {
                'id': 24303,
                'name': '克伦邦'
            },
            {
                'id': 24304,
                'name': '克钦邦'
            },
            {
                'id': 24305,
                'name': '克耶邦'
            },
            {
                'id': 24306,
                'name': '马圭省'
            },
            {
                'id': 24307,
                'name': '曼德勒省'
            },
            {
                'id': 24308,
                'name': '孟邦'
            },
            {
                'id': 24309,
                'name': '钦邦'
            },
            {
                'id': 24310,
                'name': '若开邦'
            },
            {
                'id': 24311,
                'name': '实皆省'
            },
            {
                'id': 24312,
                'name': '仰光省'
            },
            {
                'id': 24313,
                'name': '伊洛瓦底省'
            }
        ]
    },
    {
        'id': 244,
        'name': '摩尔多瓦'
    },
    {
        'id': 245,
        'name': '摩洛哥',
        'children': [
            {
                'id': 24500,
                'name': '丹吉尔'
            },
            {
                'id': 24501,
                'name': '得土安'
            },
            {
                'id': 24502,
                'name': '非斯'
            },
            {
                'id': 24503,
                'name': '卡萨布兰卡'
            },
            {
                'id': 24504,
                'name': '拉巴特'
            },
            {
                'id': 24505,
                'name': '马拉喀什'
            },
            {
                'id': 24506,
                'name': '梅克内斯'
            },
            {
                'id': 24507,
                'name': '乌季达'
            },
            {
                'id': 24508,
                'name': '西撒哈拉'
            }
        ]
    },
    {
        'id': 246,
        'name': '摩纳哥'
    },
    {
        'id': 247,
        'name': '莫桑比克'
    },
    {
        'id': 248,
        'name': '墨西哥',
        'children': [
            {
                'id': 24800,
                'name': '阿瓜斯卡连斯特'
            },
            {
                'id': 24801,
                'name': '阿卡普尔科'
            },
            {
                'id': 24802,
                'name': '埃莫西约'
            },
            {
                'id': 24803,
                'name': '埃佩切'
            },
            {
                'id': 24804,
                'name': '奥夫雷贡城'
            },
            {
                'id': 24805,
                'name': '奥里萨巴'
            },
            {
                'id': 24806,
                'name': '巴利城'
            },
            {
                'id': 24807,
                'name': '巴亚尔塔港'
            },
            {
                'id': 24808,
                'name': '比利亚埃尔莫萨'
            },
            {
                'id': 24809,
                'name': '波萨里卡'
            },
            {
                'id': 24810,
                'name': '蒂华纳'
            },
            {
                'id': 24811,
                'name': '杜兰戈'
            },
            {
                'id': 24812,
                'name': '恩塞纳达'
            },
            {
                'id': 24813,
                'name': '墨西哥·瓜达拉哈拉'
            },
            {
                'id': 24814,
                'name': '瓜纳华托'
            },
            {
                'id': 24815,
                'name': '墨西哥·哈拉帕'
            },
            {
                'id': 24816,
                'name': '华雷斯'
            },
            {
                'id': 24817,
                'name': '华雷斯港'
            },
            {
                'id': 24818,
                'name': '卡门'
            },
            {
                'id': 24819,
                'name': '科利马'
            },
            {
                'id': 24820,
                'name': '克雷塔罗'
            },
            {
                'id': 24821,
                'name': '库埃纳瓦卡'
            },
            {
                'id': 24822,
                'name': '库利阿坎'
            },
            {
                'id': 24823,
                'name': '夸察夸拉克斯'
            },
            {
                'id': 24824,
                'name': '墨西哥·拉巴斯'
            },
            {
                'id': 24825,
                'name': '墨西哥·莱昂'
            },
            {
                'id': 24826,
                'name': '雷诺萨'
            },
            {
                'id': 24827,
                'name': '洛斯莫奇斯'
            },
            {
                'id': 24828,
                'name': '马萨特兰'
            },
            {
                'id': 24829,
                'name': '马塔莫罗斯'
            },
            {
                'id': 24830,
                'name': '墨西哥·梅里达'
            },
            {
                'id': 24831,
                'name': '蒙克洛瓦'
            },
            {
                'id': 24832,
                'name': '蒙特雷'
            },
            {
                'id': 24833,
                'name': '莫雷利亚'
            },
            {
                'id': 24834,
                'name': '墨西哥城'
            },
            {
                'id': 24835,
                'name': '墨西卡利'
            },
            {
                'id': 24836,
                'name': '诺加莱斯'
            },
            {
                'id': 24837,
                'name': '帕丘卡'
            },
            {
                'id': 24838,
                'name': '普埃布拉'
            },
            {
                'id': 24839,
                'name': '奇尔潘辛戈'
            },
            {
                'id': 24840,
                'name': '奇瓦瓦'
            },
            {
                'id': 24841,
                'name': '切图马尔'
            },
            {
                'id': 24842,
                'name': '萨尔蒂约'
            },
            {
                'id': 24843,
                'name': '萨卡特卡斯'
            },
            {
                'id': 24844,
                'name': '塞拉亚'
            },
            {
                'id': 24845,
                'name': '圣路易斯波托亚'
            },
            {
                'id': 24846,
                'name': '塔帕丘拉'
            },
            {
                'id': 24847,
                'name': '坦皮科'
            },
            {
                'id': 24848,
                'name': '特拉斯卡拉'
            },
            {
                'id': 24849,
                'name': '特皮克'
            },
            {
                'id': 24850,
                'name': '特瓦坎'
            },
            {
                'id': 24851,
                'name': '图斯特拉-古铁雷斯'
            },
            {
                'id': 24852,
                'name': '托雷翁'
            },
            {
                'id': 24853,
                'name': '托卢卡'
            },
            {
                'id': 24854,
                'name': '瓦哈卡'
            },
            {
                'id': 24855,
                'name': '维多利亚城'
            },
            {
                'id': 24856,
                'name': '韦拉克鲁斯'
            },
            {
                'id': 24857,
                'name': '乌鲁阿潘'
            },
            {
                'id': 24858,
                'name': '新拉雷多'
            },
            {
                'id': 24859,
                'name': '伊拉普阿托'
            }
        ]
    },
    {
        'id': 249,
        'name': '纳米比亚',
        'children': [
            {
                'id': 24900,
                'name': '埃龙戈'
            },
            {
                'id': 24901,
                'name': '奥汉圭纳'
            },
            {
                'id': 24902,
                'name': '奥卡万戈'
            },
            {
                'id': 24903,
                'name': '奥马赫科'
            },
            {
                'id': 24904,
                'name': '奥姆沙蒂'
            },
            {
                'id': 24905,
                'name': '奥乔宗蒂约巴'
            },
            {
                'id': 24906,
                'name': '奥沙纳'
            },
            {
                'id': 24907,
                'name': '奥希科托'
            },
            {
                'id': 24908,
                'name': '哈达普'
            },
            {
                'id': 24909,
                'name': '霍马斯'
            },
            {
                'id': 24910,
                'name': '卡拉斯'
            },
            {
                'id': 24911,
                'name': '卡普里维'
            },
            {
                'id': 24912,
                'name': '纳米比亚·库内内'
            }
        ]
    },
    {
        'id': 250,
        'name': '南非',
        'children': [
            {
                'id': 25000,
                'name': '阿平顿'
            },
            {
                'id': 25001,
                'name': '艾利弗山'
            },
            {
                'id': 25002,
                'name': '彼德马里茨堡'
            },
            {
                'id': 25003,
                'name': '彼德斯堡'
            },
            {
                'id': 25004,
                'name': '比勒陀利亚'
            },
            {
                'id': 25005,
                'name': '比索'
            },
            {
                'id': 25006,
                'name': '布雷达斯多普'
            },
            {
                'id': 25007,
                'name': '布隆方丹'
            },
            {
                'id': 25008,
                'name': '布隆克斯特斯普利特'
            },
            {
                'id': 25009,
                'name': '德阿尔'
            },
            {
                'id': 25010,
                'name': '德班'
            },
            {
                'id': 25011,
                'name': '邓迪'
            },
            {
                'id': 25012,
                'name': '东巴克利'
            },
            {
                'id': 25013,
                'name': '东伦敦'
            },
            {
                'id': 25014,
                'name': '弗雷堡'
            },
            {
                'id': 25015,
                'name': '弗里尼欣'
            },
            {
                'id': 25016,
                'name': '格罗布莱斯达尔'
            },
            {
                'id': 25017,
                'name': '基雅尼'
            },
            {
                'id': 25018,
                'name': '金伯利'
            },
            {
                'id': 25019,
                'name': '开普敦'
            },
            {
                'id': 25020,
                'name': '克莱克斯多普'
            },
            {
                'id': 25021,
                'name': '库鲁曼'
            },
            {
                'id': 25022,
                'name': '昆士敦'
            },
            {
                'id': 25023,
                'name': '莱迪史密斯'
            },
            {
                'id': 25024,
                'name': '兰德方丹'
            },
            {
                'id': 25025,
                'name': '理查兹湾'
            },
            {
                'id': 25026,
                'name': '利斯滕堡'
            },
            {
                'id': 25027,
                'name': '南非·米德尔堡'
            },
            {
                'id': 25028,
                'name': '姆库泽'
            },
            {
                'id': 25029,
                'name': '穆里斯堡'
            },
            {
                'id': 25030,
                'name': '内尔斯普雷特'
            },
            {
                'id': 25031,
                'name': '尼尔斯特隆'
            },
            {
                'id': 25032,
                'name': '南非·纽卡斯尔'
            },
            {
                'id': 25033,
                'name': '乔治'
            },
            {
                'id': 25034,
                'name': '萨索尔堡'
            },
            {
                'id': 25035,
                'name': '瑟孔达'
            },
            {
                'id': 25036,
                'name': '特克索波'
            },
            {
                'id': 25037,
                'name': '特隆普斯堡'
            },
            {
                'id': 25038,
                'name': '跳羚'
            },
            {
                'id': 25039,
                'name': '图拉马哈谢'
            },
            {
                'id': 25040,
                'name': '托霍延杜'
            },
            {
                'id': 25041,
                'name': '韦茨肖克'
            },
            {
                'id': 25042,
                'name': '韦尔科姆'
            },
            {
                'id': 25043,
                'name': '乌伦迪'
            },
            {
                'id': 25044,
                'name': '乌姆塔塔'
            },
            {
                'id': 25045,
                'name': '南非·伍斯特'
            },
            {
                'id': 25046,
                'name': '西博福特'
            },
            {
                'id': 25047,
                'name': '谢普斯通港'
            },
            {
                'id': 25048,
                'name': '伊丽莎白港'
            },
            {
                'id': 25049,
                'name': '约翰内斯堡'
            }
        ]
    },
    {
        'id': 251,
        'name': '南极洲'
    },
    {
        'id': 252,
        'name': '南乔治亚和南桑德威奇群岛'
    },
    {
        'id': 253,
        'name': '瑙鲁'
    },
    {
        'id': 254,
        'name': '尼泊尔',
        'children': [
            {
                'id': 25400,
                'name': '巴格马蒂'
            },
            {
                'id': 25401,
                'name': '道拉吉里'
            },
            {
                'id': 25402,
                'name': '甘达基'
            },
            {
                'id': 25403,
                'name': '戈西'
            },
            {
                'id': 25404,
                'name': '格尔纳利'
            },
            {
                'id': 25405,
                'name': '贾纳克布尔'
            },
            {
                'id': 25406,
                'name': '拉布蒂'
            },
            {
                'id': 25407,
                'name': '蓝毗尼'
            },
            {
                'id': 25408,
                'name': '马哈卡利'
            },
            {
                'id': 25409,
                'name': '梅吉'
            },
            {
                'id': 25410,
                'name': '纳拉亚尼'
            },
            {
                'id': 25411,
                'name': '佩里'
            },
            {
                'id': 25412,
                'name': '萨加玛塔'
            },
            {
                'id': 25413,
                'name': '塞蒂'
            }
        ]
    },
    {
        'id': 255,
        'name': '尼加拉瓜',
        'children': [
            {
                'id': 25500,
                'name': '埃斯特利'
            },
            {
                'id': 25501,
                'name': '北大西洋'
            },
            {
                'id': 25502,
                'name': '博阿科'
            },
            {
                'id': 25503,
                'name': '尼加拉瓜·格拉纳达'
            },
            {
                'id': 25504,
                'name': '卡拉索'
            },
            {
                'id': 25505,
                'name': '尼加拉瓜·莱昂'
            },
            {
                'id': 25506,
                'name': '里瓦斯'
            },
            {
                'id': 25507,
                'name': '马德里斯'
            },
            {
                'id': 25508,
                'name': '马那瓜'
            },
            {
                'id': 25509,
                'name': '马萨亚'
            },
            {
                'id': 25510,
                'name': '马塔加尔帕'
            },
            {
                'id': 25511,
                'name': '南大西洋'
            },
            {
                'id': 25512,
                'name': '奇南德加'
            },
            {
                'id': 25513,
                'name': '琼塔莱斯'
            },
            {
                'id': 25514,
                'name': '圣胡安河'
            },
            {
                'id': 25515,
                'name': '希诺特加'
            },
            {
                'id': 25516,
                'name': '新塞哥维亚'
            }
        ]
    },
    {
        'id': 256,
        'name': '尼日尔',
        'children': [
            {
                'id': 25600,
                'name': '阿加德兹'
            },
            {
                'id': 25601,
                'name': '迪法'
            },
            {
                'id': 25602,
                'name': '蒂拉贝里'
            },
            {
                'id': 25603,
                'name': '多索'
            },
            {
                'id': 25604,
                'name': '津德尔'
            },
            {
                'id': 25605,
                'name': '马拉迪'
            },
            {
                'id': 25606,
                'name': '尼亚美市'
            },
            {
                'id': 25607,
                'name': '塔瓦'
            }
        ]
    },
    {
        'id': 257,
        'name': '尼日利亚',
        'children': [
            {
                'id': 25700,
                'name': '阿比亚'
            },
            {
                'id': 25701,
                'name': '奥博莫绍'
            },
            {
                'id': 25702,
                'name': '卡诺'
            },
            {
                'id': 25703,
                'name': '拉各斯'
            },
            {
                'id': 25704,
                'name': '伊巴丹'
            }
        ]
    },
    {
        'id': 258,
        'name': '纽埃'
    },
    {
        'id': 259,
        'name': '挪威',
        'children': [
            {
                'id': 25900,
                'name': '阿克什胡斯'
            },
            {
                'id': 25901,
                'name': '奥普兰'
            },
            {
                'id': 25902,
                'name': '奥斯陆市'
            },
            {
                'id': 25903,
                'name': '北特伦德拉格'
            },
            {
                'id': 25904,
                'name': '布斯克吕'
            },
            {
                'id': 25905,
                'name': '东阿格德尔'
            },
            {
                'id': 25906,
                'name': '东福尔'
            },
            {
                'id': 25907,
                'name': '芬马克'
            },
            {
                'id': 25908,
                'name': '海德马克'
            },
            {
                'id': 25909,
                'name': '霍达兰'
            },
            {
                'id': 25910,
                'name': '罗加兰'
            },
            {
                'id': 25911,
                'name': '默勒－鲁姆斯达尔'
            },
            {
                'id': 25912,
                'name': '南特伦德拉格'
            },
            {
                'id': 25913,
                'name': '诺尔兰'
            },
            {
                'id': 25914,
                'name': '松恩－菲尤拉讷'
            },
            {
                'id': 25915,
                'name': '泰勒马克'
            },
            {
                'id': 25916,
                'name': '特罗姆斯'
            },
            {
                'id': 25917,
                'name': '西阿格德尔'
            },
            {
                'id': 25918,
                'name': '西福尔'
            }
        ]
    },
    {
        'id': 260,
        'name': '帕劳群岛'
    },
    {
        'id': 261,
        'name': '皮特凯恩'
    },
    {
        'id': 262,
        'name': '葡萄牙',
        'children': [
            {
                'id': 26200,
                'name': '滨海阿连特茹'
            },
            {
                'id': 26201,
                'name': '滨海皮尼亚尔'
            },
            {
                'id': 26202,
                'name': '波尔图'
            },
            {
                'id': 26203,
                'name': '杜罗'
            },
            {
                'id': 26204,
                'name': '恩特拉杜罗伏日'
            },
            {
                'id': 26205,
                'name': '法鲁'
            },
            {
                'id': 26206,
                'name': '丰沙尔'
            },
            {
                'id': 26207,
                'name': '卡瓦多'
            },
            {
                'id': 26208,
                'name': '科瓦贝拉'
            },
            {
                'id': 26209,
                'name': '里斯本'
            },
            {
                'id': 26210,
                'name': '利巴特茹'
            },
            {
                'id': 26211,
                'name': '梅地奥特茹'
            },
            {
                'id': 26212,
                'name': '米尼奥-利马'
            },
            {
                'id': 26213,
                'name': '内贝拉北'
            },
            {
                'id': 26214,
                'name': '内贝拉南'
            },
            {
                'id': 26215,
                'name': '内皮尼亚尔北'
            },
            {
                'id': 26216,
                'name': '内皮尼亚尔南'
            },
            {
                'id': 26217,
                'name': '蓬塔德尔加达'
            },
            {
                'id': 26218,
                'name': '塞图巴尔半岛'
            },
            {
                'id': 26219,
                'name': '山后'
            },
            {
                'id': 26220,
                'name': '上阿连特茹'
            },
            {
                'id': 26221,
                'name': '上特拉斯山'
            },
            {
                'id': 26222,
                'name': '塔梅加'
            },
            {
                'id': 26223,
                'name': '万福'
            },
            {
                'id': 26224,
                'name': '下阿连特茹'
            },
            {
                'id': 26225,
                'name': '下伏日'
            },
            {
                'id': 26226,
                'name': '下蒙德古'
            },
            {
                'id': 26227,
                'name': '中阿连特茹'
            }
        ]
    },
    {
        'id': 263,
        'name': '乔治亚'
    },
    {
        'id': 264,
        'name': '瑞典',
        'children': [
            {
                'id': 26400,
                'name': '北博滕'
            },
            {
                'id': 26401,
                'name': '布莱金厄'
            },
            {
                'id': 26402,
                'name': '达拉纳'
            },
            {
                'id': 26403,
                'name': '东约特兰'
            },
            {
                'id': 26404,
                'name': '厄勒布鲁'
            },
            {
                'id': 26405,
                'name': '哥得兰'
            },
            {
                'id': 26406,
                'name': '哈兰'
            },
            {
                'id': 26407,
                'name': '卡尔马'
            },
            {
                'id': 26408,
                'name': '克鲁努贝里'
            },
            {
                'id': 26409,
                'name': '南曼兰'
            },
            {
                'id': 26410,
                'name': '斯德哥尔摩'
            },
            {
                'id': 26411,
                'name': '斯科耐'
            },
            {
                'id': 26412,
                'name': '韦姆兰'
            },
            {
                'id': 26413,
                'name': '乌普萨拉'
            },
            {
                'id': 26414,
                'name': '西博滕'
            },
            {
                'id': 26415,
                'name': '西曼兰'
            },
            {
                'id': 26416,
                'name': '西诺尔兰'
            },
            {
                'id': 26417,
                'name': '西约特兰'
            },
            {
                'id': 26418,
                'name': '延雪平'
            },
            {
                'id': 26419,
                'name': '耶夫勒堡'
            },
            {
                'id': 26420,
                'name': '耶姆特兰'
            }
        ]
    },
    {
        'id': 265,
        'name': '瑞士',
        'children': [
            {
                'id': 26500,
                'name': '阿尔高'
            },
            {
                'id': 26501,
                'name': '巴塞尔城市'
            },
            {
                'id': 26502,
                'name': '巴塞尔乡村'
            },
            {
                'id': 26503,
                'name': '伯尔尼'
            },
            {
                'id': 26504,
                'name': '楚格'
            },
            {
                'id': 26505,
                'name': '弗里堡'
            },
            {
                'id': 26506,
                'name': '格拉鲁斯'
            },
            {
                'id': 26507,
                'name': '格劳宾登'
            },
            {
                'id': 26508,
                'name': '卢塞恩'
            },
            {
                'id': 26509,
                'name': '洛桑'
            },
            {
                'id': 26510,
                'name': '纳沙泰尔'
            },
            {
                'id': 26511,
                'name': '内阿彭策尔'
            },
            {
                'id': 26512,
                'name': '日内瓦'
            },
            {
                'id': 26513,
                'name': '汝拉'
            },
            {
                'id': 26514,
                'name': '沙夫豪森'
            },
            {
                'id': 26515,
                'name': '上瓦尔登'
            },
            {
                'id': 26516,
                'name': '圣加仑'
            },
            {
                'id': 26517,
                'name': '施维茨'
            },
            {
                'id': 26518,
                'name': '苏黎世'
            },
            {
                'id': 26519,
                'name': '索洛图恩'
            },
            {
                'id': 26520,
                'name': '提契诺'
            },
            {
                'id': 26521,
                'name': '图尔高'
            },
            {
                'id': 26522,
                'name': '瓦莱'
            },
            {
                'id': 26523,
                'name': '外阿彭策尔'
            },
            {
                'id': 26524,
                'name': '沃'
            },
            {
                'id': 26525,
                'name': '乌里'
            },
            {
                'id': 26526,
                'name': '下瓦尔登'
            }
        ]
    },
    {
        'id': 266,
        'name': '萨尔瓦多',
        'children': [
            {
                'id': 26600,
                'name': '阿波帕'
            },
            {
                'id': 26601,
                'name': '阿瓦查潘'
            },
            {
                'id': 26602,
                'name': '查拉特南戈'
            },
            {
                'id': 26603,
                'name': '德尔加多'
            },
            {
                'id': 26604,
                'name': '基埃-恩特姆'
            },
            {
                'id': 26605,
                'name': '卡瓦尼亚斯'
            },
            {
                'id': 26606,
                'name': '库斯卡特兰'
            },
            {
                'id': 26607,
                'name': '萨尔瓦多·拉巴斯'
            },
            {
                'id': 26608,
                'name': '拉利伯塔德'
            },
            {
                'id': 26609,
                'name': '拉乌尼翁'
            },
            {
                'id': 26610,
                'name': '梅基卡诺斯'
            },
            {
                'id': 26611,
                'name': '莫拉桑'
            },
            {
                'id': 26612,
                'name': '萨尔瓦多·圣安娜'
            },
            {
                'id': 26613,
                'name': '圣米格尔'
            },
            {
                'id': 26614,
                'name': '圣萨尔瓦多'
            },
            {
                'id': 26615,
                'name': '圣维森特'
            },
            {
                'id': 26616,
                'name': '松索纳特'
            },
            {
                'id': 26617,
                'name': '索亚潘戈'
            },
            {
                'id': 26618,
                'name': '韦莱-恩萨斯'
            },
            {
                'id': 26619,
                'name': '乌苏卢坦'
            },
            {
                'id': 26620,
                'name': '伊洛潘戈'
            },
            {
                'id': 26621,
                'name': '中南'
            }
        ]
    },
    {
        'id': 267,
        'name': '萨摩亚'
    },
    {
        'id': 268,
        'name': '塞尔维亚,黑山',
        'children': [
            {
                'id': 26800,
                'name': '贝尔格莱德'
            },
            {
                'id': 26801,
                'name': '波德戈里察'
            },
            {
                'id': 26802,
                'name': '克拉古涅瓦茨'
            },
            {
                'id': 26803,
                'name': '尼什'
            },
            {
                'id': 26804,
                'name': '诺维萨德'
            },
            {
                'id': 26805,
                'name': '普里什蒂纳'
            },
            {
                'id': 26806,
                'name': '苏博蒂察'
            },
            {
                'id': 26807,
                'name': '泽蒙'
            }
        ]
    },
    {
        'id': 269,
        'name': '塞拉利昂'
    },
    {
        'id': 270,
        'name': '塞内加尔',
        'children': [
            {
                'id': 27000,
                'name': '达喀尔'
            },
            {
                'id': 27001,
                'name': '法蒂克'
            },
            {
                'id': 27002,
                'name': '济金绍尔'
            },
            {
                'id': 27003,
                'name': '捷斯'
            },
            {
                'id': 27004,
                'name': '久尔贝勒'
            },
            {
                'id': 27005,
                'name': '考拉克'
            },
            {
                'id': 27006,
                'name': '科尔达'
            },
            {
                'id': 27007,
                'name': '卢加'
            },
            {
                'id': 27008,
                'name': '马塔姆'
            },
            {
                'id': 27009,
                'name': '圣路易'
            },
            {
                'id': 27010,
                'name': '坦巴昆达'
            }
        ]
    },
    {
        'id': 271,
        'name': '塞浦路斯',
        'children': [
            {
                'id': 27100,
                'name': '法马古斯塔'
            },
            {
                'id': 27101,
                'name': '凯里尼亚'
            },
            {
                'id': 27102,
                'name': '拉纳卡'
            },
            {
                'id': 27103,
                'name': '利马索尔'
            },
            {
                'id': 27104,
                'name': '尼科西亚'
            },
            {
                'id': 27105,
                'name': '帕福斯'
            }
        ]
    },
    {
        'id': 272,
        'name': '塞舌尔'
    },
    {
        'id': 273,
        'name': '沙特阿拉伯',
        'children': [
            {
                'id': 27300,
                'name': '阿尔阿尔'
            },
            {
                'id': 27301,
                'name': '艾卜哈'
            },
            {
                'id': 27302,
                'name': '巴哈'
            },
            {
                'id': 27303,
                'name': '布赖代'
            },
            {
                'id': 27304,
                'name': '沙特阿拉伯·达曼'
            },
            {
                'id': 27305,
                'name': '哈费尔巴廷'
            },
            {
                'id': 27306,
                'name': '哈伊勒'
            },
            {
                'id': 27307,
                'name': '海米斯穆谢特'
            },
            {
                'id': 27308,
                'name': '海耶'
            },
            {
                'id': 27309,
                'name': '胡富夫'
            },
            {
                'id': 27310,
                'name': '吉达'
            },
            {
                'id': 27311,
                'name': '吉赞'
            },
            {
                'id': 27312,
                'name': '利雅得'
            },
            {
                'id': 27313,
                'name': '麦地那'
            },
            {
                'id': 27314,
                'name': '麦加'
            },
            {
                'id': 27315,
                'name': '姆巴拉兹'
            },
            {
                'id': 27316,
                'name': '纳季兰'
            },
            {
                'id': 27317,
                'name': '塞卡卡'
            },
            {
                'id': 27318,
                'name': '塔布克'
            },
            {
                'id': 27319,
                'name': '塔伊夫'
            },
            {
                'id': 27320,
                'name': '延布'
            },
            {
                'id': 27321,
                'name': '朱拜勒'
            }
        ]
    },
    {
        'id': 274,
        'name': '圣诞岛'
    },
    {
        'id': 275,
        'name': '圣多美和普林西比'
    },
    {
        'id': 276,
        'name': '圣赫勒拿'
    },
    {
        'id': 277,
        'name': '圣基茨和尼维斯'
    },
    {
        'id': 278,
        'name': '圣卢西亚'
    },
    {
        'id': 279,
        'name': '圣马力诺'
    },
    {
        'id': 280,
        'name': '圣皮埃尔和米克隆群岛'
    },
    {
        'id': 281,
        'name': '圣文森特和格林纳丁斯'
    },
    {
        'id': 282,
        'name': '斯里兰卡',
        'children': [
            {
                'id': 28200,
                'name': '阿努拉德普勒'
            },
            {
                'id': 28201,
                'name': '安帕赖'
            },
            {
                'id': 28202,
                'name': '巴杜勒'
            },
            {
                'id': 28203,
                'name': '拜蒂克洛'
            },
            {
                'id': 28204,
                'name': '波隆纳鲁沃'
            },
            {
                'id': 28205,
                'name': '汉班托特'
            },
            {
                'id': 28206,
                'name': '基里诺奇'
            },
            {
                'id': 28207,
                'name': '加勒'
            },
            {
                'id': 28208,
                'name': '加姆珀哈'
            },
            {
                'id': 28209,
                'name': '贾夫纳'
            },
            {
                'id': 28210,
                'name': '卡卢特勒'
            },
            {
                'id': 28211,
                'name': '凯格勒'
            },
            {
                'id': 28212,
                'name': '康提'
            },
            {
                'id': 28213,
                'name': '科伦坡'
            },
            {
                'id': 28214,
                'name': '库鲁内格勒'
            },
            {
                'id': 28215,
                'name': '拉特纳普勒'
            },
            {
                'id': 28216,
                'name': '马纳尔'
            },
            {
                'id': 28217,
                'name': '马特莱'
            },
            {
                'id': 28218,
                'name': '马特勒'
            },
            {
                'id': 28219,
                'name': '莫讷勒格勒'
            },
            {
                'id': 28220,
                'name': '穆莱蒂武'
            },
            {
                'id': 28221,
                'name': '努沃勒埃利耶'
            },
            {
                'id': 28222,
                'name': '普塔勒姆'
            },
            {
                'id': 28223,
                'name': '亭可马里'
            },
            {
                'id': 28224,
                'name': '瓦武尼亚'
            }
        ]
    },
    {
        'id': 283,
        'name': '斯洛伐克',
        'children': [
            {
                'id': 28300,
                'name': '班斯卡-比斯特里察'
            },
            {
                'id': 28301,
                'name': '布拉迪斯拉发'
            },
            {
                'id': 28302,
                'name': '科希策'
            },
            {
                'id': 28303,
                'name': '尼特拉'
            },
            {
                'id': 28304,
                'name': '普雷绍夫'
            },
            {
                'id': 28305,
                'name': '日利纳'
            },
            {
                'id': 28306,
                'name': '特尔纳瓦'
            },
            {
                'id': 28307,
                'name': '特伦钦'
            }
        ]
    },
    {
        'id': 284,
        'name': '斯洛文尼亚',
        'children': [
            {
                'id': 28400,
                'name': '奥巴尔诺-克拉'
            },
            {
                'id': 28401,
                'name': '奥斯雷德涅斯洛文'
            },
            {
                'id': 28402,
                'name': '波德拉夫'
            },
            {
                'id': 28403,
                'name': '波穆尔'
            },
            {
                'id': 28404,
                'name': '多雷尼'
            },
            {
                'id': 28405,
                'name': '戈雷尼'
            },
            {
                'id': 28406,
                'name': '戈里'
            },
            {
                'id': 28407,
                'name': '科洛'
            },
            {
                'id': 28408,
                'name': '诺特拉尼'
            },
            {
                'id': 28409,
                'name': '萨维尼'
            },
            {
                'id': 28410,
                'name': '斯波德涅波萨夫'
            },
            {
                'id': 28411,
                'name': '扎萨夫'
            }
        ]
    },
    {
        'id': 285,
        'name': '斯瓦尔巴和扬马廷'
    },
    {
        'id': 286,
        'name': '斯威士兰'
    },
    {
        'id': 287,
        'name': '苏丹',
        'children': [
            {
                'id': 28700,
                'name': '赤道'
            },
            {
                'id': 28701,
                'name': '达尔富尔'
            },
            {
                'id': 28702,
                'name': '加扎勒河'
            },
            {
                'id': 28703,
                'name': '喀土穆'
            },
            {
                'id': 28704,
                'name': '科尔多凡'
            },
            {
                'id': 28705,
                'name': '上尼罗'
            }
        ]
    },
    {
        'id': 288,
        'name': '苏里南',
        'children': [
            {
                'id': 28800,
                'name': '布罗科蓬多'
            },
            {
                'id': 28801,
                'name': '科罗尼'
            },
            {
                'id': 28802,
                'name': '科默韦讷'
            },
            {
                'id': 28803,
                'name': '马罗韦讷'
            },
            {
                'id': 28804,
                'name': '尼克里'
            },
            {
                'id': 28805,
                'name': '苏里南·帕拉'
            },
            {
                'id': 28806,
                'name': '帕拉马里博'
            },
            {
                'id': 28807,
                'name': '萨拉马卡'
            },
            {
                'id': 28808,
                'name': '瓦尼卡'
            },
            {
                'id': 28809,
                'name': '西帕里韦尼'
            }
        ]
    },
    {
        'id': 289,
        'name': '所罗门群岛',
        'children': [
            {
                'id': 28900,
                'name': '瓜达尔卡纳尔'
            },
            {
                'id': 28901,
                'name': '霍尼亚拉'
            },
            {
                'id': 28902,
                'name': '拉纳尔和贝罗纳'
            },
            {
                'id': 28903,
                'name': '马基拉'
            },
            {
                'id': 28904,
                'name': '马莱塔'
            },
            {
                'id': 28905,
                'name': '乔伊索'
            },
            {
                'id': 28906,
                'name': '泰莫图'
            },
            {
                'id': 28907,
                'name': '伊萨贝尔'
            }
        ]
    },
    {
        'id': 290,
        'name': '索马里'
    },
    {
        'id': 291,
        'name': '塔吉克斯坦',
        'children': [
            {
                'id': 29100,
                'name': '杜尚别'
            },
            {
                'id': 29101,
                'name': '霍罗格'
            },
            {
                'id': 29102,
                'name': '卡尼巴达姆'
            },
            {
                'id': 29103,
                'name': '科法尔尼洪'
            },
            {
                'id': 29104,
                'name': '苦盏'
            },
            {
                'id': 29105,
                'name': '库尔干-秋别'
            },
            {
                'id': 29106,
                'name': '库洛布'
            },
            {
                'id': 29107,
                'name': '洛贡'
            },
            {
                'id': 29108,
                'name': '努雷克'
            },
            {
                'id': 29109,
                'name': '彭吉肯特'
            },
            {
                'id': 29110,
                'name': '萨班特'
            },
            {
                'id': 29111,
                'name': '塔博沙尔'
            },
            {
                'id': 29112,
                'name': '图尔孙扎德'
            },
            {
                'id': 29113,
                'name': '乌拉秋别'
            },
            {
                'id': 29114,
                'name': '伊斯法拉'
            }
        ]
    },
    {
        'id': 292,
        'name': '泰国',
        'children': [
            {
                'id': 29200,
                'name': '安纳乍能'
            },
            {
                'id': 29201,
                'name': '巴蜀'
            },
            {
                'id': 29202,
                'name': '巴吞他尼'
            },
            {
                'id': 29203,
                'name': '巴真'
            },
            {
                'id': 29204,
                'name': '北碧'
            },
            {
                'id': 29205,
                'name': '北标'
            },
            {
                'id': 29206,
                'name': '北大年'
            },
            {
                'id': 29207,
                'name': '北揽'
            },
            {
                'id': 29208,
                'name': '北榄坡'
            },
            {
                'id': 29209,
                'name': '北柳'
            },
            {
                'id': 29210,
                'name': '碧差汶'
            },
            {
                'id': 29211,
                'name': '博达伦'
            },
            {
                'id': 29212,
                'name': '猜那'
            },
            {
                'id': 29213,
                'name': '猜也奔'
            },
            {
                'id': 29214,
                'name': '程逸'
            },
            {
                'id': 29215,
                'name': '春蓬'
            },
            {
                'id': 29216,
                'name': '春武里'
            },
            {
                'id': 29217,
                'name': '达'
            },
            {
                'id': 29218,
                'name': '达叻'
            },
            {
                'id': 29219,
                'name': '大城'
            },
            {
                'id': 29220,
                'name': '董里'
            },
            {
                'id': 29221,
                'name': '佛丕'
            },
            {
                'id': 29222,
                'name': '佛统'
            },
            {
                'id': 29223,
                'name': '甘烹碧'
            },
            {
                'id': 29224,
                'name': '红统'
            },
            {
                'id': 29225,
                'name': '华富里'
            },
            {
                'id': 29226,
                'name': '加拉信'
            },
            {
                'id': 29227,
                'name': '甲米'
            },
            {
                'id': 29228,
                'name': '尖竹汶'
            },
            {
                'id': 29229,
                'name': '孔敬'
            },
            {
                'id': 29230,
                'name': '拉农'
            },
            {
                'id': 29231,
                'name': '廊开'
            },
            {
                'id': 29232,
                'name': '廊莫那浦'
            },
            {
                'id': 29233,
                'name': '叻丕'
            },
            {
                'id': 29234,
                'name': '黎'
            },
            {
                'id': 29235,
                'name': '黎逸'
            },
            {
                'id': 29236,
                'name': '龙仔厝'
            },
            {
                'id': 29237,
                'name': '罗勇'
            },
            {
                'id': 29238,
                'name': '洛坤'
            },
            {
                'id': 29239,
                'name': '玛哈沙拉堪'
            },
            {
                'id': 29240,
                'name': '曼谷'
            },
            {
                'id': 29241,
                'name': '莫达汉'
            },
            {
                'id': 29242,
                'name': '那空那育'
            },
            {
                'id': 29243,
                'name': '那空帕农'
            },
            {
                'id': 29244,
                'name': '难'
            },
            {
                'id': 29245,
                'name': '南奔'
            },
            {
                'id': 29246,
                'name': '暖武里'
            },
            {
                'id': 29247,
                'name': '帕'
            },
            {
                'id': 29248,
                'name': '帕尧'
            },
            {
                'id': 29249,
                'name': '攀牙'
            },
            {
                'id': 29250,
                'name': '彭世洛'
            },
            {
                'id': 29251,
                'name': '披集'
            },
            {
                'id': 29252,
                'name': '普吉'
            },
            {
                'id': 29253,
                'name': '清莱'
            },
            {
                'id': 29254,
                'name': '清迈'
            },
            {
                'id': 29255,
                'name': '色军'
            },
            {
                'id': 29256,
                'name': '沙敦'
            },
            {
                'id': 29257,
                'name': '沙缴'
            },
            {
                'id': 29258,
                'name': '四色菊'
            },
            {
                'id': 29259,
                'name': '宋卡'
            },
            {
                'id': 29260,
                'name': '素可泰'
            },
            {
                'id': 29261,
                'name': '素叻'
            },
            {
                'id': 29262,
                'name': '素林'
            },
            {
                'id': 29263,
                'name': '素攀武里'
            },
            {
                'id': 29264,
                'name': '陶公'
            },
            {
                'id': 29265,
                'name': '乌隆'
            },
            {
                'id': 29266,
                'name': '乌泰他尼'
            },
            {
                'id': 29267,
                'name': '乌汶'
            },
            {
                'id': 29268,
                'name': '武里南'
            },
            {
                'id': 29269,
                'name': '信武里'
            },
            {
                'id': 29270,
                'name': '耶梭通'
            },
            {
                'id': 29271,
                'name': '也拉'
            },
            {
                'id': 29272,
                'name': '夜丰颂'
            },
            {
                'id': 29273,
                'name': '夜功'
            }
        ]
    },
    {
        'id': 293,
        'name': '坦桑尼亚',
        'children': [
            {
                'id': 29300,
                'name': '阿鲁沙'
            },
            {
                'id': 29301,
                'name': '奔巴北'
            },
            {
                'id': 29302,
                'name': '奔巴南'
            },
            {
                'id': 29303,
                'name': '坦桑尼亚·滨海'
            },
            {
                'id': 29304,
                'name': '达累斯萨拉姆'
            },
            {
                'id': 29305,
                'name': '多多马'
            },
            {
                'id': 29306,
                'name': '基戈马'
            },
            {
                'id': 29307,
                'name': '卡盖拉'
            },
            {
                'id': 29308,
                'name': '林迪'
            },
            {
                'id': 29309,
                'name': '鲁夸'
            },
            {
                'id': 29310,
                'name': '鲁伍马'
            },
            {
                'id': 29311,
                'name': '马腊'
            },
            {
                'id': 29312,
                'name': '曼亚拉'
            },
            {
                'id': 29313,
                'name': '莫洛戈罗'
            },
            {
                'id': 29314,
                'name': '姆贝亚'
            },
            {
                'id': 29315,
                'name': '姆特瓦拉'
            },
            {
                'id': 29316,
                'name': '姆万扎'
            },
            {
                'id': 29317,
                'name': '乞力马扎罗'
            },
            {
                'id': 29318,
                'name': '桑给巴尔'
            },
            {
                'id': 29319,
                'name': '桑给巴尔北'
            },
            {
                'id': 29320,
                'name': '桑给巴尔南'
            },
            {
                'id': 29321,
                'name': '桑给巴尔市和西'
            },
            {
                'id': 29322,
                'name': '塔波拉'
            },
            {
                'id': 29323,
                'name': '坦噶'
            },
            {
                'id': 29324,
                'name': '辛吉达'
            },
            {
                'id': 29325,
                'name': '欣延加'
            },
            {
                'id': 29326,
                'name': '伊林加'
            }
        ]
    },
    {
        'id': 294,
        'name': '汤加',
        'children': [
            {
                'id': 29400,
                'name': '埃瓦'
            },
            {
                'id': 29401,
                'name': '哈派'
            },
            {
                'id': 29402,
                'name': '纽阿斯'
            },
            {
                'id': 29403,
                'name': '汤加塔布'
            },
            {
                'id': 29404,
                'name': '瓦瓦乌'
            }
        ]
    },
    {
        'id': 295,
        'name': '特克斯和凯克特斯群岛'
    },
    {
        'id': 296,
        'name': '特里斯坦达昆哈'
    },
    {
        'id': 297,
        'name': '特立尼达和多巴哥'
    },
    {
        'id': 298,
        'name': '突尼斯',
        'children': [
            {
                'id': 29800,
                'name': '艾尔亚奈'
            },
            {
                'id': 29801,
                'name': '巴杰'
            },
            {
                'id': 29802,
                'name': '本阿鲁斯'
            },
            {
                'id': 29803,
                'name': '比塞大'
            },
            {
                'id': 29804,
                'name': '吉比利'
            },
            {
                'id': 29805,
                'name': '加贝斯'
            },
            {
                'id': 29806,
                'name': '加夫萨'
            },
            {
                'id': 29807,
                'name': '坚杜拜'
            },
            {
                'id': 29808,
                'name': '卡夫'
            },
            {
                'id': 29809,
                'name': '卡塞林'
            },
            {
                'id': 29810,
                'name': '凯鲁万'
            },
            {
                'id': 29811,
                'name': '马赫迪耶'
            },
            {
                'id': 29812,
                'name': '马努巴'
            },
            {
                'id': 29813,
                'name': '梅德宁'
            },
            {
                'id': 29814,
                'name': '莫纳斯提尔'
            },
            {
                'id': 29815,
                'name': '纳布勒'
            },
            {
                'id': 29816,
                'name': '斯法克斯'
            },
            {
                'id': 29817,
                'name': '苏塞'
            },
            {
                'id': 29818,
                'name': '泰塔温'
            },
            {
                'id': 29819,
                'name': '突尼斯·突尼斯'
            },
            {
                'id': 29820,
                'name': '托泽尔'
            },
            {
                'id': 29821,
                'name': '西迪布济德'
            },
            {
                'id': 29822,
                'name': '锡勒亚奈'
            },
            {
                'id': 29823,
                'name': '宰格万'
            }
        ]
    },
    {
        'id': 299,
        'name': '图瓦卢'
    },
    {
        'id': 300,
        'name': '土耳其',
        'children': [
            {
                'id': 30000,
                'name': '阿达纳'
            },
            {
                'id': 30001,
                'name': '阿德亚曼'
            },
            {
                'id': 30002,
                'name': '阿尔达罕'
            },
            {
                'id': 30003,
                'name': '阿尔特温'
            },
            {
                'id': 30004,
                'name': '阿菲永'
            },
            {
                'id': 30005,
                'name': '阿克萨赖'
            },
            {
                'id': 30006,
                'name': '阿勒'
            },
            {
                'id': 30007,
                'name': '阿马西亚'
            },
            {
                'id': 30008,
                'name': '埃迪尔内'
            },
            {
                'id': 30009,
                'name': '埃尔津詹'
            },
            {
                'id': 30010,
                'name': '埃尔祖鲁姆'
            },
            {
                'id': 30011,
                'name': '埃拉泽'
            },
            {
                'id': 30012,
                'name': '埃斯基谢希尔'
            },
            {
                'id': 30013,
                'name': '艾登'
            },
            {
                'id': 30014,
                'name': '安卡拉'
            },
            {
                'id': 30015,
                'name': '安塔利亚'
            },
            {
                'id': 30016,
                'name': '奥尔杜'
            },
            {
                'id': 30017,
                'name': '巴尔腾'
            },
            {
                'id': 30018,
                'name': '巴勒克埃西尔'
            },
            {
                'id': 30019,
                'name': '巴特曼'
            },
            {
                'id': 30020,
                'name': '巴伊布尔特'
            },
            {
                'id': 30021,
                'name': '比莱吉克'
            },
            {
                'id': 30022,
                'name': '比特利斯'
            },
            {
                'id': 30023,
                'name': '宾格尔'
            },
            {
                'id': 30024,
                'name': '博卢'
            },
            {
                'id': 30025,
                'name': '布尔杜尔'
            },
            {
                'id': 30026,
                'name': '布尔萨'
            },
            {
                'id': 30027,
                'name': '昌克勒'
            },
            {
                'id': 30028,
                'name': '代尼兹利'
            },
            {
                'id': 30029,
                'name': '迪亚巴克尔'
            },
            {
                'id': 30030,
                'name': '凡'
            },
            {
                'id': 30031,
                'name': '哈卡里'
            },
            {
                'id': 30032,
                'name': '哈塔伊'
            },
            {
                'id': 30033,
                'name': '基利斯'
            },
            {
                'id': 30034,
                'name': '吉雷松'
            },
            {
                'id': 30035,
                'name': '加济安泰普'
            },
            {
                'id': 30036,
                'name': '居米什哈内'
            },
            {
                'id': 30037,
                'name': '卡尔斯'
            },
            {
                'id': 30038,
                'name': '卡赫拉曼马拉什'
            },
            {
                'id': 30039,
                'name': '卡拉比克'
            },
            {
                'id': 30040,
                'name': '卡拉曼'
            },
            {
                'id': 30041,
                'name': '卡斯塔莫努'
            },
            {
                'id': 30042,
                'name': '开塞利'
            },
            {
                'id': 30043,
                'name': '科贾埃利'
            },
            {
                'id': 30044,
                'name': '柯克拉雷利'
            },
            {
                'id': 30045,
                'name': '科尼亚'
            },
            {
                'id': 30046,
                'name': '克尔谢希尔'
            },
            {
                'id': 30047,
                'name': '克勒克卡莱'
            },
            {
                'id': 30048,
                'name': '拉飞'
            },
            {
                'id': 30049,
                'name': '里泽'
            },
            {
                'id': 30050,
                'name': '马尔丁'
            },
            {
                'id': 30051,
                'name': '马拉蒂亚'
            },
            {
                'id': 30052,
                'name': '马尼萨'
            },
            {
                'id': 30053,
                'name': '穆拉'
            },
            {
                'id': 30054,
                'name': '穆什'
            },
            {
                'id': 30055,
                'name': '内夫谢希尔'
            },
            {
                'id': 30056,
                'name': '尼代'
            },
            {
                'id': 30057,
                'name': '恰纳卡莱'
            },
            {
                'id': 30058,
                'name': '乔鲁姆'
            },
            {
                'id': 30059,
                'name': '屈塔希亚'
            },
            {
                'id': 30060,
                'name': '萨卡里亚'
            },
            {
                'id': 30061,
                'name': '萨姆松'
            },
            {
                'id': 30062,
                'name': '泰基尔达'
            },
            {
                'id': 30063,
                'name': '特拉布宗'
            },
            {
                'id': 30064,
                'name': '通杰利'
            },
            {
                'id': 30065,
                'name': '托卡特'
            },
            {
                'id': 30066,
                'name': '乌萨克'
            },
            {
                'id': 30067,
                'name': '锡尔纳克'
            },
            {
                'id': 30068,
                'name': '锡尔特'
            },
            {
                'id': 30069,
                'name': '锡诺普'
            },
            {
                'id': 30070,
                'name': '锡瓦斯'
            },
            {
                'id': 30071,
                'name': '伊迪尔'
            },
            {
                'id': 30072,
                'name': '伊切尔'
            },
            {
                'id': 30073,
                'name': '伊斯帕尔塔'
            },
            {
                'id': 30074,
                'name': '伊斯坦布尔'
            },
            {
                'id': 30075,
                'name': '伊兹密尔'
            },
            {
                'id': 30076,
                'name': '约兹加特'
            },
            {
                'id': 30077,
                'name': '宗古尔达克'
            }
        ]
    },
    {
        'id': 301,
        'name': '土库曼斯坦',
        'children': [
            {
                'id': 30100,
                'name': '阿哈尔'
            },
            {
                'id': 30101,
                'name': '阿什哈巴德市'
            },
            {
                'id': 30102,
                'name': '巴尔坎'
            },
            {
                'id': 30103,
                'name': '达沙古兹'
            },
            {
                'id': 30104,
                'name': '列巴普'
            },
            {
                'id': 30105,
                'name': '马雷'
            },
            {
                'id': 30106,
                'name': '涅比特达格'
            }
        ]
    },
    {
        'id': 302,
        'name': '托克劳'
    },
    {
        'id': 303,
        'name': '瓦利斯和福图纳'
    },
    {
        'id': 304,
        'name': '瓦努阿图',
        'children': [
            {
                'id': 30400,
                'name': '马朗帕'
            },
            {
                'id': 30401,
                'name': '彭纳马'
            },
            {
                'id': 30402,
                'name': '桑马'
            },
            {
                'id': 30403,
                'name': '塔菲阿'
            },
            {
                'id': 30404,
                'name': '托尔巴'
            },
            {
                'id': 30405,
                'name': '谢法'
            }
        ]
    },
    {
        'id': 305,
        'name': '危地马拉',
        'children': [
            {
                'id': 30500,
                'name': '埃尔普罗格雷索'
            },
            {
                'id': 30501,
                'name': '埃斯昆特拉'
            },
            {
                'id': 30502,
                'name': '哈拉帕'
            },
            {
                'id': 30503,
                'name': '胡蒂亚帕'
            },
            {
                'id': 30504,
                'name': '基切'
            },
            {
                'id': 30505,
                'name': '克萨尔特南戈'
            },
            {
                'id': 30506,
                'name': '雷塔卢莱乌'
            },
            {
                'id': 30507,
                'name': '米克斯科'
            },
            {
                'id': 30508,
                'name': '佩滕'
            },
            {
                'id': 30509,
                'name': '奇基穆拉'
            },
            {
                'id': 30510,
                'name': '奇马尔特南戈'
            },
            {
                'id': 30511,
                'name': '萨卡帕'
            },
            {
                'id': 30512,
                'name': '萨卡特佩克斯'
            },
            {
                'id': 30513,
                'name': '上韦拉帕斯'
            },
            {
                'id': 30514,
                'name': '危地马拉·圣罗莎'
            },
            {
                'id': 30515,
                'name': '圣马科斯'
            },
            {
                'id': 30516,
                'name': '苏奇特佩克斯'
            },
            {
                'id': 30517,
                'name': '索洛拉'
            },
            {
                'id': 30518,
                'name': '托托尼卡潘'
            },
            {
                'id': 30519,
                'name': '危地马拉市'
            },
            {
                'id': 30520,
                'name': '韦韦特南戈'
            },
            {
                'id': 30521,
                'name': '下韦拉帕斯'
            },
            {
                'id': 30522,
                'name': '新城'
            },
            {
                'id': 30523,
                'name': '伊萨瓦尔'
            }
        ]
    },
    {
        'id': 306,
        'name': '维尔京群岛，美属'
    },
    {
        'id': 307,
        'name': '维尔京群岛，英属'
    },
    {
        'id': 308,
        'name': '委内瑞拉',
        'children': [
            {
                'id': 30800,
                'name': '阿拉瓜'
            },
            {
                'id': 30801,
                'name': '阿马库罗三角洲'
            },
            {
                'id': 30802,
                'name': '阿普雷'
            },
            {
                'id': 30803,
                'name': '安索阿特吉'
            },
            {
                'id': 30804,
                'name': '巴里纳斯'
            },
            {
                'id': 30805,
                'name': '玻利瓦尔'
            },
            {
                'id': 30806,
                'name': '波图格萨'
            },
            {
                'id': 30807,
                'name': '法尔孔'
            },
            {
                'id': 30808,
                'name': '瓜里科'
            },
            {
                'id': 30809,
                'name': '加拉加斯'
            },
            {
                'id': 30810,
                'name': '卡拉沃沃'
            },
            {
                'id': 30811,
                'name': '科赫德斯'
            },
            {
                'id': 30812,
                'name': '拉腊'
            },
            {
                'id': 30813,
                'name': '联邦属地'
            },
            {
                'id': 30814,
                'name': '委内瑞拉·梅里达'
            },
            {
                'id': 30815,
                'name': '米兰达'
            },
            {
                'id': 30816,
                'name': '莫纳加斯'
            },
            {
                'id': 30817,
                'name': '委内瑞拉·苏克雷'
            },
            {
                'id': 30818,
                'name': '苏利亚'
            },
            {
                'id': 30819,
                'name': '塔奇拉'
            },
            {
                'id': 30820,
                'name': '特鲁希略'
            },
            {
                'id': 30821,
                'name': '新埃斯帕塔'
            },
            {
                'id': 30822,
                'name': '亚拉奎'
            },
            {
                'id': 30823,
                'name': '委内瑞拉·亚马逊'
            }
        ]
    },
    {
        'id': 309,
        'name': '文莱'
    },
    {
        'id': 310,
        'name': '乌干达',
        'children': [
            {
                'id': 31000,
                'name': '阿鲁阿'
            },
            {
                'id': 31001,
                'name': '阿帕克'
            },
            {
                'id': 31002,
                'name': '阿朱马尼'
            },
            {
                'id': 31003,
                'name': '本迪布焦'
            },
            {
                'id': 31004,
                'name': '布吉里'
            },
            {
                'id': 31005,
                'name': '布西亚'
            },
            {
                'id': 31006,
                'name': '布谢尼'
            },
            {
                'id': 31007,
                'name': '恩通加莫'
            },
            {
                'id': 31008,
                'name': '古卢'
            },
            {
                'id': 31009,
                'name': '霍伊马'
            },
            {
                'id': 31010,
                'name': '基巴莱'
            },
            {
                'id': 31011,
                'name': '基博加'
            },
            {
                'id': 31012,
                'name': '基恩乔乔'
            },
            {
                'id': 31013,
                'name': '基索罗'
            },
            {
                'id': 31014,
                'name': '基特古姆'
            },
            {
                'id': 31015,
                'name': '金贾'
            },
            {
                'id': 31016,
                'name': '卡巴莱'
            },
            {
                'id': 31017,
                'name': '卡巴罗莱'
            },
            {
                'id': 31018,
                'name': '卡贝拉马伊多'
            },
            {
                'id': 31019,
                'name': '卡兰加拉'
            },
            {
                'id': 31020,
                'name': '卡姆文盖'
            },
            {
                'id': 31021,
                'name': '卡穆利'
            },
            {
                'id': 31022,
                'name': '卡农古'
            },
            {
                'id': 31023,
                'name': '卡普乔鲁瓦'
            },
            {
                'id': 31024,
                'name': '卡塞塞'
            },
            {
                'id': 31025,
                'name': '卡塔奎'
            },
            {
                'id': 31026,
                'name': '卡永加'
            },
            {
                'id': 31027,
                'name': '坎帕拉'
            },
            {
                'id': 31028,
                'name': '科蒂多'
            },
            {
                'id': 31029,
                'name': '库米'
            },
            {
                'id': 31030,
                'name': '拉卡伊'
            },
            {
                'id': 31031,
                'name': '利拉'
            },
            {
                'id': 31032,
                'name': '卢韦罗'
            },
            {
                'id': 31033,
                'name': '鲁昆吉里'
            },
            {
                'id': 31034,
                'name': '马萨卡'
            },
            {
                'id': 31035,
                'name': '马辛迪'
            },
            {
                'id': 31036,
                'name': '马尤盖'
            },
            {
                'id': 31037,
                'name': '莫罗托'
            },
            {
                'id': 31038,
                'name': '莫约'
            },
            {
                'id': 31039,
                'name': '姆巴拉拉'
            },
            {
                'id': 31040,
                'name': '姆巴莱'
            },
            {
                'id': 31041,
                'name': '姆皮吉'
            },
            {
                'id': 31042,
                'name': '穆本德'
            },
            {
                'id': 31043,
                'name': '穆科诺'
            },
            {
                'id': 31044,
                'name': '纳卡皮里皮里特'
            },
            {
                'id': 31045,
                'name': '纳卡松戈拉'
            },
            {
                'id': 31046,
                'name': '内比'
            },
            {
                'id': 31047,
                'name': '帕德尔'
            },
            {
                'id': 31048,
                'name': '帕利萨'
            },
            {
                'id': 31049,
                'name': '森巴布莱'
            },
            {
                'id': 31050,
                'name': '索罗提'
            },
            {
                'id': 31051,
                'name': '托罗罗'
            },
            {
                'id': 31052,
                'name': '瓦基索'
            },
            {
                'id': 31053,
                'name': '锡龙科'
            },
            {
                'id': 31054,
                'name': '伊甘加'
            },
            {
                'id': 31055,
                'name': '永贝'
            }
        ]
    },
    {
        'id': 311,
        'name': '乌克兰',
        'children': [
            {
                'id': 31100,
                'name': '敖德萨'
            },
            {
                'id': 31101,
                'name': '波尔塔瓦'
            },
            {
                'id': 31102,
                'name': '第聂伯罗波得罗夫斯克'
            },
            {
                'id': 31103,
                'name': '顿涅茨克'
            },
            {
                'id': 31104,
                'name': '哈尔科夫'
            },
            {
                'id': 31105,
                'name': '赫尔松州'
            },
            {
                'id': 31106,
                'name': '赫梅利尼茨基'
            },
            {
                'id': 31107,
                'name': '基辅'
            },
            {
                'id': 31108,
                'name': '基洛夫格勒'
            },
            {
                'id': 31109,
                'name': '捷尔诺波尔'
            },
            {
                'id': 31110,
                'name': '克里米亚自治共和国'
            },
            {
                'id': 31111,
                'name': '利沃夫'
            },
            {
                'id': 31112,
                'name': '卢甘斯克'
            },
            {
                'id': 31113,
                'name': '罗夫诺'
            },
            {
                'id': 31114,
                'name': '尼古拉耶夫'
            },
            {
                'id': 31115,
                'name': '切尔卡瑟'
            },
            {
                'id': 31116,
                'name': '切尔尼戈夫'
            },
            {
                'id': 31117,
                'name': '切尔诺夫策'
            },
            {
                'id': 31118,
                'name': '日托米尔'
            },
            {
                'id': 31119,
                'name': '苏梅'
            },
            {
                'id': 31120,
                'name': '外喀尔巴阡'
            },
            {
                'id': 31121,
                'name': '文尼察'
            },
            {
                'id': 31122,
                'name': '乌克兰·沃伦'
            },
            {
                'id': 31123,
                'name': '伊万－弗兰科夫州'
            },
            {
                'id': 31124,
                'name': '扎波罗热'
            }
        ]
    },
    {
        'id': 312,
        'name': '乌拉圭',
        'children': [
            {
                'id': 31200,
                'name': '阿蒂加斯'
            },
            {
                'id': 31201,
                'name': '杜拉斯诺'
            },
            {
                'id': 31202,
                'name': '乌拉圭·佛罗里达'
            },
            {
                'id': 31203,
                'name': '弗洛雷斯'
            },
            {
                'id': 31204,
                'name': '卡内洛内斯'
            },
            {
                'id': 31205,
                'name': '科洛尼亚'
            },
            {
                'id': 31206,
                'name': '拉瓦耶哈'
            },
            {
                'id': 31207,
                'name': '里韦拉'
            },
            {
                'id': 31208,
                'name': '罗恰'
            },
            {
                'id': 31209,
                'name': '马尔多纳多'
            },
            {
                'id': 31210,
                'name': '蒙得维的亚'
            },
            {
                'id': 31211,
                'name': '内格罗河'
            },
            {
                'id': 31212,
                'name': '派桑杜'
            },
            {
                'id': 31213,
                'name': '萨尔托'
            },
            {
                'id': 31214,
                'name': '塞罗拉尔戈'
            },
            {
                'id': 31215,
                'name': '三十三人'
            },
            {
                'id': 31216,
                'name': '乌拉圭·圣何塞'
            },
            {
                'id': 31217,
                'name': '索里亚诺'
            },
            {
                'id': 31218,
                'name': '塔夸伦博'
            }
        ]
    },
    {
        'id': 313,
        'name': '乌兹别克斯坦',
        'children': [
            {
                'id': 31300,
                'name': '安集延'
            },
            {
                'id': 31301,
                'name': '布哈拉'
            },
            {
                'id': 31302,
                'name': '费尔干纳'
            },
            {
                'id': 31303,
                'name': '花拉子模'
            },
            {
                'id': 31304,
                'name': '吉扎克'
            },
            {
                'id': 31305,
                'name': '卡拉卡尔帕克斯坦共和国'
            },
            {
                'id': 31306,
                'name': '卡什卡达里亚'
            },
            {
                'id': 31307,
                'name': '纳曼干'
            },
            {
                'id': 31308,
                'name': '纳沃伊'
            },
            {
                'id': 31309,
                'name': '撒马尔罕'
            },
            {
                'id': 31310,
                'name': '苏尔汉河'
            },
            {
                'id': 31311,
                'name': '塔什干'
            },
            {
                'id': 31312,
                'name': '塔什干市'
            },
            {
                'id': 31313,
                'name': '锡尔河'
            }
        ]
    },
    {
        'id': 314,
        'name': '西班牙',
        'children': [
            {
                'id': 31400,
                'name': '阿尔梅里亚'
            },
            {
                'id': 31401,
                'name': '阿尔瓦塞特'
            },
            {
                'id': 31402,
                'name': '阿拉瓦'
            },
            {
                'id': 31403,
                'name': '阿利坎特'
            },
            {
                'id': 31404,
                'name': '阿斯图利亚斯'
            },
            {
                'id': 31405,
                'name': '阿维拉'
            },
            {
                'id': 31406,
                'name': '奥伦塞'
            },
            {
                'id': 31407,
                'name': '巴达霍斯'
            },
            {
                'id': 31408,
                'name': '巴利阿里'
            },
            {
                'id': 31409,
                'name': '巴利亚多利德'
            },
            {
                'id': 31410,
                'name': '巴伦西亚'
            },
            {
                'id': 31411,
                'name': '巴塞罗那'
            },
            {
                'id': 31412,
                'name': '比斯开'
            },
            {
                'id': 31413,
                'name': '布尔戈斯'
            },
            {
                'id': 31414,
                'name': '格拉纳达'
            },
            {
                'id': 31415,
                'name': '瓜达拉哈拉'
            },
            {
                'id': 31416,
                'name': '哈恩'
            },
            {
                'id': 31417,
                'name': '赫罗纳'
            },
            {
                'id': 31418,
                'name': '吉普斯夸'
            },
            {
                'id': 31419,
                'name': '加的斯'
            },
            {
                'id': 31420,
                'name': '卡塞雷斯'
            },
            {
                'id': 31421,
                'name': '卡斯蒂利亚'
            },
            {
                'id': 31422,
                'name': '卡斯特利翁'
            },
            {
                'id': 31423,
                'name': '科尔多瓦'
            },
            {
                'id': 31424,
                'name': '昆卡'
            },
            {
                'id': 31425,
                'name': '拉科鲁尼亚'
            },
            {
                'id': 31426,
                'name': '拉里奥哈'
            },
            {
                'id': 31427,
                'name': '拉斯帕尔马斯'
            },
            {
                'id': 31428,
                'name': '西班牙·莱昂'
            },
            {
                'id': 31429,
                'name': '莱里达'
            },
            {
                'id': 31430,
                'name': '卢戈'
            },
            {
                'id': 31431,
                'name': '马德里'
            },
            {
                'id': 31432,
                'name': '马拉加'
            },
            {
                'id': 31433,
                'name': '穆尔西亚'
            },
            {
                'id': 31434,
                'name': '纳瓦拉'
            },
            {
                'id': 31435,
                'name': '帕伦西亚'
            },
            {
                'id': 31436,
                'name': '蓬特韦德拉'
            },
            {
                'id': 31437,
                'name': '萨拉戈萨'
            },
            {
                'id': 31438,
                'name': '萨拉曼卡'
            },
            {
                'id': 31439,
                'name': '萨莫拉'
            },
            {
                'id': 31440,
                'name': '塞哥维亚'
            },
            {
                'id': 31441,
                'name': '塞维利亚'
            },
            {
                'id': 31442,
                'name': '西班牙·桑坦德'
            },
            {
                'id': 31443,
                'name': '圣克鲁斯-德特内里费'
            },
            {
                'id': 31444,
                'name': '索里亚'
            },
            {
                'id': 31445,
                'name': '塔拉戈纳'
            },
            {
                'id': 31446,
                'name': '特鲁埃尔'
            },
            {
                'id': 31447,
                'name': '西班牙·托莱多'
            },
            {
                'id': 31448,
                'name': '韦尔瓦'
            },
            {
                'id': 31449,
                'name': '韦斯卡'
            }
        ]
    },
    {
        'id': 315,
        'name': '希腊',
        'children': [
            {
                'id': 31500,
                'name': '比雷埃夫斯'
            },
            {
                'id': 31501,
                'name': '多德卡尼斯'
            },
            {
                'id': 31502,
                'name': '干尼亚'
            },
            {
                'id': 31503,
                'name': '基克拉迪'
            },
            {
                'id': 31504,
                'name': '拉西锡'
            },
            {
                'id': 31505,
                'name': '莱斯博斯'
            },
            {
                'id': 31506,
                'name': '雷西姆农'
            },
            {
                'id': 31507,
                'name': '萨摩斯'
            },
            {
                'id': 31508,
                'name': '雅典'
            },
            {
                'id': 31509,
                'name': '伊拉克里翁'
            }
        ]
    },
    {
        'id': 316,
        'name': '新加坡'
    },
    {
        'id': 317,
        'name': '新喀里多尼亚'
    },
    {
        'id': 318,
        'name': '新西兰',
        'children': [
            {
                'id': 31800,
                'name': '奥克兰'
            },
            {
                'id': 31801,
                'name': '北岸'
            },
            {
                'id': 31802,
                'name': '新西兰·北帕默斯顿'
            },
            {
                'id': 31803,
                'name': '北远'
            },
            {
                'id': 31804,
                'name': '布莱尼姆'
            },
            {
                'id': 31805,
                'name': '达尼丁'
            },
            {
                'id': 31806,
                'name': '格雷茅斯'
            },
            {
                'id': 31807,
                'name': '新西兰·哈密尔顿'
            },
            {
                'id': 31808,
                'name': '黑斯廷斯'
            },
            {
                'id': 31809,
                'name': '怀塔科拉'
            },
            {
                'id': 31810,
                'name': '吉斯伯恩'
            },
            {
                'id': 31811,
                'name': '凯帕拉'
            },
            {
                'id': 31812,
                'name': '克赖斯特彻奇'
            },
            {
                'id': 31813,
                'name': '里士满'
            },
            {
                'id': 31814,
                'name': '马努考'
            },
            {
                'id': 31815,
                'name': '纳尔逊'
            },
            {
                'id': 31816,
                'name': '内皮尔'
            },
            {
                'id': 31817,
                'name': '斯特拉特福德'
            },
            {
                'id': 31818,
                'name': '陶马鲁努伊'
            },
            {
                'id': 31819,
                'name': '瓦卡塔尼'
            },
            {
                'id': 31820,
                'name': '旺阿雷'
            },
            {
                'id': 31821,
                'name': '旺格努伊'
            },
            {
                'id': 31822,
                'name': '新普利茅斯'
            },
            {
                'id': 31823,
                'name': '因弗卡吉尔'
            }
        ]
    },
    {
        'id': 319,
        'name': '匈牙利',
        'children': [
            {
                'id': 31900,
                'name': '巴兰尼亚'
            },
            {
                'id': 31901,
                'name': '巴奇-基什孔'
            },
            {
                'id': 31902,
                'name': '包尔绍德-奥包乌伊-曾普伦'
            },
            {
                'id': 31903,
                'name': '贝凯什'
            },
            {
                'id': 31904,
                'name': '布达佩斯'
            },
            {
                'id': 31905,
                'name': '费耶尔'
            },
            {
                'id': 31906,
                'name': '豪伊杜-比豪尔'
            },
            {
                'id': 31907,
                'name': '赫维什'
            },
            {
                'id': 31908,
                'name': '加兹-纳杰孔-索尔诺克'
            },
            {
                'id': 31909,
                'name': '杰尔-莫松-肖普朗'
            },
            {
                'id': 31910,
                'name': '科马罗姆'
            },
            {
                'id': 31911,
                'name': '诺格拉德'
            },
            {
                'id': 31912,
                'name': '佩斯'
            },
            {
                'id': 31913,
                'name': '琼格拉德'
            },
            {
                'id': 31914,
                'name': '绍莫吉'
            },
            {
                'id': 31915,
                'name': '索博尔奇-索特马尔-贝拉格'
            },
            {
                'id': 31916,
                'name': '托尔瑙'
            },
            {
                'id': 31917,
                'name': '维斯普雷姆'
            },
            {
                'id': 31918,
                'name': '沃什'
            },
            {
                'id': 31919,
                'name': '佐洛'
            }
        ]
    },
    {
        'id': 320,
        'name': '叙利亚',
        'children': [
            {
                'id': 32000,
                'name': '阿勒颇'
            },
            {
                'id': 32001,
                'name': '大马士革'
            },
            {
                'id': 32002,
                'name': '大马士革市'
            },
            {
                'id': 32003,
                'name': '代尔祖尔'
            },
            {
                'id': 32004,
                'name': '德拉'
            },
            {
                'id': 32005,
                'name': '哈马'
            },
            {
                'id': 32006,
                'name': '哈塞克'
            },
            {
                'id': 32007,
                'name': '霍姆斯'
            },
            {
                'id': 32008,
                'name': '加布'
            },
            {
                'id': 32009,
                'name': '卡米什利'
            },
            {
                'id': 32010,
                'name': '库奈特拉'
            },
            {
                'id': 32011,
                'name': '拉卡'
            },
            {
                'id': 32012,
                'name': '拉塔基亚'
            },
            {
                'id': 32013,
                'name': '苏韦达'
            },
            {
                'id': 32014,
                'name': '塔尔图斯'
            },
            {
                'id': 32015,
                'name': '伊德利卜'
            }
        ]
    },
    {
        'id': 321,
        'name': '牙买加',
        'children': [
            {
                'id': 32100,
                'name': '牙买加·波特兰'
            },
            {
                'id': 32101,
                'name': '牙买加·汉诺威'
            },
            {
                'id': 32102,
                'name': '牙买加·金斯敦'
            },
            {
                'id': 32103,
                'name': '克拉伦登'
            },
            {
                'id': 32104,
                'name': '牙买加·曼彻斯特'
            },
            {
                'id': 32105,
                'name': '圣安德鲁斯'
            },
            {
                'id': 32106,
                'name': '圣安娜'
            },
            {
                'id': 32107,
                'name': '圣凯瑟琳'
            },
            {
                'id': 32108,
                'name': '圣玛丽'
            },
            {
                'id': 32109,
                'name': '圣托马斯'
            },
            {
                'id': 32110,
                'name': '圣伊丽莎白'
            },
            {
                'id': 32111,
                'name': '圣詹姆斯'
            },
            {
                'id': 32112,
                'name': '特里洛尼'
            },
            {
                'id': 32113,
                'name': '西摩兰'
            }
        ]
    },
    {
        'id': 322,
        'name': '亚美尼亚',
        'children': [
            {
                'id': 32200,
                'name': '阿尔马维尔'
            },
            {
                'id': 32201,
                'name': '阿拉加措特恩'
            },
            {
                'id': 32202,
                'name': '阿拉拉特'
            },
            {
                'id': 32203,
                'name': '埃里温市'
            },
            {
                'id': 32204,
                'name': '格加尔库尼克'
            },
            {
                'id': 32205,
                'name': '科泰克'
            },
            {
                'id': 32206,
                'name': '洛里'
            },
            {
                'id': 32207,
                'name': '塔武什'
            },
            {
                'id': 32208,
                'name': '瓦约茨·佐尔'
            },
            {
                'id': 32209,
                'name': '希拉克'
            },
            {
                'id': 32210,
                'name': '休尼克'
            }
        ]
    },
    {
        'id': 323,
        'name': '也门',
        'children': [
            {
                'id': 32300,
                'name': '阿比扬'
            },
            {
                'id': 32301,
                'name': '阿姆兰'
            },
            {
                'id': 32302,
                'name': '贝达'
            },
            {
                'id': 32303,
                'name': '达利'
            },
            {
                'id': 32304,
                'name': '哈德拉毛'
            },
            {
                'id': 32305,
                'name': '哈杰'
            },
            {
                'id': 32306,
                'name': '荷台达'
            },
            {
                'id': 32307,
                'name': '焦夫'
            },
            {
                'id': 32308,
                'name': '拉赫季'
            },
            {
                'id': 32309,
                'name': '马里卜'
            },
            {
                'id': 32310,
                'name': '迈赫拉'
            },
            {
                'id': 32311,
                'name': '迈赫维特'
            },
            {
                'id': 32312,
                'name': '萨达'
            },
            {
                'id': 32313,
                'name': '萨那'
            },
            {
                'id': 32314,
                'name': '赛文'
            },
            {
                'id': 32315,
                'name': '舍卜沃'
            },
            {
                'id': 32316,
                'name': '塔伊兹'
            },
            {
                'id': 32317,
                'name': '希赫尔'
            },
            {
                'id': 32318,
                'name': '亚丁'
            },
            {
                'id': 32319,
                'name': '伊卜'
            },
            {
                'id': 32320,
                'name': '扎玛尔'
            }
        ]
    },
    {
        'id': 324,
        'name': '伊拉克'
    },
    {
        'id': 325,
        'name': '伊朗'
    },
    {
        'id': 326,
        'name': '以色列',
        'children': [
            {
                'id': 32600,
                'name': '阿什杜德'
            },
            {
                'id': 32601,
                'name': '贝尔谢巴'
            },
            {
                'id': 32602,
                'name': '贝特雁'
            },
            {
                'id': 32603,
                'name': '海法'
            },
            {
                'id': 32604,
                'name': '霍隆'
            },
            {
                'id': 32605,
                'name': '内坦亚'
            },
            {
                'id': 32606,
                'name': '特拉维夫'
            },
            {
                'id': 32607,
                'name': '耶路撒冷'
            }
        ]
    },
    {
        'id': 327,
        'name': '意大利',
        'children': [
            {
                'id': 32700,
                'name': '阿斯蒂'
            },
            {
                'id': 32701,
                'name': '阿斯科利皮切诺'
            },
            {
                'id': 32702,
                'name': '安科纳'
            },
            {
                'id': 32703,
                'name': '奥尔比亚'
            },
            {
                'id': 32704,
                'name': '奥里斯塔诺'
            },
            {
                'id': 32705,
                'name': '奥斯塔'
            },
            {
                'id': 32706,
                'name': '巴勒莫'
            },
            {
                'id': 32707,
                'name': '意大利·巴里'
            },
            {
                'id': 32708,
                'name': '贝加莫'
            },
            {
                'id': 32709,
                'name': '贝内文托'
            },
            {
                'id': 32710,
                'name': '比萨'
            },
            {
                'id': 32711,
                'name': '波代诺内'
            },
            {
                'id': 32712,
                'name': '波坦察'
            },
            {
                'id': 32713,
                'name': '博洛尼亚'
            },
            {
                'id': 32714,
                'name': '布拉'
            },
            {
                'id': 32715,
                'name': '布雷西亚'
            },
            {
                'id': 32716,
                'name': '布林迪西'
            },
            {
                'id': 32717,
                'name': '的里雅斯特'
            },
            {
                'id': 32718,
                'name': '都灵'
            },
            {
                'id': 32719,
                'name': '费拉拉'
            },
            {
                'id': 32720,
                'name': '佛罗伦萨'
            },
            {
                'id': 32721,
                'name': '福贾'
            },
            {
                'id': 32722,
                'name': '卡利亚里'
            },
            {
                'id': 32723,
                'name': '卡塞塔'
            },
            {
                'id': 32724,
                'name': '卡塔尼亚'
            },
            {
                'id': 32725,
                'name': '卡坦扎罗'
            },
            {
                'id': 32726,
                'name': '坎波巴索'
            },
            {
                'id': 32727,
                'name': '科摩'
            },
            {
                'id': 32728,
                'name': '科森扎'
            },
            {
                'id': 32729,
                'name': '克罗托内'
            },
            {
                'id': 32730,
                'name': '库内奥'
            },
            {
                'id': 32731,
                'name': '拉奎拉'
            },
            {
                'id': 32732,
                'name': '拉斯佩齐亚'
            },
            {
                'id': 32733,
                'name': '莱科'
            },
            {
                'id': 32734,
                'name': '莱切'
            },
            {
                'id': 32735,
                'name': '雷焦艾米利亚'
            },
            {
                'id': 32736,
                'name': '雷焦卡拉布里亚'
            },
            {
                'id': 32737,
                'name': '里窝那'
            },
            {
                'id': 32738,
                'name': '罗马'
            },
            {
                'id': 32739,
                'name': '马萨'
            },
            {
                'id': 32740,
                'name': '马泰拉'
            },
            {
                'id': 32741,
                'name': '蒙扎'
            },
            {
                'id': 32742,
                'name': '米兰'
            },
            {
                'id': 32743,
                'name': '摩德纳'
            },
            {
                'id': 32744,
                'name': '墨西拿'
            },
            {
                'id': 32745,
                'name': '那不勒斯'
            },
            {
                'id': 32746,
                'name': '努奥罗'
            },
            {
                'id': 32747,
                'name': '诺瓦拉'
            },
            {
                'id': 32748,
                'name': '帕尔马'
            },
            {
                'id': 32749,
                'name': '帕维亚'
            },
            {
                'id': 32750,
                'name': '佩鲁贾'
            },
            {
                'id': 32751,
                'name': '热那亚'
            },
            {
                'id': 32752,
                'name': '萨莱诺'
            },
            {
                'id': 32753,
                'name': '萨萨里'
            },
            {
                'id': 32754,
                'name': '萨沃纳'
            },
            {
                'id': 32755,
                'name': '塔兰托'
            },
            {
                'id': 32756,
                'name': '特拉帕尼'
            },
            {
                'id': 32757,
                'name': '特伦托'
            },
            {
                'id': 32758,
                'name': '威尼斯'
            },
            {
                'id': 32759,
                'name': '韦尔切利'
            },
            {
                'id': 32760,
                'name': '维泰博'
            },
            {
                'id': 32761,
                'name': '乌迪内'
            },
            {
                'id': 32762,
                'name': '锡拉库扎'
            },
            {
                'id': 32763,
                'name': '锡耶纳'
            },
            {
                'id': 32764,
                'name': '亚历山德里亚'
            },
            {
                'id': 32765,
                'name': '伊塞尔尼亚'
            }
        ]
    },
    {
        'id': 328,
        'name': '印度',
        'children': [
            {
                'id': 32800,
                'name': '艾藻尔'
            },
            {
                'id': 32801,
                'name': '班加罗尔'
            },
            {
                'id': 32802,
                'name': '本地治里'
            },
            {
                'id': 32803,
                'name': '博帕尔'
            },
            {
                'id': 32804,
                'name': '布巴内斯瓦尔'
            },
            {
                'id': 32805,
                'name': '昌迪加尔'
            },
            {
                'id': 32806,
                'name': '达曼'
            },
            {
                'id': 32807,
                'name': '第乌'
            },
            {
                'id': 32808,
                'name': '甘托克'
            },
            {
                'id': 32809,
                'name': '哥印拜陀'
            },
            {
                'id': 32810,
                'name': '加尔各答'
            },
            {
                'id': 32811,
                'name': '加里加尔'
            },
            {
                'id': 32812,
                'name': '贾巴尔普尔'
            },
            {
                'id': 32813,
                'name': '贾朗达尔'
            },
            {
                'id': 32814,
                'name': '焦特布尔'
            },
            {
                'id': 32815,
                'name': '金奈'
            },
            {
                'id': 32816,
                'name': '卡瓦拉蒂'
            },
            {
                'id': 32817,
                'name': '科希马'
            },
            {
                'id': 32818,
                'name': '马埃'
            },
            {
                'id': 32819,
                'name': '马杜赖'
            },
            {
                'id': 32820,
                'name': '森伯尔布尔'
            },
            {
                'id': 32821,
                'name': '特里凡得琅'
            },
            {
                'id': 32822,
                'name': '乌代布尔'
            },
            {
                'id': 32823,
                'name': '西隆'
            },
            {
                'id': 32824,
                'name': '锡尔萨瓦'
            },
            {
                'id': 32825,
                'name': '新德里'
            },
            {
                'id': 32826,
                'name': '亚南'
            },
            {
                'id': 32827,
                'name': '因帕尔'
            },
            {
                'id': 32828,
                'name': '印多尔'
            },
            {
                'id': 32829,
                'name': '斋普尔'
            }
        ]
    },
    {
        'id': 329,
        'name': '印度尼西亚',
        'children': [
            {
                'id': 32900,
                'name': '巴厘'
            },
            {
                'id': 32901,
                'name': '邦加－勿里洞群岛'
            },
            {
                'id': 32902,
                'name': '北苏拉威西'
            },
            {
                'id': 32903,
                'name': '北苏门答腊'
            },
            {
                'id': 32904,
                'name': '大雅加达首都特区'
            },
            {
                'id': 32905,
                'name': '东加里曼丹'
            },
            {
                'id': 32906,
                'name': '东南苏拉威西'
            },
            {
                'id': 32907,
                'name': '东努沙登加拉'
            },
            {
                'id': 32908,
                'name': '东爪哇'
            },
            {
                'id': 32909,
                'name': '廖内'
            },
            {
                'id': 32910,
                'name': '马鲁古'
            },
            {
                'id': 32911,
                'name': '明古鲁'
            },
            {
                'id': 32912,
                'name': '楠榜'
            },
            {
                'id': 32913,
                'name': '南加里曼丹'
            },
            {
                'id': 32914,
                'name': '南苏拉威西'
            },
            {
                'id': 32915,
                'name': '南苏门答腊'
            },
            {
                'id': 32916,
                'name': '日惹特区'
            },
            {
                'id': 32917,
                'name': '万丹'
            },
            {
                'id': 32918,
                'name': '西努沙登加拉'
            },
            {
                'id': 32919,
                'name': '西苏门答腊'
            },
            {
                'id': 32920,
                'name': '西爪哇'
            },
            {
                'id': 32921,
                'name': '雅加达'
            },
            {
                'id': 32922,
                'name': '亚齐'
            },
            {
                'id': 32923,
                'name': '伊里安查亚'
            },
            {
                'id': 32924,
                'name': '占碑'
            },
            {
                'id': 32925,
                'name': '中加里曼丹'
            },
            {
                'id': 32926,
                'name': '中苏拉威西'
            },
            {
                'id': 32927,
                'name': '中爪哇'
            }
        ]
    },
    {
        'id': 330,
        'name': '英属印度洋领地'
    },
    {
        'id': 331,
        'name': '约旦',
        'children': [
            {
                'id': 33100,
                'name': '阿吉隆'
            },
            {
                'id': 33101,
                'name': '安曼'
            },
            {
                'id': 33102,
                'name': '拜勒加'
            },
            {
                'id': 33103,
                'name': '杰拉什'
            },
            {
                'id': 33104,
                'name': '卡拉克'
            },
            {
                'id': 33105,
                'name': '鲁赛法'
            },
            {
                'id': 33106,
                'name': '马安'
            },
            {
                'id': 33107,
                'name': '马德巴'
            },
            {
                'id': 33108,
                'name': '马夫拉克'
            },
            {
                'id': 33109,
                'name': '塔菲拉'
            },
            {
                'id': 33110,
                'name': '亚喀巴'
            },
            {
                'id': 33111,
                'name': '伊尔比德'
            },
            {
                'id': 33112,
                'name': '扎尔卡'
            }
        ]
    },
    {
        'id': 332,
        'name': '越南',
        'children': [
            {
                'id': 33200,
                'name': '海防'
            },
            {
                'id': 33201,
                'name': '河内'
            },
            {
                'id': 33202,
                'name': '胡志明市'
            }
        ]
    },
    {
        'id': 333,
        'name': '赞比亚',
        'children': [
            {
                'id': 33300,
                'name': '北方'
            },
            {
                'id': 33301,
                'name': '赞比亚·东方'
            },
            {
                'id': 33302,
                'name': '卢阿普拉'
            },
            {
                'id': 33303,
                'name': '卢萨卡'
            },
            {
                'id': 33304,
                'name': '南方'
            },
            {
                'id': 33305,
                'name': '铜带'
            },
            {
                'id': 33306,
                'name': '西北'
            },
            {
                'id': 33307,
                'name': '西方'
            },
            {
                'id': 33308,
                'name': '赞比亚·中央'
            }
        ]
    },
    {
        'id': 334,
        'name': '泽西岛'
    },
    {
        'id': 335,
        'name': '乍得'
    },
    {
        'id': 336,
        'name': '直布罗陀'
    },
    {
        'id': 337,
        'name': '智利',
        'children': [
            {
                'id': 33700,
                'name': '阿劳卡尼亚大区'
            },
            {
                'id': 33701,
                'name': '阿塔卡马大区'
            },
            {
                'id': 33702,
                'name': '安托法加斯塔大区'
            },
            {
                'id': 33703,
                'name': '比奥比奥大区'
            },
            {
                'id': 33704,
                'name': '复活节岛'
            },
            {
                'id': 33705,
                'name': '湖大区'
            },
            {
                'id': 33706,
                'name': '科金博大区'
            },
            {
                'id': 33707,
                'name': '马乌莱大区'
            },
            {
                'id': 33708,
                'name': '麦哲伦-智利南极大区'
            },
            {
                'id': 33709,
                'name': '圣地亚哥'
            },
            {
                'id': 33710,
                'name': '塔拉帕卡大区'
            },
            {
                'id': 33711,
                'name': '瓦尔帕莱索大区'
            },
            {
                'id': 33712,
                'name': '伊瓦涅斯将军的艾森大区'
            }
        ]
    },
    {
        'id': 338,
        'name': '中非共和国',
        'children': [
            {
                'id': 33800,
                'name': '巴明吉-班戈兰'
            },
            {
                'id': 33801,
                'name': '班吉直辖市'
            },
            {
                'id': 33802,
                'name': '宾博'
            },
            {
                'id': 33803,
                'name': '凯莫'
            },
            {
                'id': 33804,
                'name': '洛巴伊'
            },
            {
                'id': 33805,
                'name': '曼贝雷-卡代'
            },
            {
                'id': 33806,
                'name': '姆博穆'
            },
            {
                'id': 33807,
                'name': '纳纳-格里比齐'
            },
            {
                'id': 33808,
                'name': '纳纳-曼贝雷'
            },
            {
                'id': 33809,
                'name': '桑加-姆巴埃雷'
            },
            {
                'id': 33810,
                'name': '上科托'
            },
            {
                'id': 33811,
                'name': '上姆博穆'
            },
            {
                'id': 33812,
                'name': '瓦卡'
            },
            {
                'id': 33813,
                'name': '瓦卡加'
            },
            {
                'id': 33814,
                'name': '瓦姆'
            },
            {
                'id': 33815,
                'name': '瓦姆-彭代'
            },
            {
                'id': 33816,
                'name': '翁贝拉-姆波科'
            },
            {
                'id': 33817,
                'name': '下科托'
            }
        ]
    }
];

export default locations;
