const subjects = [
    {
        'id': 10,
        'name': '理学',
        'children': [
            {
                'id': 1000,
                'name': '数学类',
                'children': [
                    {
                        'id': 100000,
                        'name': '数学与应用数学'
                    },
                    {
                        'id': 100001,
                        'name': '信息与计算科学'
                    }
                ]
            },
            {
                'id': 1001,
                'name': '物理学类',
                'children': [
                    {
                        'id': 100100,
                        'name': '物理学'
                    },
                    {
                        'id': 100101,
                        'name': '应用物理学'
                    },
                    {
                        'id': 100102,
                        'name': '核物理'
                    }
                ]
            },
            {
                'id': 1002,
                'name': '化学类',
                'children': [
                    {
                        'id': 100200,
                        'name': '化学'
                    },
                    {
                        'id': 100201,
                        'name': '应用化学'
                    }
                ]
            },
            {
                'id': 1003,
                'name': '天文学类',
                'children': [
                    {
                        'id': 100300,
                        'name': '天文学'
                    }
                ]
            },
            {
                'id': 1004,
                'name': '地理科学类',
                'children': [
                    {
                        'id': 100400,
                        'name': '地理科学'
                    },
                    {
                        'id': 100401,
                        'name': '自然地理与资源环境'
                    },
                    {
                        'id': 100402,
                        'name': '人文地理与城乡规划'
                    },
                    {
                        'id': 100403,
                        'name': '地理信息科学'
                    }
                ]
            },
            {
                'id': 1005,
                'name': '大气科学类',
                'children': [
                    {
                        'id': 100500,
                        'name': '大气科学类'
                    },
                    {
                        'id': 100501,
                        'name': '应用气象学'
                    }
                ]
            },
            {
                'id': 1006,
                'name': '海洋科学类',
                'children': [
                    {
                        'id': 100600,
                        'name': '海洋科学'
                    },
                    {
                        'id': 100601,
                        'name': '海洋技术'
                    }
                ]
            },
            {
                'id': 1007,
                'name': '地球物理学类',
                'children': [
                    {
                        'id': 100700,
                        'name': '地球物理学'
                    },
                    {
                        'id': 100701,
                        'name': '空间科学与技术'
                    }
                ]
            },
            {
                'id': 1008,
                'name': '地质学类',
                'children': [
                    {
                        'id': 100800,
                        'name': '地质学'
                    },
                    {
                        'id': 100801,
                        'name': '地球化学'
                    }
                ]
            },
            {
                'id': 1009,
                'name': '生物科学类',
                'children': [
                    {
                        'id': 100900,
                        'name': '生物科学'
                    },
                    {
                        'id': 100901,
                        'name': '生物技术'
                    },
                    {
                        'id': 100902,
                        'name': '生物信息学'
                    },
                    {
                        'id': 100903,
                        'name': '生态学'
                    }
                ]
            },
            {
                'id': 1010,
                'name': '心理学类',
                'children': [
                    {
                        'id': 101000,
                        'name': '心理学'
                    },
                    {
                        'id': 101001,
                        'name': '应用心理学'
                    }
                ]
            },
            {
                'id': 1011,
                'name': '统计学类',
                'children': [
                    {
                        'id': 101100,
                        'name': '统计学'
                    },
                    {
                        'id': 101101,
                        'name': '应用统计学'
                    }
                ]
            }
        ]
    },
    {
        'id': 11,
        'name': '工学',
        'children': [
            {
                'id': 1100,
                'name': '力学类',
                'children': [
                    {
                        'id': 110000,
                        'name': '理论与应用力学'
                    },
                    {
                        'id': 110001,
                        'name': '工程力学'
                    }
                ]
            },
            {
                'id': 1101,
                'name': '机械类',
                'children': [
                    {
                        'id': 110100,
                        'name': '机械工程'
                    },
                    {
                        'id': 110101,
                        'name': '机械设计制造及其自动化'
                    },
                    {
                        'id': 110102,
                        'name': '材料成型及控制工程'
                    },
                    {
                        'id': 110103,
                        'name': '机械电子工程'
                    },
                    {
                        'id': 110104,
                        'name': '工业设计'
                    },
                    {
                        'id': 110105,
                        'name': '过程装备与控制工程'
                    },
                    {
                        'id': 110106,
                        'name': '车辆工程'
                    },
                    {
                        'id': 110107,
                        'name': '汽车服务工程'
                    }
                ]
            },
            {
                'id': 1102,
                'name': '仪器类',
                'children': [
                    {
                        'id': 110200,
                        'name': '测控技术与仪器'
                    }
                ]
            },
            {
                'id': 1103,
                'name': '材料类',
                'children': [
                    {
                        'id': 110300,
                        'name': '材料科学与工程'
                    },
                    {
                        'id': 110301,
                        'name': '材料物理'
                    },
                    {
                        'id': 110302,
                        'name': '材料化学'
                    },
                    {
                        'id': 110303,
                        'name': '冶金工程'
                    },
                    {
                        'id': 110304,
                        'name': '金属材料工程'
                    },
                    {
                        'id': 110305,
                        'name': '无机非金属材料工程'
                    },
                    {
                        'id': 110306,
                        'name': '高分子材料与工程'
                    },
                    {
                        'id': 110307,
                        'name': '复合材料与工程'
                    }
                ]
            },
            {
                'id': 1104,
                'name': '能源动力类',
                'children': [
                    {
                        'id': 110400,
                        'name': '能源与动力工程'
                    }
                ]
            },
            {
                'id': 1105,
                'name': '电气类',
                'children': [
                    {
                        'id': 110500,
                        'name': '电气工程及其自动化'
                    }
                ]
            },
            {
                'id': 1106,
                'name': '电子信息类',
                'children': [
                    {
                        'id': 110600,
                        'name': '电子信息工程'
                    },
                    {
                        'id': 110601,
                        'name': '电子科学与技术'
                    },
                    {
                        'id': 110602,
                        'name': '通信工程'
                    },
                    {
                        'id': 110603,
                        'name': '微电子科学与工程'
                    },
                    {
                        'id': 110604,
                        'name': '光电信息科学与工程'
                    },
                    {
                        'id': 110605,
                        'name': '信息工程'
                    }
                ]
            },
            {
                'id': 1107,
                'name': '自动化类',
                'children': [
                    {
                        'id': 110700,
                        'name': '自动化'
                    }
                ]
            },
            {
                'id': 1108,
                'name': '计算机类',
                'children': [
                    {
                        'id': 110800,
                        'name': '计算机科学与技术'
                    },
                    {
                        'id': 110801,
                        'name': '软件工程'
                    },
                    {
                        'id': 110802,
                        'name': '网络工程'
                    },
                    {
                        'id': 110803,
                        'name': '信息安全'
                    },
                    {
                        'id': 110804,
                        'name': '物联网工程'
                    },
                    {
                        'id': 110805,
                        'name': '数字媒体技术'
                    },
                    {
                        'id': 110806,
                        'name': '人工智能'
                    }
                ]
            },
            {
                'id': 1109,
                'name': '土木类',
                'children': [
                    {
                        'id': 110900,
                        'name': '土木工程'
                    },
                    {
                        'id': 110901,
                        'name': '建筑环境与能源应用工程'
                    },
                    {
                        'id': 110902,
                        'name': '给排水科学与工程'
                    },
                    {
                        'id': 110903,
                        'name': '建筑电气与智能化'
                    }
                ]
            },
            {
                'id': 1110,
                'name': '水利类',
                'children': [
                    {
                        'id': 111000,
                        'name': '水利水电工程'
                    },
                    {
                        'id': 111001,
                        'name': '水文与水资源工程'
                    },
                    {
                        'id': 111002,
                        'name': '港口航道与海岸工程'
                    }
                ]
            },
            {
                'id': 1111,
                'name': '测绘类',
                'children': [
                    {
                        'id': 111100,
                        'name': '测绘工程'
                    },
                    {
                        'id': 111101,
                        'name': '遥感科学与技术'
                    }
                ]
            },
            {
                'id': 1112,
                'name': '化工与制药类',
                'children': [
                    {
                        'id': 111200,
                        'name': '化学工程与工艺'
                    },
                    {
                        'id': 111201,
                        'name': '制药工程'
                    }
                ]
            },
            {
                'id': 1113,
                'name': '地质类',
                'children': [
                    {
                        'id': 111300,
                        'name': '地质工程'
                    },
                    {
                        'id': 111301,
                        'name': '勘查技术与工程'
                    },
                    {
                        'id': 111302,
                        'name': '资源勘查工程'
                    }
                ]
            },
            {
                'id': 1114,
                'name': '矿业类',
                'children': [
                    {
                        'id': 111400,
                        'name': '采矿工程'
                    },
                    {
                        'id': 111401,
                        'name': '石油工程'
                    },
                    {
                        'id': 111402,
                        'name': '矿物加工工程'
                    },
                    {
                        'id': 111403,
                        'name': '油气储运工程'
                    }
                ]
            },
            {
                'id': 1115,
                'name': '纺织类',
                'children': [
                    {
                        'id': 111500,
                        'name': '纺织工程'
                    },
                    {
                        'id': 111501,
                        'name': '服装设计与工程'
                    }
                ]
            },
            {
                'id': 1116,
                'name': '轻工类',
                'children': [
                    {
                        'id': 111600,
                        'name': '轻化工程'
                    },
                    {
                        'id': 111601,
                        'name': '包装工程'
                    },
                    {
                        'id': 111602,
                        'name': '印刷工程'
                    }
                ]
            },
            {
                'id': 1117,
                'name': '交通运输类',
                'children': [
                    {
                        'id': 111700,
                        'name': '交通运输'
                    },
                    {
                        'id': 111701,
                        'name': '交通工程'
                    },
                    {
                        'id': 111702,
                        'name': '航海技术'
                    },
                    {
                        'id': 111703,
                        'name': '轮机工程'
                    },
                    {
                        'id': 111704,
                        'name': '飞行技术'
                    }
                ]
            },
            {
                'id': 1118,
                'name': '海洋工程类',
                'children': [
                    {
                        'id': 111800,
                        'name': '船舶与海洋工程'
                    }
                ]
            },
            {
                'id': 1119,
                'name': '航空航天类',
                'children': [
                    {
                        'id': 111900,
                        'name': '航空航天工程'
                    },
                    {
                        'id': 111901,
                        'name': '飞行器设计与工程'
                    },
                    {
                        'id': 111902,
                        'name': '飞行器制造工程'
                    },
                    {
                        'id': 111903,
                        'name': '飞行器动力工程'
                    },
                    {
                        'id': 111904,
                        'name': '飞行器环境与生命保障工程'
                    }
                ]
            },
            {
                'id': 1120,
                'name': '兵器类',
                'children': [
                    {
                        'id': 112000,
                        'name': '武器系统与工程'
                    },
                    {
                        'id': 112001,
                        'name': '武器发射工程'
                    },
                    {
                        'id': 112002,
                        'name': '探测制导与控制技术'
                    },
                    {
                        'id': 112003,
                        'name': '弹药工程与爆炸技术'
                    },
                    {
                        'id': 112004,
                        'name': '特种能源技术与工程'
                    },
                    {
                        'id': 112005,
                        'name': '装甲车辆工程'
                    },
                    {
                        'id': 112006,
                        'name': '信息对抗技术'
                    }
                ]
            },
            {
                'id': 1121,
                'name': '核工程类',
                'children': [
                    {
                        'id': 112100,
                        'name': '核工程与核技术'
                    },
                    {
                        'id': 112101,
                        'name': '辐射防护与核安全'
                    },
                    {
                        'id': 112102,
                        'name': '工程物理'
                    },
                    {
                        'id': 112103,
                        'name': '核化工与核燃料工程'
                    }
                ]
            },
            {
                'id': 1122,
                'name': '农业工程类',
                'children': [
                    {
                        'id': 112200,
                        'name': '农业工程'
                    },
                    {
                        'id': 112201,
                        'name': '农业机械化及其自动化'
                    },
                    {
                        'id': 112202,
                        'name': '农业电气化'
                    },
                    {
                        'id': 112203,
                        'name': '农业建筑环境与能源工程'
                    },
                    {
                        'id': 112204,
                        'name': '农业水利工程'
                    }
                ]
            },
            {
                'id': 1123,
                'name': '林业工程类',
                'children': [
                    {
                        'id': 112300,
                        'name': '森林工程'
                    },
                    {
                        'id': 112301,
                        'name': '木材科学与工程'
                    },
                    {
                        'id': 112302,
                        'name': '林产化工'
                    }
                ]
            },
            {
                'id': 1124,
                'name': '环境科学与工程类',
                'children': [
                    {
                        'id': 112400,
                        'name': '环境科学与工程'
                    },
                    {
                        'id': 112401,
                        'name': '环境工程'
                    },
                    {
                        'id': 112402,
                        'name': '环境科学'
                    },
                    {
                        'id': 112403,
                        'name': '环境生态工程'
                    }
                ]
            },
            {
                'id': 1125,
                'name': '生物医学工程类',
                'children': [
                    {
                        'id': 112500,
                        'name': '生物医学工程'
                    }
                ]
            },
            {
                'id': 1126,
                'name': '食品科学与工程类',
                'children': [
                    {
                        'id': 112600,
                        'name': '食品科学与工程'
                    },
                    {
                        'id': 112601,
                        'name': '食品质量与安全'
                    },
                    {
                        'id': 112602,
                        'name': '粮食工程'
                    },
                    {
                        'id': 112603,
                        'name': '乳品工程'
                    },
                    {
                        'id': 112604,
                        'name': '酿酒工程'
                    }
                ]
            },
            {
                'id': 1127,
                'name': '建筑类',
                'children': [
                    {
                        'id': 112700,
                        'name': '建筑学'
                    },
                    {
                        'id': 112701,
                        'name': '城乡规划'
                    },
                    {
                        'id': 112702,
                        'name': '风景园林'
                    }
                ]
            },
            {
                'id': 1128,
                'name': '安全科学与工程类',
                'children': [
                    {
                        'id': 112800,
                        'name': '安全工程'
                    }
                ]
            },
            {
                'id': 1129,
                'name': '生物工程类',
                'children': [
                    {
                        'id': 112900,
                        'name': '生物工程'
                    }
                ]
            },
            {
                'id': 1130,
                'name': '公安技术类',
                'children': [
                    {
                        'id': 113000,
                        'name': '刑事科学技术'
                    },
                    {
                        'id': 113001,
                        'name': '消防工程'
                    }
                ]
            }
        ]
    },
    {
        'id': 12,
        'name': '农学',
        'children': [
            {
                'id': 1200,
                'name': '植物生产类',
                'children': [
                    {
                        'id': 120000,
                        'name': '农学'
                    },
                    {
                        'id': 120001,
                        'name': '园艺'
                    },
                    {
                        'id': 120002,
                        'name': '植物保护'
                    },
                    {
                        'id': 120003,
                        'name': '植物科学与技术'
                    },
                    {
                        'id': 120004,
                        'name': '种子科学与工程'
                    },
                    {
                        'id': 120005,
                        'name': '设施农业科学与工程'
                    }
                ]
            },
            {
                'id': 1201,
                'name': '自然保护与环境生态类',
                'children': [
                    {
                        'id': 120100,
                        'name': '农业资源与环境'
                    },
                    {
                        'id': 120101,
                        'name': '野生动物与自然保护区管理'
                    },
                    {
                        'id': 120102,
                        'name': '水土保持与荒漠化防治'
                    }
                ]
            },
            {
                'id': 1202,
                'name': '动物生产类',
                'children': [
                    {
                        'id': 120200,
                        'name': '动物科学'
                    }
                ]
            },
            {
                'id': 1203,
                'name': '动物医学类',
                'children': [
                    {
                        'id': 120300,
                        'name': '动物医学'
                    },
                    {
                        'id': 120301,
                        'name': '动物药学'
                    }
                ]
            },
            {
                'id': 1204,
                'name': '林学类',
                'children': [
                    {
                        'id': 120400,
                        'name': '林学'
                    },
                    {
                        'id': 120401,
                        'name': '园林'
                    },
                    {
                        'id': 120402,
                        'name': '森林保护'
                    }
                ]
            },
            {
                'id': 1205,
                'name': '水产类',
                'children': [
                    {
                        'id': 120500,
                        'name': '水产养殖学'
                    },
                    {
                        'id': 120501,
                        'name': '海洋渔业科学与技术'
                    }
                ]
            },
            {
                'id': 1206,
                'name': '草学类',
                'children': [
                    {
                        'id': 120600,
                        'name': '草业科学'
                    }
                ]
            }
        ]
    },
    {
        'id': 13,
        'name': '医学',
        'children': [
            {
                'id': 1300,
                'name': '基础医学类',
                'children': [
                    {
                        'id': 130000,
                        'name': '基础医学'
                    }
                ]
            },
            {
                'id': 1301,
                'name': '临床医学类',
                'children': [
                    {
                        'id': 130100,
                        'name': '临床医学'
                    }
                ]
            },
            {
                'id': 1302,
                'name': '口腔医学类',
                'children': [
                    {
                        'id': 130200,
                        'name': '口腔医学'
                    }
                ]
            },
            {
                'id': 1303,
                'name': '公共卫生与预防医学类',
                'children': [
                    {
                        'id': 130300,
                        'name': '预防医学'
                    },
                    {
                        'id': 130301,
                        'name': '食品卫生与营养学'
                    }
                ]
            },
            {
                'id': 1304,
                'name': '中医学类',
                'children': [
                    {
                        'id': 130400,
                        'name': '中医学'
                    },
                    {
                        'id': 130401,
                        'name': '针灸推拿学'
                    },
                    {
                        'id': 130402,
                        'name': '藏医学'
                    },
                    {
                        'id': 130403,
                        'name': '蒙医学'
                    },
                    {
                        'id': 130404,
                        'name': '维医学'
                    },
                    {
                        'id': 130405,
                        'name': '壮医学'
                    },
                    {
                        'id': 130406,
                        'name': '哈医学'
                    }
                ]
            },
            {
                'id': 1305,
                'name': '中西医结合类',
                'children': [
                    {
                        'id': 130500,
                        'name': '中西医临床医学'
                    }
                ]
            },
            {
                'id': 1306,
                'name': '药学类',
                'children': [
                    {
                        'id': 130600,
                        'name': '药学'
                    },
                    {
                        'id': 130601,
                        'name': '药物制剂'
                    }
                ]
            },
            {
                'id': 1307,
                'name': '中药学类',
                'children': [
                    {
                        'id': 130700,
                        'name': '中药学'
                    },
                    {
                        'id': 130701,
                        'name': '中药资源与开发'
                    }
                ]
            },
            {
                'id': 1308,
                'name': '法医学类',
                'children': [
                    {
                        'id': 130800,
                        'name': '法医学'
                    }
                ]
            },
            {
                'id': 1309,
                'name': '医学技术类',
                'children': [
                    {
                        'id': 130900,
                        'name': '医学检验技术'
                    },
                    {
                        'id': 130901,
                        'name': '医学实验技术'
                    },
                    {
                        'id': 130902,
                        'name': '医学影像技术'
                    },
                    {
                        'id': 130903,
                        'name': '眼视光学'
                    },
                    {
                        'id': 130904,
                        'name': '康复治疗学'
                    },
                    {
                        'id': 130905,
                        'name': '口腔医学技术'
                    },
                    {
                        'id': 130906,
                        'name': '卫生检验与检疫'
                    }
                ]
            },
            {
                'id': 1310,
                'name': '护理学类',
                'children': [
                    {
                        'id': 131000,
                        'name': '护理学'
                    }
                ]
            }
        ]
    },
    {
        'id': 14,
        'name': '哲学',
        'children': [
            {
                'id': 1400,
                'name': '哲学类',
                'children': [
                    {
                        'id': 140000,
                        'name': '哲学'
                    },
                    {
                        'id': 140001,
                        'name': '逻辑学'
                    },
                    {
                        'id': 140002,
                        'name': '宗教学'
                    }
                ]
            }
        ]
    },
    {
        'id': 15,
        'name': '经济学',
        'children': [
            {
                'id': 1500,
                'name': '经济学类',
                'children': [
                    {
                        'id': 150000,
                        'name': '经济学'
                    },
                    {
                        'id': 150001,
                        'name': '经济统计学'
                    }
                ]
            },
            {
                'id': 1501,
                'name': '财政学类',
                'children': [
                    {
                        'id': 150100,
                        'name': '财政学'
                    },
                    {
                        'id': 150101,
                        'name': '税收学'
                    }
                ]
            },
            {
                'id': 1502,
                'name': '金融学类',
                'children': [
                    {
                        'id': 150200,
                        'name': '金融学'
                    },
                    {
                        'id': 150201,
                        'name': '金融工程'
                    },
                    {
                        'id': 150202,
                        'name': '保险学'
                    },
                    {
                        'id': 150203,
                        'name': '投资学'
                    }
                ]
            },
            {
                'id': 1503,
                'name': '经济与贸易类',
                'children': [
                    {
                        'id': 150300,
                        'name': '国际经济与贸易'
                    },
                    {
                        'id': 150301,
                        'name': '贸易经济'
                    }
                ]
            }
        ]
    },
    {
        'id': 16,
        'name': '法学',
        'children': [
            {
                'id': 1600,
                'name': '法学类',
                'children': [
                    {
                        'id': 160000,
                        'name': '法学'
                    }
                ]
            },
            {
                'id': 1601,
                'name': '政治学类',
                'children': [
                    {
                        'id': 160100,
                        'name': '政治学与行政学'
                    },
                    {
                        'id': 160101,
                        'name': '国际政治'
                    },
                    {
                        'id': 160102,
                        'name': '外交学'
                    }
                ]
            },
            {
                'id': 1602,
                'name': '社会学类',
                'children': [
                    {
                        'id': 160200,
                        'name': '社会学'
                    },
                    {
                        'id': 160201,
                        'name': '社会工作'
                    }
                ]
            },
            {
                'id': 1603,
                'name': '民族学类',
                'children': [
                    {
                        'id': 160300,
                        'name': '民族学'
                    }
                ]
            },
            {
                'id': 1604,
                'name': '马克思主义理论类',
                'children': [
                    {
                        'id': 160400,
                        'name': '科学社会主义'
                    },
                    {
                        'id': 160401,
                        'name': '中国共产党历史'
                    },
                    {
                        'id': 160402,
                        'name': '思想政治教育'
                    }
                ]
            },
            {
                'id': 1605,
                'name': '公安学类',
                'children': [
                    {
                        'id': 160500,
                        'name': '治安学'
                    },
                    {
                        'id': 160501,
                        'name': '侦查学'
                    },
                    {
                        'id': 160502,
                        'name': '边防管理'
                    }
                ]
            }
        ]
    },
    {
        'id': 17,
        'name': '教育学',
        'children': [
            {
                'id': 1700,
                'name': '教育学类',
                'children': [
                    {
                        'id': 170000,
                        'name': '教育学'
                    },
                    {
                        'id': 170001,
                        'name': '科学教育'
                    },
                    {
                        'id': 170002,
                        'name': '人文教育'
                    },
                    {
                        'id': 170003,
                        'name': '教育技术学'
                    },
                    {
                        'id': 170004,
                        'name': '艺术教育'
                    },
                    {
                        'id': 170005,
                        'name': '学前教育'
                    },
                    {
                        'id': 170006,
                        'name': '小学教育'
                    },
                    {
                        'id': 170007,
                        'name': '特殊教育'
                    }
                ]
            },
            {
                'id': 1701,
                'name': '体育学类',
                'children': [
                    {
                        'id': 170100,
                        'name': '体育教育'
                    },
                    {
                        'id': 170101,
                        'name': '运动训练'
                    },
                    {
                        'id': 170102,
                        'name': '社会体育指导与管理'
                    },
                    {
                        'id': 170103,
                        'name': '武术与民族传统体育'
                    },
                    {
                        'id': 170104,
                        'name': '运动人体科学'
                    }
                ]
            }
        ]
    },
    {
        'id': 18,
        'name': '文学',
        'children': [
            {
                'id': 1800,
                'name': '中国语言文学类',
                'children': [
                    {
                        'id': 180000,
                        'name': '汉语言文学'
                    },
                    {
                        'id': 180001,
                        'name': '汉语言'
                    },
                    {
                        'id': 180002,
                        'name': '汉语国际教育'
                    },
                    {
                        'id': 180003,
                        'name': '中国少数民族语言文学'
                    },
                    {
                        'id': 180004,
                        'name': '古典文献学'
                    }
                ]
            },
            {
                'id': 1801,
                'name': '外国语言文学类',
                'children': [
                    {
                        'id': 180100,
                        'name': '英语'
                    },
                    {
                        'id': 180101,
                        'name': '俄语'
                    },
                    {
                        'id': 180102,
                        'name': '德语'
                    },
                    {
                        'id': 180103,
                        'name': '法语'
                    },
                    {
                        'id': 180104,
                        'name': '西班牙语'
                    },
                    {
                        'id': 180105,
                        'name': '阿拉伯语'
                    },
                    {
                        'id': 180106,
                        'name': '日语'
                    },
                    {
                        'id': 180107,
                        'name': '波斯语'
                    },
                    {
                        'id': 180108,
                        'name': '朝鲜语'
                    },
                    {
                        'id': 180109,
                        'name': '菲律宾语'
                    },
                    {
                        'id': 180110,
                        'name': '梵语巴利语'
                    },
                    {
                        'id': 180111,
                        'name': '印度尼西亚语'
                    },
                    {
                        'id': 180112,
                        'name': '印地语'
                    },
                    {
                        'id': 180113,
                        'name': '柬埔寨语'
                    },
                    {
                        'id': 180114,
                        'name': '老挝语'
                    },
                    {
                        'id': 180115,
                        'name': '缅甸语'
                    },
                    {
                        'id': 180116,
                        'name': '马来语'
                    },
                    {
                        'id': 180117,
                        'name': '蒙古语'
                    },
                    {
                        'id': 180118,
                        'name': '僧伽罗语'
                    },
                    {
                        'id': 180119,
                        'name': '泰语'
                    },
                    {
                        'id': 180120,
                        'name': '乌尔都语'
                    },
                    {
                        'id': 180121,
                        'name': '希伯来语'
                    },
                    {
                        'id': 180122,
                        'name': '越南语'
                    },
                    {
                        'id': 180123,
                        'name': '豪萨语'
                    },
                    {
                        'id': 180124,
                        'name': '斯瓦希里语'
                    },
                    {
                        'id': 180125,
                        'name': '阿尔巴尼亚语'
                    },
                    {
                        'id': 180126,
                        'name': '保加利亚语'
                    },
                    {
                        'id': 180127,
                        'name': '波兰语'
                    },
                    {
                        'id': 180128,
                        'name': '捷克语'
                    },
                    {
                        'id': 180129,
                        'name': '斯洛伐克语'
                    },
                    {
                        'id': 180130,
                        'name': '罗马尼亚语'
                    },
                    {
                        'id': 180131,
                        'name': '葡萄牙语'
                    },
                    {
                        'id': 180132,
                        'name': '瑞典语'
                    },
                    {
                        'id': 180133,
                        'name': '塞尔维亚语'
                    },
                    {
                        'id': 180134,
                        'name': '土耳其语'
                    },
                    {
                        'id': 180135,
                        'name': '希腊语'
                    },
                    {
                        'id': 180136,
                        'name': '匈牙利语'
                    },
                    {
                        'id': 180137,
                        'name': '意大利语'
                    },
                    {
                        'id': 180138,
                        'name': '泰米尔语'
                    },
                    {
                        'id': 180139,
                        'name': '普什图语'
                    },
                    {
                        'id': 180140,
                        'name': '世界语'
                    },
                    {
                        'id': 180141,
                        'name': '孟加拉语'
                    },
                    {
                        'id': 180142,
                        'name': '尼泊尔语'
                    },
                    {
                        'id': 180143,
                        'name': '克罗地亚语'
                    },
                    {
                        'id': 180144,
                        'name': '荷兰语'
                    },
                    {
                        'id': 180145,
                        'name': '芬兰语'
                    },
                    {
                        'id': 180146,
                        'name': '乌克兰语'
                    },
                    {
                        'id': 180147,
                        'name': '挪威语'
                    },
                    {
                        'id': 180148,
                        'name': '丹麦语'
                    },
                    {
                        'id': 180149,
                        'name': '冰岛语'
                    },
                    {
                        'id': 180150,
                        'name': '爱尔兰语'
                    },
                    {
                        'id': 180151,
                        'name': '拉脱维亚语'
                    },
                    {
                        'id': 180152,
                        'name': '立陶宛语'
                    },
                    {
                        'id': 180153,
                        'name': '斯洛文尼亚语'
                    },
                    {
                        'id': 180154,
                        'name': '爱沙尼亚语'
                    },
                    {
                        'id': 180155,
                        'name': '马耳他语'
                    },
                    {
                        'id': 180156,
                        'name': '哈萨克语'
                    },
                    {
                        'id': 180157,
                        'name': '乌兹别克语'
                    },
                    {
                        'id': 180158,
                        'name': '祖鲁语'
                    },
                    {
                        'id': 180159,
                        'name': '拉丁语'
                    },
                    {
                        'id': 180160,
                        'name': '翻译'
                    },
                    {
                        'id': 180161,
                        'name': '商务英语'
                    }
                ]
            },
            {
                'id': 1802,
                'name': '新闻传播学类',
                'children': [
                    {
                        'id': 180200,
                        'name': '新闻学'
                    },
                    {
                        'id': 180201,
                        'name': '广播电视学'
                    },
                    {
                        'id': 180202,
                        'name': '广告学'
                    },
                    {
                        'id': 180203,
                        'name': '传播学'
                    },
                    {
                        'id': 180204,
                        'name': '编辑出版学'
                    }
                ]
            }
        ]
    },
    {
        'id': 19,
        'name': '历史学',
        'children': [
            {
                'id': 1900,
                'name': '历史学类',
                'children': [
                    {
                        'id': 190000,
                        'name': '历史学'
                    },
                    {
                        'id': 190001,
                        'name': '世界史'
                    },
                    {
                        'id': 190002,
                        'name': '考古学'
                    },
                    {
                        'id': 190003,
                        'name': '文物与博物馆学'
                    }
                ]
            }
        ]
    },
    {
        'id': 20,
        'name': '管理学',
        'children': [
            {
                'id': 2000,
                'name': '管理科学与工程类',
                'children': [
                    {
                        'id': 200000,
                        'name': '管理科学'
                    },
                    {
                        'id': 200001,
                        'name': '信息管理与信息系统'
                    },
                    {
                        'id': 200002,
                        'name': '工程管理'
                    },
                    {
                        'id': 200003,
                        'name': '房地产开发与管理'
                    },
                    {
                        'id': 200004,
                        'name': '工程造价'
                    }
                ]
            },
            {
                'id': 2001,
                'name': '工商管理类',
                'children': [
                    {
                        'id': 200100,
                        'name': '工商管理'
                    },
                    {
                        'id': 200101,
                        'name': '市场营销'
                    },
                    {
                        'id': 200102,
                        'name': '会计学'
                    },
                    {
                        'id': 200103,
                        'name': '财务管理'
                    },
                    {
                        'id': 200104,
                        'name': '国际商务'
                    },
                    {
                        'id': 200105,
                        'name': '人力资源管理'
                    },
                    {
                        'id': 200106,
                        'name': '审计学'
                    },
                    {
                        'id': 200107,
                        'name': '资产评估'
                    },
                    {
                        'id': 200108,
                        'name': '物业管理'
                    },
                    {
                        'id': 200109,
                        'name': '文化产业管理'
                    }
                ]
            },
            {
                'id': 2002,
                'name': '农业经济管理类',
                'children': [
                    {
                        'id': 200200,
                        'name': '农村区域发展'
                    }
                ]
            },
            {
                'id': 2003,
                'name': '公共管理类',
                'children': [
                    {
                        'id': 200300,
                        'name': '公共事业管理'
                    },
                    {
                        'id': 200301,
                        'name': '行政管理'
                    },
                    {
                        'id': 200302,
                        'name': '劳动与社会保障'
                    },
                    {
                        'id': 200303,
                        'name': '土地资源管理'
                    },
                    {
                        'id': 200304,
                        'name': '城市管理'
                    }
                ]
            },
            {
                'id': 2004,
                'name': '图书情报与档案管理类',
                'children': [
                    {
                        'id': 200400,
                        'name': '图书馆学'
                    },
                    {
                        'id': 200401,
                        'name': '档案学'
                    },
                    {
                        'id': 200402,
                        'name': '信息资源管理'
                    }
                ]
            },
            {
                'id': 2005,
                'name': '物流管理与工程类',
                'children': [
                    {
                        'id': 200500,
                        'name': '物流管理'
                    },
                    {
                        'id': 200501,
                        'name': '物流工程'
                    }
                ]
            },
            {
                'id': 2006,
                'name': '工业工程类'
            },
            {
                'id': 2007,
                'name': '电子商务类',
                'children': [
                    {
                        'id': 200700,
                        'name': '电子商务'
                    }
                ]
            },
            {
                'id': 2008,
                'name': '旅游管理类',
                'children': [
                    {
                        'id': 200800,
                        'name': '旅游管理'
                    },
                    {
                        'id': 200801,
                        'name': '酒店管理'
                    },
                    {
                        'id': 200802,
                        'name': '会展经济与管理'
                    }
                ]
            }
        ]
    }
];

export default subjects;
